{
    "head": {
        "name": "PEP",
        "size": 501,
        "source": "Textbook published by People’s  Education  Press  in  2018",
        "original_language": "Chinese"
    },
    "body": [
        {
            "id": 1,
            "uid": "da42da18ef6311ea92553413e8a4c977",
            "zh_text": "学校有14棵杨树，杨树的棵数是松树的2倍，柳树比松树多4棵，有多少棵柳树?",
            "en_text": "There are 14 poplar trees in the school. The number of poplar trees is twice that of pine trees. There are 4 more willow trees than pine trees. How many willow trees are there?",
            "equation": "14/2+4",
            "ans": "11.0"
        },
        {
            "id": 2,
            "uid": "da42da19ef6311ea92553413e8a4c977",
            "zh_text": "一只东北虎的重量是360千克，东北虎的重量大约是一只鸵鸟的4倍，东北虎是一只企鹅的9倍.鸵鸟多少千克?",
            "en_text": "The weight of a Siberian tiger is 360 kilograms, the weight of a Siberian tiger is about 4 times that of an ostrich, and a Siberian tiger is 9 times that of a penguin. How many kilograms is an ostrich?",
            "equation": "360/4/9",
            "ans": "10.0"
        },
        {
            "id": 3,
            "uid": "da42da1aef6311ea92553413e8a4c977",
            "zh_text": "星光小学832名学生分4批去参观天文馆.平均每批有多少名学生?",
            "en_text": "832 students from Xingguang Primary School visited the planetarium in 4 batches. On average, how many students are there in each batch?",
            "equation": "832/4",
            "ans": "208.0"
        },
        {
            "id": 4,
            "uid": "da42da1bef6311ea92553413e8a4c977",
            "zh_text": "奥林匹克火炬在某地4天传递了816千米.平均每天传递多少千米?",
            "en_text": "The Olympic torch passed 816 kilometers in a certain place in 4 days. How many kilometers is passed on average every day?",
            "equation": "816/4",
            "ans": "204.0"
        },
        {
            "id": 5,
            "uid": "da42da1cef6311ea92553413e8a4c977",
            "zh_text": "公园道路上放花每一边放342个盆，2边一共放多少个盆?",
            "en_text": "There are 342 flower pots on each side of the park road. How many flower pots are there on 2 sides?",
            "equation": "342*2",
            "ans": "684.0"
        },
        {
            "id": 6,
            "uid": "da42da1def6311ea92553413e8a4c977",
            "zh_text": "年级有90名学生，每两名用1张课桌，所有学生需要多少张课桌?",
            "en_text": "There are 90 students in the grade, and every two uses 1 desk. How many desks do all students need?",
            "equation": "90/2",
            "ans": "45.0"
        },
        {
            "id": 7,
            "uid": "da42da1eef6311ea92553413e8a4c977",
            "zh_text": "三年级一班和二班一共栽树42棵，一班和二班平均每班栽树多少棵?",
            "en_text": "A total of 42 trees are planted in the first and second classes of the third grade. How many trees are planted in each class on average in the first and second classes?",
            "equation": "42/2",
            "ans": "21.0"
        },
        {
            "id": 8,
            "uid": "da42da1fef6311ea92553413e8a4c977",
            "zh_text": "小明一共有238张照片，相册的每页可以插6张.所有照片要插多少页?",
            "en_text": "Xiao Ming has a total of 238 photos, and every 6 pages of the album can be inserted 6 photos. How many pages should I insert all the photos?",
            "equation": "238/6/6",
            "ans": "6.611111111111112"
        },
        {
            "id": 9,
            "uid": "da42da20ef6311ea92553413e8a4c977",
            "zh_text": "有部儿童电视剧共336分钟分8集播放，每集大约播放多少分钟时间?",
            "en_text": "There is a children's TV series with a total of 336 minutes and 8 episodes. How many minutes does each episode play?",
            "equation": "336/8",
            "ans": "42.0"
        },
        {
            "id": 10,
            "uid": "da42da21ef6311ea92553413e8a4c977",
            "zh_text": "一个碗6元钱、一个压力锅138元钱、一个水杯4元钱，买一个压力锅的钱可以买几个碗?",
            "en_text": "A bowl is 6 yuan, a pressure cooker is 138 yuan, and a water cup is 4 yuan. How many bowls can I buy for a pressure cooker?",
            "equation": "138/6",
            "ans": "23.0"
        },
        {
            "id": 11,
            "uid": "da42da22ef6311ea92553413e8a4c977",
            "zh_text": "班级共有46名学生，每两名用2张课桌，所有学生共需要多少张课桌?",
            "en_text": "There are 46 students in the class, with 2 desks for each two. How many desks do all students need?",
            "equation": "46/2*2",
            "ans": "46.0"
        },
        {
            "id": 12,
            "uid": "da42da23ef6311ea92553413e8a4c977",
            "zh_text": "春雨小学389名学生乘车去参观自然博物馆.每辆车限乘45名，所有学生需要多少辆车?",
            "en_text": "The 389 students of Chunyu Primary School took a car to visit the Natural History Museum. There is a limit of 45 for every 45 cars. How many cars do all students need?",
            "equation": "389/45",
            "ans": "8.644444444444442"
        },
        {
            "id": 13,
            "uid": "da42da24ef6311ea92553413e8a4c977",
            "zh_text": "参观科技馆，成人人数是儿童的2倍.如果成人和儿童一共有456人参观，儿童有多少人?",
            "en_text": "Visiting the science and technology museum, the number of adults is twice that of children. If a total of 456 adults and children visit, how many children are there?",
            "equation": "456/(2+1)",
            "ans": "152.0"
        },
        {
            "id": 14,
            "uid": "da430214ef6311ea925f3413e8a4c977",
            "zh_text": "562名学生分4批参观克隆鼠展览.平均每批有多少名学生?",
            "en_text": "562 students visited the cloned mouse exhibition in 4 batches. On average, how many students are there in each batch?",
            "equation": "562/4",
            "ans": "140.5"
        },
        {
            "id": 15,
            "uid": "da430215ef6311ea925f3413e8a4c977",
            "zh_text": "有530把椅子分5次运完.平均每次运多少把?",
            "en_text": "There are 530 chairs shipped in 5 batches. How many chairs are shipped on average each time?",
            "equation": "530/5",
            "ans": "106.0"
        },
        {
            "id": 16,
            "uid": "da430216ef6311ea925f3413e8a4c977",
            "zh_text": "学校买了643盆花平均放进5个花坛，平均每个花坛放多少盆?",
            "en_text": "The school bought 643 potted flowers and put them in an average of 5 flower beds.",
            "equation": "643/5",
            "ans": "128.6"
        },
        {
            "id": 17,
            "uid": "da430217ef6311ea925f3413e8a4c977",
            "zh_text": "三块块草地有教室那么大每天产生的氧气够3个人用，我们班有120个人需要多少块这样的草地产生的氧气?",
            "en_text": "Three pieces of grassland the size of a classroom can produce enough oxygen for 3 people every day. How many pieces of grassland do we need for 120 people in our class?",
            "equation": "120/3*3",
            "ans": "120.0"
        },
        {
            "id": 18,
            "uid": "da430218ef6311ea925f3413e8a4c977",
            "zh_text": "三年级的225名学生要乘5辆车去春游.每辆车应该坐多少名学生?",
            "en_text": "The 225 students in the third grade have to take 5 cars to go to the spring outing. How many students should each car take?",
            "equation": "225/5",
            "ans": "45.0"
        },
        {
            "id": 19,
            "uid": "da430219ef6311ea925f3413e8a4c977",
            "zh_text": "同学们收集塑料瓶，小红收集14个、小兰收集12个、小亮收集11个、小明收集15个，小红小兰小亮和小明平均收集多少个?",
            "en_text": "Students collect plastic bottles, Xiaohong collects 14, Xiaolan collects 12, Xiaoliang collects 11, and Xiaoming collects 15.How many on average is Xiaohong, Xiaolan, Xiaoliang and Xiaoming?",
            "equation": "(14+12+11+15)/5",
            "ans": "10.4"
        },
        {
            "id": 20,
            "uid": "da43021aef6311ea925f3413e8a4c977",
            "zh_text": "有本书一页有23行，每行约有22个字.一页大约有多少个字?",
            "en_text": "There is a book that has 23 lines on a page, and each line has about 22 words. How many words are there on a page?",
            "equation": "22*23",
            "ans": "506.0"
        },
        {
            "id": 21,
            "uid": "da43021bef6311ea925f3413e8a4c977",
            "zh_text": "同学们种树，种了3行是93棵.这块地有12行大约可以种多少棵树苗?",
            "en_text": "The students planted trees, and there were 93 trees in 3 rows. About how many saplings can be planted in this land with 12 rows?",
            "equation": "93/3*12",
            "ans": "372.0"
        },
        {
            "id": 22,
            "uid": "da43021cef6311ea925f3413e8a4c977",
            "zh_text": "小明买了14筒羽毛球，每筒12只.羽毛球一共多少只?",
            "en_text": "Xiao Ming bought 14 tubes of badminton, 12 per tube. How many badmintons are there in total?",
            "equation": "12*14",
            "ans": "168.0"
        },
        {
            "id": 23,
            "uid": "da43021def6311ea925f3413e8a4c977",
            "zh_text": "布置教室需要12串纸鹤，每串12只.共需折多少只纸鹤?",
            "en_text": "To decorate the classroom, you need 12 paper cranes, each with 12. How many paper cranes need to be folded?",
            "equation": "12*12",
            "ans": "144.0"
        },
        {
            "id": 24,
            "uid": "da43021eef6311ea925f3413e8a4c977",
            "zh_text": "自行车运动员每天训练要骑75千米，他30天要骑多少千米?",
            "en_text": "A cyclist trains to ride 75 kilometers a day. How many kilometers does he need to ride in 30 days?",
            "equation": "75*30",
            "ans": "2250.0"
        },
        {
            "id": 25,
            "uid": "da43021fef6311ea925f3413e8a4c977",
            "zh_text": "橘子园有26行橘子树，每行有35棵，橘子园共有多少棵橘子树?",
            "en_text": "There are 26 rows of orange trees in the orange orchard, with 35 trees in each row. How many orange trees are there in the orange orchard?",
            "equation": "35*26",
            "ans": "910.0"
        },
        {
            "id": 26,
            "uid": "da430220ef6311ea925f3413e8a4c977",
            "zh_text": "王师傅每天给学校送25桶水，每桶水大约重19千克.他每天送多少千克水?",
            "en_text": "Master Wang sends 25 buckets of water to the school every day, and each bucket weighs about 19 kilograms. How many kilograms of water does he send every day?",
            "equation": "19*25",
            "ans": "475.0"
        },
        {
            "id": 27,
            "uid": "da430221ef6311ea925f3413e8a4c977",
            "zh_text": "每套风光明信片有12张，1张售价14元，今天卖出56套风光明信片一共卖了多少元钱?",
            "en_text": "There are 12 sets of scenery postcards, and one is priced at 14 yuan. How much did the 56 sets of scenery postcards sold today?",
            "equation": "14*56",
            "ans": "784.0"
        },
        {
            "id": 28,
            "uid": "da430222ef6311ea925f3413e8a4c977",
            "zh_text": "世界杯足球赛有32个国家队进入，每个队有23名队员.世界杯一共有多少名运动员参加比赛?",
            "en_text": "There are 32 national teams entering the World Cup, and each team has 23 players. How many athletes will participate in the World Cup?",
            "equation": "23*32",
            "ans": "736.0"
        },
        {
            "id": 29,
            "uid": "da430223ef6311ea925f3413e8a4c977",
            "zh_text": "一辆大客准乘54位，公司有25辆可同时接待多少位游客?",
            "en_text": "A large passenger can take 54 passengers, and how many tourists can the company have 25 vehicles at the same time?",
            "equation": "54*25",
            "ans": "1350.0"
        },
        {
            "id": 30,
            "uid": "da430224ef6311ea925f3413e8a4c977",
            "zh_text": "一本童话6元，一本故事选3元.故事选比童话故事选便宜多少元?",
            "en_text": "A fairy tale is 6 yuan, and a story is 3 yuan. How much cheaper is the story selection than the fairy tale selection?",
            "equation": "6-3",
            "ans": "3.0"
        },
        {
            "id": 31,
            "uid": "da430225ef6311ea925f3413e8a4c977",
            "zh_text": "文化用品店卖一个卷笔刀8元、一枝铅笔6元、一枝橡皮12元.买一个卷笔刀和一枝铅笔共多少元?",
            "en_text": "The stationery store sells a pencil sharpener for 8 yuan, a pencil for 6 yuan, and an eraser for 12 yuan. How much does it cost to buy a pencil sharpener and a pencil?",
            "equation": "8+6+12",
            "ans": "26.0"
        },
        {
            "id": 32,
            "uid": "da430226ef6311ea925f3413e8a4c977",
            "zh_text": "学校进行团体操表演，每个方队有8行，每行有10人.3个方队一共有多少人?",
            "en_text": "The school performs group gymnastics performances. Each square team has 8 rows and each row has 10 people. How many people are there in 3 square teams?",
            "equation": "10*8*3",
            "ans": "240.0"
        },
        {
            "id": 33,
            "uid": "da430227ef6311ea925f3413e8a4c977",
            "zh_text": "养鸡场有8盒鸡蛋，每盒5行，每行6个.一共有多少个鸡蛋?",
            "en_text": "There are 8 boxes of eggs in the chicken farm, with 5 rows in each box and 6 in each row. How many eggs are there in total?",
            "equation": "6*5*8",
            "ans": "240.0"
        },
        {
            "id": 34,
            "uid": "da430228ef6311ea925f3413e8a4c977",
            "zh_text": "幼儿班共有60人参加团体操表演分成2个方队，每个方队有5个小圈.每个小圈有多少人?",
            "en_text": "In the kindergarten class, a total of 60 people participated in the group gymnastics performance and divided into 2 square teams, each of which had 5 small circles. How many people were in each small circle?",
            "equation": "60/2/5",
            "ans": "6.0"
        },
        {
            "id": 35,
            "uid": "da430229ef6311ea925f3413e8a4c977",
            "zh_text": "工厂生产960个杯子，6个装1盒，8盒可装8箱.所有杯子能装多少箱?",
            "en_text": "The factory produces 960 cups, 6 in 6 boxes, and 8 boxes in 8 boxes. How many boxes can all the cups be?",
            "equation": "960/(6*8)",
            "ans": "20.0"
        },
        {
            "id": 36,
            "uid": "da43022aef6311ea925f3413e8a4c977",
            "zh_text": "跑道每圈400米，小红坚持锻炼身体，每天跑两圈，她7天跑多少米?",
            "en_text": "Every lap of the track is 400 meters. Xiaohong insists on exercising. She runs two laps a day. How many meters does she run in 7 days?",
            "equation": "400*2*7",
            "ans": "5600.0"
        },
        {
            "id": 37,
            "uid": "da43022bef6311ea925f3413e8a4c977",
            "zh_text": "一张圆桌坐3人，一张方桌坐4人，有圆桌7张和方桌6张可同时共接待多少人?",
            "en_text": "A round table seats 3 people, a square table seats 4 people, and there are 7 round tables and 6 square tables. How many people can be accommodated at the same time?",
            "equation": "3*7+4*6",
            "ans": "45.0"
        },
        {
            "id": 38,
            "uid": "da43022cef6311ea925f3413e8a4c977",
            "zh_text": "装箱车装货，每次装2板，每板6箱，每箱24瓶.每次运到车上多少瓶?",
            "en_text": "The loading truck is loaded with 2 plates each time, 6 boxes per plate, 24 bottles per box. How many bottles are delivered to the car each time?",
            "equation": "6*2*24",
            "ans": "288.0"
        },
        {
            "id": 39,
            "uid": "da43022def6311ea925f3413e8a4c977",
            "zh_text": "小红装相册.每本有24页，每页可以放4张相片.两本相册可以放多少张照片?",
            "en_text": "Little Red Album. Each has 24 pages and each page can hold 4 photos. How many photos can be placed in two albums?",
            "equation": "24*4*2",
            "ans": "192.0"
        },
        {
            "id": 40,
            "uid": "da43022eef6311ea925f3413e8a4c977",
            "zh_text": "稿纸每页有20行，每行24格.一封信有2页大约共有多少格?",
            "en_text": "The manuscript paper has 20 lines per page and 24 lines per line. How many lines are there in a letter with 2 pages?",
            "equation": "20*24*2",
            "ans": "960.0"
        },
        {
            "id": 41,
            "uid": "da43022fef6311ea925f3413e8a4c977",
            "zh_text": "一个人每1月大约产生37千克垃圾.我家三个人12月要产生多少千克垃圾?",
            "en_text": "One person produces about 37 kilograms of garbage every January. How many kilograms of garbage do three people in my family produce in December?",
            "equation": "37*12*3",
            "ans": "1332.0"
        },
        {
            "id": 42,
            "uid": "da430230ef6311ea925f3413e8a4c977",
            "zh_text": "我住的这座楼有21层，1层有5个单元，每个单元每层住3户.这座楼一共有多少户?",
            "en_text": "The building I live in has 21 floors, with 5 units on the first floor, and each unit has 3 households on each floor. How many households are there in this building?",
            "equation": "3*5*21",
            "ans": "315.0"
        },
        {
            "id": 43,
            "uid": "da430231ef6311ea925f3413e8a4c977",
            "zh_text": "两辆货车4次能运9600千克货物，平均每辆货车每次运多少千克?",
            "en_text": "Two trucks can transport 9,600 kilograms of goods 4 times. How many kilograms each truck can transport on average?",
            "equation": "9600/4/2",
            "ans": "1200.0"
        },
        {
            "id": 44,
            "uid": "da430232ef6311ea925f3413e8a4c977",
            "zh_text": "啄木鸟每天能吃645只害虫，青蛙8天才吃608只害虫.啄木鸟比青蛙每天多吃多少只害虫?",
            "en_text": "Woodpeckers can eat 645 pests a day, and frogs eat 608 pests in 8 days. How many more pests do woodpeckers eat per day than frogs?",
            "equation": "645-608/8",
            "ans": "569.0"
        },
        {
            "id": 45,
            "uid": "da430233ef6311ea925f3413e8a4c977",
            "zh_text": "有3个书架，每个书架有6层，书架上共有126本书.平均每层放多少本?",
            "en_text": "There are 3 bookshelves, each with 6 floors, and there are a total of 126 books on the bookshelves. How many books are on each floor?",
            "equation": "126/(6*3)",
            "ans": "7.0"
        },
        {
            "id": 46,
            "uid": "da430234ef6311ea925f3413e8a4c977",
            "zh_text": "儿童剧场每天放映3场电影.昨天和今天2天共售出954张票.平均每场售出多少张票?",
            "en_text": "The children's theater shows 3 movies every day. A total of 954 tickets were sold yesterday and today. How many tickets were sold per show on average?",
            "equation": "954/2/3",
            "ans": "159.0"
        },
        {
            "id": 47,
            "uid": "da4327f8ef6311ea92683413e8a4c977",
            "zh_text": "我们7人租两条船.玩1条船7元，每人要花多少元钱?",
            "en_text": "We rented two boats for 7 people. How much does it cost to play a boat for 7 yuan?",
            "equation": "7*2*7/7",
            "ans": "14.0"
        },
        {
            "id": 48,
            "uid": "da4327f9ef6311ea92683413e8a4c977",
            "zh_text": "动物园6只大猩猩7天吃了168千克水果.每只大猩猩每天吃多少千克水果?",
            "en_text": "The 6 gorillas in the zoo ate 168 kilograms of fruit in 7 days. How many kilograms of fruit does each gorilla eat per day?",
            "equation": "168/7/6",
            "ans": "4.0"
        },
        {
            "id": 49,
            "uid": "da4327faef6311ea92683413e8a4c977",
            "zh_text": "一个地球仪85元，一个书包48元，买一个地球仪和一个书包一共要多少元钱?",
            "en_text": "A globe is 85 yuan, and a schoolbag is 48 yuan. How much does it cost to buy a globe and a schoolbag?",
            "equation": "85+48",
            "ans": "133.0"
        },
        {
            "id": 50,
            "uid": "da4327fbef6311ea92683413e8a4c977",
            "zh_text": "有根4米长的木料，木料被锯成同样长的四根，用每根做凳腿则这个凳子的高大约是多少米?",
            "en_text": "There is a 4-meter-long piece of wood. The wood is sawed into four pieces of the same length. Using each piece as a stool leg, how much is the height of the stool?",
            "equation": "4/4",
            "ans": "1.0"
        },
        {
            "id": 51,
            "uid": "da4327fcef6311ea92683413e8a4c977",
            "zh_text": "有公鸡59只，母鸡77只，小鸡85只，公鸡和母鸡一共有多少只?",
            "en_text": "There are 59 roosters, 77 hens, and 85 chicks. How many roosters and hens are there?",
            "equation": "59+77",
            "ans": "136.0"
        },
        {
            "id": 52,
            "uid": "da4327fdef6311ea92683413e8a4c977",
            "zh_text": "京广中心大厦高209米，京广中心大厦比中央电视塔约矮196米，中央电视塔有多少米?",
            "en_text": "The Jingguang Center Building is 209 meters high. The Jingguang Center Building is about 196 meters shorter than the CCTV Tower. How many meters is the CCTV Tower?",
            "equation": "209+196",
            "ans": "405.0"
        },
        {
            "id": 53,
            "uid": "da4327feef6311ea92683413e8a4c977",
            "zh_text": "从昆明到丽江有517千米，我们已经走了348千米，到丽江还有多少千米?",
            "en_text": "It is 517 kilometers from Kunming to Lijiang, we have walked 348 kilometers, how many kilometers are there to Lijiang?",
            "equation": "517-348",
            "ans": "169.0"
        },
        {
            "id": 54,
            "uid": "da4327ffef6311ea92683413e8a4c977",
            "zh_text": "有29个电扇叶子，每台电扇装3个.这些电扇叶子够装多少台?",
            "en_text": "There are 29 fan leaves, 3 for every 3 fans. How many fan leaves are enough?",
            "equation": "29/3/3*3",
            "ans": "9.666666666666666"
        },
        {
            "id": 55,
            "uid": "da432800ef6311ea92683413e8a4c977",
            "zh_text": "有32人跳绳，6人六组.跳绳可以分成多少组?",
            "en_text": "There are 32 people skipping rope, 6 people in six groups. How many groups can the skipping rope be divided into?",
            "equation": "32/6",
            "ans": "5.333333333333333"
        },
        {
            "id": 56,
            "uid": "da432801ef6311ea92683413e8a4c977",
            "zh_text": "儿童读物4本4元，23元最多可以买多少本儿童读物?",
            "en_text": "4 children's books for 4 yuan, how many children's books can I buy at 23 yuan?",
            "equation": "23/(4/4)",
            "ans": "23.0"
        },
        {
            "id": 57,
            "uid": "da432802ef6311ea92683413e8a4c977",
            "zh_text": "矿泉水3瓶3元，有20元最多可以买多少瓶?",
            "en_text": "3 bottles of mineral water are 3 yuan, how many bottles can I buy at 20 yuan?",
            "equation": "20/(3/3)",
            "ans": "20.0"
        },
        {
            "id": 58,
            "uid": "da432803ef6311ea92683413e8a4c977",
            "zh_text": "每4张空桌可以做4只小动物，中午来了35只小动物需要多少张桌子?",
            "en_text": "Every 4 empty tables can make 4 small animals. How many tables do 35 small animals need at noon?",
            "equation": "35/(4/4)",
            "ans": "35.0"
        },
        {
            "id": 59,
            "uid": "da432804ef6311ea92683413e8a4c977",
            "zh_text": "有20只小动物到森林城堡住宿，每6间房屋住6只，小动物一共可以住满多少间房?",
            "en_text": "There are 20 small animals living in the forest castle, 6 in every 6 houses, how many rooms can the small animals live in?",
            "equation": "20/6*6",
            "ans": "20.0"
        },
        {
            "id": 60,
            "uid": "da432805ef6311ea92683413e8a4c977",
            "zh_text": "坐旋转木马每1人2元，9人要多少元钱?",
            "en_text": "The carousel ride is 2 yuan per person, how much does it cost for 9 people?",
            "equation": "2*9",
            "ans": "18.0"
        },
        {
            "id": 61,
            "uid": "da432806ef6311ea92683413e8a4c977",
            "zh_text": "坐碰碰车每1人3元，20人要多少元钱?",
            "en_text": "A bumper car ride is 3 yuan per person, how much does it cost for 20 people?",
            "equation": "3*20",
            "ans": "60.0"
        },
        {
            "id": 62,
            "uid": "da432807ef6311ea92683413e8a4c977",
            "zh_text": "每1个同学门票8元，29个同学参观需要带多少元钱?",
            "en_text": "Tickets are 8 yuan per student. How much does it cost to bring 29 students to visit?",
            "equation": "8*29",
            "ans": "232.0"
        },
        {
            "id": 63,
            "uid": "da432808ef6311ea92683413e8a4c977",
            "zh_text": "每1瓶矿泉水2元，买20瓶需要多少元钱?",
            "en_text": "Every bottle of mineral water is 2 yuan, how much does it cost to buy 20 bottles?",
            "equation": "20",
            "ans": "20.0"
        },
        {
            "id": 64,
            "uid": "da432809ef6311ea92683413e8a4c977",
            "zh_text": "每1箱苹果30千克，8箱有多少千克?",
            "en_text": "Each box of apples is 30 kilograms, how many kilograms are there in 8 boxes?",
            "equation": "30*8",
            "ans": "240.0"
        },
        {
            "id": 65,
            "uid": "da43280aef6311ea92683413e8a4c977",
            "zh_text": "一盒胶卷能照36张相片，3盒胶卷大约能照多少张相片?",
            "en_text": "One box of film can take 36 photos, and 3 boxes of film can take approximately how many photos?",
            "equation": "36*3",
            "ans": "108.0"
        },
        {
            "id": 66,
            "uid": "da43280bef6311ea92683413e8a4c977",
            "zh_text": "湖边种着4排柳树，每排有62棵.一共约有多少棵柳树?",
            "en_text": "There are 4 rows of willow trees planted by the lake, each row has 62. How many willow trees are there in total?",
            "equation": "4*62",
            "ans": "248.0"
        },
        {
            "id": 67,
            "uid": "da43280cef6311ea92683413e8a4c977",
            "zh_text": "一篇文章400个字，小丁叔叔平均每1分钟打1个字，这一篇文章需要多少分钟能打完?",
            "en_text": "An article has 400 words, and Uncle Xiaoding typed 1 word every 1 minute on average. How many minutes does it take to type this article?",
            "equation": "400/1",
            "ans": "400.0"
        },
        {
            "id": 68,
            "uid": "da43280def6311ea92683413e8a4c977",
            "zh_text": "儿童车每1辆的价钱是90元.幼儿园买了4辆一共用了多少元钱?",
            "en_text": "The price of each child car is 90 yuan. How much does the kindergarten buy 4 cars for sharing?",
            "equation": "90*4",
            "ans": "360.0"
        },
        {
            "id": 69,
            "uid": "da43280eef6311ea92683413e8a4c977",
            "zh_text": "动物园有一只东北虎重213千克.一头野牛的体重是东北虎的3倍.这头野牛大约有多少千克?",
            "en_text": "There is a Siberian tiger in the zoo that weighs 213 kilograms. A bison weighs three times that of the Siberian tiger. How many kilograms does this bison weigh?",
            "equation": "213*3",
            "ans": "639.0"
        },
        {
            "id": 70,
            "uid": "da43280fef6311ea92683413e8a4c977",
            "zh_text": "公园道路上放花每一边放342个盆，2边一共放多少个盆?",
            "en_text": "There are 342 pots on each side of the park road. How many pots are there on 2 sides?",
            "equation": "342*2",
            "ans": "684.0"
        },
        {
            "id": 71,
            "uid": "da432810ef6311ea92683413e8a4c977",
            "zh_text": "一栋楼房共有6个单元，每1个单元住18户.这1栋楼房共住多少户人家?",
            "en_text": "There are 6 units in a building, and each unit has 18 households. How many households are in this building?",
            "equation": "18*6",
            "ans": "108.0"
        },
        {
            "id": 72,
            "uid": "da432811ef6311ea92683413e8a4c977",
            "zh_text": "每1箱饮料有24瓶，9箱一共多少瓶?",
            "en_text": "There are 24 bottles per box of drinks, how many bottles are there in 9 boxes?",
            "equation": "24*9",
            "ans": "216.0"
        },
        {
            "id": 73,
            "uid": "da432812ef6311ea92683413e8a4c977",
            "zh_text": "运动场的看台分为8区，每区有634个座位，运动场最多可以坐多少个人?",
            "en_text": "The stands of the stadium are divided into 8 zones, each with 634 seats, how many people can sit in the stadium at most?",
            "equation": "634*8",
            "ans": "5072.0"
        },
        {
            "id": 74,
            "uid": "da432813ef6311ea92683413e8a4c977",
            "zh_text": "电影院每天放映4场电影.每场最多卖278张票.每天最多可以卖多少张电影票?",
            "en_text": "The cinema shows 4 movies every day. Each show sells a maximum of 278 tickets. How many movie tickets can be sold per day?",
            "equation": "278*4",
            "ans": "1112.0"
        },
        {
            "id": 75,
            "uid": "da432814ef6311ea92683413e8a4c977",
            "zh_text": "亚运会入场仪式上群众分为4个方阵，每个方阵128人，亚运会一共有多少人?",
            "en_text": "At the admission ceremony of the Asian Games, the crowd was divided into 4 phalanxes, each with 128 people. How many people were there in the Asian Games?",
            "equation": "128*4",
            "ans": "512.0"
        },
        {
            "id": 76,
            "uid": "da432815ef6311ea92683413e8a4c977",
            "zh_text": "5厘米长的蚱蜢，跳跃的距离是蚱蜢的身长的75倍，蚱蜢跳跃的距离是多少厘米?",
            "en_text": "A grasshopper with a length of 5 cm, the jumping distance is 75 times the length of the grasshopper, how many centimeters does the grasshopper jump?",
            "equation": "5*75",
            "ans": "375.0"
        },
        {
            "id": 77,
            "uid": "da432816ef6311ea92683413e8a4c977",
            "zh_text": "每个同学发5本练习本，年级1班有52个同学，1班共要发多少本练习本?",
            "en_text": "Each student distributes 5 exercise books, and there are 52 students in class 1. How many exercise books should I distribute in class 1?",
            "equation": "5*52",
            "ans": "260.0"
        },
        {
            "id": 78,
            "uid": "da432817ef6311ea92683413e8a4c977",
            "zh_text": "小红平均每1分钟骑185米，她每天上学要骑7分钟.小红从家和学校每天要走多少米?",
            "en_text": "Xiaohong rides an average of 185 meters every 1 minute, and she rides 7 minutes every day to go to school. How many meters does Xiaohong walk from home and school every day?",
            "equation": "185*7",
            "ans": "1295.0"
        },
        {
            "id": 79,
            "uid": "da432818ef6311ea92683413e8a4c977",
            "zh_text": "1列火车有9节车厢，每节车厢有118个座位，这1列火车共有多少个座位?",
            "en_text": "A train has 9 carriages and each carriage has 118 seats. How many seats are there in this train?",
            "equation": "118*9",
            "ans": "1062.0"
        },
        {
            "id": 80,
            "uid": "da432819ef6311ea92683413e8a4c977",
            "zh_text": "老寿星每天要绕荷花池步行3圈，每圈508米.老寿星每天步行多少米?",
            "en_text": "Lao Shou Xing walks around the lotus pond 3 times a day, 508 meters each. How many meters does Lao Shou Xing walk every day?",
            "equation": "508*3",
            "ans": "1524.0"
        },
        {
            "id": 81,
            "uid": "da43281aef6311ea92683413e8a4c977",
            "zh_text": "去年我们学校共义务植树205棵，今年种的是去年的2倍.今年义务植树多少棵?",
            "en_text": "Last year, our school voluntarily planted 205 trees. This year we planted twice as many trees as last year.",
            "equation": "205*2",
            "ans": "410.0"
        },
        {
            "id": 82,
            "uid": "da434ef0ef6311ea92723413e8a4c977",
            "zh_text": "一头大象的体重等于8头牛的体重.一头牛重605千克，这头大象的体重是多少千克?",
            "en_text": "The weight of an elephant is equal to the weight of 8 cows. A cow weighs 605 kilograms, how many kilograms does this elephant weigh?",
            "equation": "605*8",
            "ans": "4840.0"
        },
        {
            "id": 83,
            "uid": "da434ef1ef6311ea92723413e8a4c977",
            "zh_text": "学校图书室买了3套丛书，每套280元.丛书共需要多少元?",
            "en_text": "The school library bought 3 sets of books, each set is 280 yuan. How much does the series cost?",
            "equation": "280*3",
            "ans": "840.0"
        },
        {
            "id": 84,
            "uid": "da434ef2ef6311ea92723413e8a4c977",
            "zh_text": "一条蚕大约吐丝1500米，小红养了6条蚕大约吐丝多少米?",
            "en_text": "One silkworm spins about 1500 meters, and Xiaohong raises 6 silkworms about how many meters?",
            "equation": "1500*6",
            "ans": "9000.0"
        },
        {
            "id": 85,
            "uid": "da434ef3ef6311ea92723413e8a4c977",
            "zh_text": "学校买4台电风扇，每台140元，电风扇一共要用多少元?",
            "en_text": "The school buys 4 electric fans at 140 yuan each. How much does the electric fan cost in total?",
            "equation": "140*4",
            "ans": "560.0"
        },
        {
            "id": 86,
            "uid": "da434ef4ef6311ea92723413e8a4c977",
            "zh_text": "王叔叔平均1小时能检测230个物件，他工作8小时共能检测多少个物件?",
            "en_text": "On average, Uncle Wang can detect 230 objects in an hour. How many objects can he detect in 8 hours?",
            "equation": "230*8",
            "ans": "1840.0"
        },
        {
            "id": 87,
            "uid": "da434ef5ef6311ea92723413e8a4c977",
            "zh_text": "小军每1分钟大约走65米，他从家到学校大约要走8分钟他家距学校大约有多少米?",
            "en_text": "Xiaojun walks about 65 meters every 1 minute. It takes about 8 minutes to walk from home to school. How many meters is his home from school?",
            "equation": "65*8",
            "ans": "520.0"
        },
        {
            "id": 88,
            "uid": "da434ef6ef6311ea92723413e8a4c977",
            "zh_text": "每套课桌椅坐2人，学校新买来200套课桌椅一共可以坐多少人?",
            "en_text": "Each set of desks and chairs sits for 2 people. How many people can sit in the 200 sets of desks and chairs newly purchased by the school?",
            "equation": "200*2",
            "ans": "400.0"
        },
        {
            "id": 89,
            "uid": "da434ef7ef6311ea92723413e8a4c977",
            "zh_text": "阳光小学每个年级都是136人，全校6个年级共有多少人?",
            "en_text": "There are 136 students in each grade of Sunshine Primary School. How many people are there in the 6 grades of the school?",
            "equation": "136*6",
            "ans": "816.0"
        },
        {
            "id": 90,
            "uid": "da434ef8ef6311ea92723413e8a4c977",
            "zh_text": "一只野兔每小时跑41千米，一只雨燕的飞行速度是一只野兔奔跑速度的4倍.这一只雨燕每小时大约飞行多少千米?",
            "en_text": "A hare runs 41 kilometers per hour, and a Swift can fly at four times the speed of a hare. How many kilometers per hour does this Swift fly?",
            "equation": "41*4",
            "ans": "164.0"
        },
        {
            "id": 91,
            "uid": "da434ef9ef6311ea92723413e8a4c977",
            "zh_text": "每8件衣服钉5个，妈妈买了38个纽扣可以钉多少件?",
            "en_text": "There are 5 nails for every 8 pieces of clothes. How many buttons can be nailed when my mother buys 38?",
            "equation": "8*38",
            "ans": "304.0"
        },
        {
            "id": 92,
            "uid": "da434efaef6311ea92723413e8a4c977",
            "zh_text": "剧场的票价是每人8元，剧场能坐870人这场的票房收入是多少元?",
            "en_text": "The ticket price of the theater is 8 yuan per person. How much is the box office income of the theater that can seat 870 people?",
            "equation": "8*870",
            "ans": "6960.0"
        },
        {
            "id": 93,
            "uid": "da434efbef6311ea92723413e8a4c977",
            "zh_text": "一共有57棵树苗，每8行种8棵.树苗可以种多少行?",
            "en_text": "There are a total of 57 saplings, 8 for every 8 rows. How many rows can saplings be planted?",
            "equation": "57/8",
            "ans": "7.125"
        },
        {
            "id": 94,
            "uid": "da434efcef6311ea92723413e8a4c977",
            "zh_text": "年级共17人分学习小组，如果每3组3人，年级可以分成多少组?",
            "en_text": "A total of 17 students in the grade are divided into study groups. If there are 3 groups of 3 students, how many groups can the grade be divided into?",
            "equation": "17/3",
            "ans": "5.666666666666668"
        },
        {
            "id": 95,
            "uid": "da434efdef6311ea92723413e8a4c977",
            "zh_text": "饲养组养了68只小兔.如果每6个笼子里养6只，所有小兔需要多少个笼子?",
            "en_text": "The breeding group has 68 small rabbits. If there are 6 rabbits in every 6 cages, how many cages do all the rabbits need?",
            "equation": "68/6",
            "ans": "11.333333333333336"
        },
        {
            "id": 96,
            "uid": "da434efeef6311ea92723413e8a4c977",
            "zh_text": "班级有48人分成4组，2人1张课桌.平均每组有多少人?",
            "en_text": "There are 48 students in the class divided into 4 groups, 2 people and 1 desk. How many people are there on average in each group?",
            "equation": "48/4",
            "ans": "12.0"
        },
        {
            "id": 97,
            "uid": "da434effef6311ea92723413e8a4c977",
            "zh_text": "老师带着62个学生去郊游.每6顶帐篷最多只能住6个.所有学生至少要搭多少顶帐篷?",
            "en_text": "The teacher took 62 students on an outing. Every 6 tents can only live in a maximum of 6. How many tents should all students set up at least?",
            "equation": "62/6",
            "ans": "10.333333333333334"
        },
        {
            "id": 98,
            "uid": "da434f00ef6311ea92723413e8a4c977",
            "zh_text": "小芳买了5本练习本，小军买了3本练习本，小芳比小军多付了8元钱.每本练习本多少元钱?",
            "en_text": "Xiaofang bought 5 exercise books, Xiaojun bought 3 exercise books, Xiaofang paid 8 yuan more than Xiaojun. How much is each exercise book?",
            "equation": "8/(5-3)",
            "ans": "4.0"
        },
        {
            "id": 99,
            "uid": "da434f01ef6311ea92723413e8a4c977",
            "zh_text": "鸭有18只，鸡的只数是鸭的2倍.鸡和鸭共有多少只?",
            "en_text": "There are 18 ducks, and the number of chickens is twice that of ducks. How many chickens and ducks are there?",
            "equation": "18*2+18",
            "ans": "54.0"
        },
        {
            "id": 100,
            "uid": "da434f02ef6311ea92723413e8a4c977",
            "zh_text": "红红有42张邮票，明明比红红少15张.红红和明明共有多少张?",
            "en_text": "Red Red has 42 stamps, which is 15 fewer than Red Red. How many are Red Red and Mingming?",
            "equation": "42-15+42",
            "ans": "69.0"
        },
        {
            "id": 101,
            "uid": "da434f03ef6311ea92723413e8a4c977",
            "zh_text": "大汽车有45辆，小汽车比大汽车多17辆.大汽车和小汽车共有多少辆?",
            "en_text": "There are 45 big cars, and there are 17 more small cars than big cars. How many big cars and small cars are there?",
            "equation": "45+17+45",
            "ans": "107.0"
        },
        {
            "id": 102,
            "uid": "da434f04ef6311ea92723413e8a4c977",
            "zh_text": "小白兔拔了14棵白菜，小灰兔拔的是小白兔的3倍.小白兔和小灰兔一共拔了多少棵?",
            "en_text": "The little white rabbit pulled 14 cabbage, and the little gray rabbit pulled three times as much as the little white rabbit. How many white rabbits and little gray rabbits total?",
            "equation": "14*3+14",
            "ans": "56.0"
        },
        {
            "id": 103,
            "uid": "da434f05ef6311ea92723413e8a4c977",
            "zh_text": "小白兔拔了14棵白菜，小灰兔拔的是小白兔的3倍.小白兔比小灰兔少拔了多少棵?",
            "en_text": "The little white rabbit pulled 14 cabbage, and the little gray rabbit pulled three times as much as the little white rabbit. How many less white rabbits did the little white rabbit pull?",
            "equation": "14*3-14",
            "ans": "28.0"
        },
        {
            "id": 104,
            "uid": "da434f06ef6311ea92723413e8a4c977",
            "zh_text": "每瓶果汁6元，每盒有10瓶，买6盒果汁要多少元?",
            "en_text": "Each bottle of juice is 6 yuan, and there are 10 bottles in each box. How much does it cost to buy 6 boxes of juice?",
            "equation": "6*10*6",
            "ans": "360.0"
        },
        {
            "id": 105,
            "uid": "da434f07ef6311ea92723413e8a4c977",
            "zh_text": "一盒饼干有8袋，每袋18块，5盒饼干有多少块?",
            "en_text": "There are 8 bags of biscuits in a box, 18 pieces in each bag, how many biscuits in 5 boxes?",
            "equation": "18*8*5",
            "ans": "720.0"
        },
        {
            "id": 106,
            "uid": "da434f08ef6311ea92723413e8a4c977",
            "zh_text": "每4辆车用4个轮子.45个轮子最多可以装多少辆车?",
            "en_text": "4 wheels are used for every 4 cars. How many cars can be installed on 45 wheels?",
            "equation": "45/4*4",
            "ans": "45.0"
        },
        {
            "id": 107,
            "uid": "da434f09ef6311ea92723413e8a4c977",
            "zh_text": "百合花约有40个品种，杜鹃花大约是百合花品种的17倍.杜鹃花大约有多少个品种?",
            "en_text": "There are about 40 varieties of lilies, and the number of azaleas is about 17 times that of lilies. How many varieties are there?",
            "equation": "40*17",
            "ans": "680.0"
        },
        {
            "id": 108,
            "uid": "da434f0aef6311ea92723413e8a4c977",
            "zh_text": "一个计算器24元，李老师买4个计算器.他买计算器要花多少元钱?",
            "en_text": "A calculator is 24 yuan, and Teacher Li buys 4 calculators. How much does it cost to buy a calculator?",
            "equation": "24*4",
            "ans": "96.0"
        },
        {
            "id": 109,
            "uid": "da434f0bef6311ea92723413e8a4c977",
            "zh_text": "我国发射的第一颗人造地球卫星，绕地球一周要用114分钟.绕地球59周要用多少分钟?",
            "en_text": "The first man-made earth satellite launched by my country took 114 minutes to orbit the earth. How many minutes does it take to orbit the earth 59 times?",
            "equation": "114*59",
            "ans": "6726.0"
        },
        {
            "id": 110,
            "uid": "da434f0cef6311ea92723413e8a4c977",
            "zh_text": "某市郊外的森林公园有124公顷森林.1公顷森林可滞尘约32吨，可从地下吸出约85吨水.这个森林大约可滞尘多少吨?",
            "en_text": "A forest park on the outskirts of a city has 124 hectares of forest. 1 hectare of forest can trap about 32 tons of dust, and about 85 tons of water can be sucked from the ground. How many tons of dust can this forest hold?",
            "equation": "124*32",
            "ans": "3968.0"
        },
        {
            "id": 111,
            "uid": "da434f0def6311ea92723413e8a4c977",
            "zh_text": "我国发射的“神舟”号飞船绕地球一周约用90分钟.一共绕地球108周用了多少分钟?",
            "en_text": "The Shenzhou spacecraft launched by my country took about 90 minutes to orbit the earth. How many minutes did it take to orbit the earth in total?",
            "equation": "90*108",
            "ans": "9720.0"
        },
        {
            "id": 112,
            "uid": "da434f0eef6311ea92723413e8a4c977",
            "zh_text": "公园的有头大象350天要吃350千克食物，饲养员准备了5000千克食物够大象吃多少天?",
            "en_text": "An elephant in the park needs to eat 350 kilograms of food for 350 days. How many days does the breeder prepare 5000 kilograms of food?",
            "equation": "5000/(350/350)",
            "ans": "5000.0"
        },
        {
            "id": 113,
            "uid": "da434f0fef6311ea92723413e8a4c977",
            "zh_text": "刘宁走一步的平均长度是1米，她从操场这头走到那头共走了252步，操场大约长多少米?",
            "en_text": "The average length of Liu Ning's step is 1 meter. She walked a total of 252 steps from one end of the playground to the other.",
            "equation": "1*252",
            "ans": "252.0"
        },
        {
            "id": 114,
            "uid": "da434f10ef6311ea92723413e8a4c977",
            "zh_text": "沙坪小学1所学校有学生612名，全乡有这样的小学19所约有多少名学生?",
            "en_text": "There are 612 students in 1 school in Shaping Primary School. How many students are there in 19 such primary schools in the township?",
            "equation": "612*19",
            "ans": "11628.0"
        },
        {
            "id": 115,
            "uid": "da434f11ef6311ea92723413e8a4c977",
            "zh_text": "燕鸥从北极飞到南极，如果它每天飞780千米，20天能飞多少千米?",
            "en_text": "The tern flies from the North Pole to the South Pole. If it flies 780 kilometers a day, how many kilometers can it fly in 20 days?",
            "equation": "780*20",
            "ans": "15600.0"
        },
        {
            "id": 116,
            "uid": "da4375e2ef6311ea927c3413e8a4c977",
            "zh_text": "有家粮店3天售出大米的数量分别是430千克380千克407千克，这个粮店30天大约售出大米多少千克?",
            "en_text": "A grain store sold 430 kilograms, 380 kilograms, and 407 kilograms in three days. How many kilograms of rice did this grain store sell in 30 days?",
            "equation": "(430+380+407)/3*30",
            "ans": "12170.0"
        },
        {
            "id": 117,
            "uid": "da4375e3ef6311ea927c3413e8a4c977",
            "zh_text": "每30包书30本.一共要寄240本书要捆多少包?",
            "en_text": "There are 30 books per 30 packs. How many packs do I need to send a total of 240 books?",
            "equation": "240/30*30",
            "ans": "240.0"
        },
        {
            "id": 118,
            "uid": "da4375e4ef6311ea927c3413e8a4c977",
            "zh_text": "有艘小船40次只能坐40人，咱们一共160人运多少次才能运完?",
            "en_text": "There is a small boat that can only take 40 people for 40 times. How many times can we transport a total of 160 people to transport it?",
            "equation": "160/(40/40)",
            "ans": "160.0"
        },
        {
            "id": 119,
            "uid": "da4375e5ef6311ea927c3413e8a4c977",
            "zh_text": "1本书共有120个小故事，我每天看1个小故事.看完这1本书大约需要多少天?",
            "en_text": "There are 120 short stories in one book, and I read one short story every day. How many days does it take to read this book?",
            "equation": "120/30",
            "ans": "4.0"
        },
        {
            "id": 120,
            "uid": "da4375e6ef6311ea927c3413e8a4c977",
            "zh_text": "一个足球1元，用75元可以买多少个小足球?",
            "en_text": "A football is 1 yuan, how many small footballs can I buy with 75 yuan?",
            "equation": "75/1",
            "ans": "75.0"
        },
        {
            "id": 121,
            "uid": "da4375e7ef6311ea927c3413e8a4c977",
            "zh_text": "一袋饲料重100千克，这些猪每天要吃1千克饲料.一袋饲料够喂多少天?",
            "en_text": "A bag of feed weighs 100 kg, and these pigs need to eat 1 kg of feed every day. How many days is one bag of feed sufficient?",
            "equation": "100/1",
            "ans": "100.0"
        },
        {
            "id": 122,
            "uid": "da4375e8ef6311ea927c3413e8a4c977",
            "zh_text": "一节火车车厢限载1吨，有500吨货物需要多少节火车车厢才能装完?",
            "en_text": "A train carriage is limited to 1 ton. How many train carriages are needed for 500 tons of cargo?",
            "equation": "500/1",
            "ans": "500.0"
        },
        {
            "id": 123,
            "uid": "da4375e9ef6311ea927c3413e8a4c977",
            "zh_text": "春芽鸡场收160千克鸡蛋，18千克装18箱.鸡蛋可以装多少箱?",
            "en_text": "Chun Ya Chicken Farm accepts 160 kilograms of eggs, 18 kilograms in 18 boxes. How many boxes of eggs can be packed?",
            "equation": "160/18/18",
            "ans": "0.4938271604938272"
        },
        {
            "id": 124,
            "uid": "da4375eaef6311ea927c3413e8a4c977",
            "zh_text": "每行种1棵，一共有200棵树苗共可以种多少行?",
            "en_text": "Planting 1 tree per row, how many rows can there be a total of 200 saplings?",
            "equation": "200/1",
            "ans": "200.0"
        },
        {
            "id": 125,
            "uid": "da4375ebef6311ea927c3413e8a4c977",
            "zh_text": "每块展板放1件，学校展示了336件昆虫标本可以放满多少块展板?",
            "en_text": "There is one display for each display board. How many display boards can be filled with 336 insect specimens?",
            "equation": "336/1",
            "ans": "336.0"
        },
        {
            "id": 126,
            "uid": "da4375ecef6311ea927c3413e8a4c977",
            "zh_text": "每件特快专递要花1元，我寄特快专递用了132元共寄了多少件特快专递?",
            "en_text": "Each express mail item costs 1 yuan. How many express mail items did I send for 132 yuan?",
            "equation": "132/1",
            "ans": "132.0"
        },
        {
            "id": 127,
            "uid": "da4375edef6311ea927c3413e8a4c977",
            "zh_text": "有瓶药共100粒，我一天要吃1粒，药够吃多少天?",
            "en_text": "There are a total of 100 pills in a bottle. I have to take 1 pill a day. How long is the medicine enough?",
            "equation": "100/1",
            "ans": "100.0"
        },
        {
            "id": 128,
            "uid": "da4375eeef6311ea927c3413e8a4c977",
            "zh_text": "今年在我国一个湖区越冬的有16只白鹅，176只白天鹅.白天鹅的只数是白鹅的多少倍?",
            "en_text": "This year, 16 white geese and 176 white swans have been overwintering in a lake area in our country this year. How many times the number of white swans are there?",
            "equation": "176/16",
            "ans": "11.0"
        },
        {
            "id": 129,
            "uid": "da4375efef6311ea927c3413e8a4c977",
            "zh_text": "咱们学校栽了684棵杨树，还栽了76棵柳树.栽的杨树是柳树的多少倍?",
            "en_text": "Our school has planted 684 poplar trees and 76 willow trees. How many times are the poplar trees planted?",
            "equation": "684/76",
            "ans": "9.0"
        },
        {
            "id": 130,
            "uid": "da4375f0ef6311ea927c3413e8a4c977",
            "zh_text": "育英小学的180名少先队员在“爱心日”帮助军属做好事.这些少先队员平均分成5队，每队分成4组活动.平均每组有多少名少先队员?",
            "en_text": "The 180 young pioneers of Yuying Primary School helped the military members do good on Love Day. These young pioneers are divided into 5 teams and each team is divided into 4 groups of activities. On average, how many young pioneers are in each group?",
            "equation": "180/5/4",
            "ans": "9.0"
        },
        {
            "id": 131,
            "uid": "da4375f1ef6311ea927c3413e8a4c977",
            "zh_text": "5箱蜜蜂可以酿375千克蜂蜜.小林家养了这样的蜜蜂12箱可以酿多少千克蜂蜜?",
            "en_text": "5 boxes of bees can make 375 kilograms of honey. How many kilograms of honey can be made by 12 boxes of such bees?",
            "equation": "375/5*12",
            "ans": "900.0"
        },
        {
            "id": 132,
            "uid": "da4375f2ef6311ea927c3413e8a4c977",
            "zh_text": "足球29元，篮球44元，排球32元，羽毛球拍16元，刘老师带了280元钱都买足球最多能买多少?",
            "en_text": "Football is 29 yuan, basketball is 44 yuan, volleyball is 32 yuan, badminton racket is 16 yuan, and Mr. Liu brings 280 yuan to buy football. How much can I buy?",
            "equation": "280/29",
            "ans": "9.655172413793103"
        },
        {
            "id": 133,
            "uid": "da4375f3ef6311ea927c3413e8a4c977",
            "zh_text": "张爷爷买3只小羊用了75元.他还想再买5只这样的小羊需要准备多少元钱?",
            "en_text": "Grandpa Zhang bought 3 lambs for 75 yuan. How much does he want to buy 5 more such lambs?",
            "equation": "75/3*5",
            "ans": "125.0"
        },
        {
            "id": 134,
            "uid": "da4375f4ef6311ea927c3413e8a4c977",
            "zh_text": "小林家的果园今年收了310千克梨，收的苹果是梨的19倍.大约收了多少千克苹果?",
            "en_text": "Kobayashi's orchard harvested 310 kilograms of pears this year, which is 19 times that of pears. About how many kilograms of apples were harvested?",
            "equation": "310*19",
            "ans": "5890.0"
        },
        {
            "id": 135,
            "uid": "da4375f5ef6311ea927c3413e8a4c977",
            "zh_text": "有辆长途客车3小时行了174千米.照这样的速度，它12小时可以行多少千米?",
            "en_text": "A long-distance bus traveled 174 kilometers in 3 hours. At this speed, how many kilometers can it travel in 12 hours?",
            "equation": "174/3*12",
            "ans": "696.0"
        },
        {
            "id": 136,
            "uid": "da4375f6ef6311ea927c3413e8a4c977",
            "zh_text": "25的40倍是多少?",
            "en_text": "What is 40 times 25?",
            "equation": "25*40",
            "ans": "1000.0"
        },
        {
            "id": 137,
            "uid": "da4375f7ef6311ea927c3413e8a4c977",
            "zh_text": "884是34的多少倍?",
            "en_text": "How many times 884 is 34?",
            "equation": "884/34",
            "ans": "26.0"
        },
        {
            "id": 138,
            "uid": "da4375f8ef6311ea927c3413e8a4c977",
            "zh_text": "有只山雀5天大约能吃800只害虫，照这样计算，这只山雀30天大约能吃多少只害虫?",
            "en_text": "A tit can eat about 800 pests in 5 days. Based on this calculation, how many pests can this tit eat in 30 days?",
            "equation": "800/5*30",
            "ans": "4800.0"
        },
        {
            "id": 139,
            "uid": "da4375f9ef6311ea927c3413e8a4c977",
            "zh_text": "“冰雪天地”3天接待987人.照这样计算，6天预计接待多少人?",
            "en_text": "Ice and Snow World receives 987 people in 3 days. According to this calculation, how many people are expected to receive in 6 days?",
            "equation": "987/3*6",
            "ans": "1974.0"
        },
        {
            "id": 140,
            "uid": "da4375faef6311ea927c3413e8a4c977",
            "zh_text": "有箱橙汁12瓶共48元.芳芳要买3瓶需要付多少元钱?",
            "en_text": "There are 12 bottles of orange juice in a box for 48 yuan. How much does Fangfang need to pay for 3 bottles?",
            "equation": "48/12*3",
            "ans": "12.0"
        },
        {
            "id": 141,
            "uid": "da4375fbef6311ea927c3413e8a4c977",
            "zh_text": "一件上衣48元，一条长裤比上衣便宜9元，一条裙子又比长裤贵5元.这条裙子多少元钱?",
            "en_text": "A top is 48 yuan, a pair of trousers is 9 yuan cheaper than a top, and a skirt is 5 yuan more expensive than trousers. How much is this skirt?",
            "equation": "48-9+5",
            "ans": "44.0"
        },
        {
            "id": 142,
            "uid": "da4375fcef6311ea927c3413e8a4c977",
            "zh_text": "大同乡中心小学在荒山上植树，2002年共植树356棵，2003年植树3次，每次植树140棵.2003年比2002年多多少棵?",
            "en_text": "Datong Township Central Primary School planted trees on barren hills. In 2002, a total of 356 trees were planted. In 2003, trees were planted three times, 140 trees each time. How many more trees were planted in 2003 than in 2002?",
            "equation": "140*3-356",
            "ans": "64.0"
        },
        {
            "id": 143,
            "uid": "da4375fdef6311ea927c3413e8a4c977",
            "zh_text": "李伯伯家养了42只鸡，养鸭的只数是鸡的一半.李伯伯家养鸡和鸭一共多少只?",
            "en_text": "Uncle Li's family has 42 chickens, and the number of ducks raised is half of that of chickens. How many chickens and ducks are there in Uncle Li's family?",
            "equation": "42/2+42",
            "ans": "63.0"
        },
        {
            "id": 144,
            "uid": "da4375feef6311ea927c3413e8a4c977",
            "zh_text": "书架上有两层书，上层和下层共144本.如果从下层取出8本放到上层去后两层书的本数就相同，上层有多少本书?",
            "en_text": "There are two levels of books on the bookshelf, with a total of 144 books on the upper and lower levels. If 8 books are taken from the lower level and placed on the upper level, the number of books on the two levels will be the same. How many books are there on the upper level?",
            "equation": "(144-8*2)/2",
            "ans": "64.0"
        },
        {
            "id": 145,
            "uid": "da4375ffef6311ea927c3413e8a4c977",
            "zh_text": "上午冰雕区有游人180名，下午有270名.如果每30名游人需要一名保洁员，下午要比上午多派多少名保洁员?",
            "en_text": "There are 180 tourists in the ice sculpture area in the morning and 270 in the afternoon. If every 30 tourists need a cleaner, how many more cleaners should be sent in the afternoon than in the morning?",
            "equation": "270/30-180/30",
            "ans": "3.0"
        },
        {
            "id": 146,
            "uid": "da437600ef6311ea927c3413e8a4c977",
            "zh_text": "一件冬衣54元，一双手套6元.妈妈用100元先给玲玲买了一件冬衣和一副手套还剩多少元钱?",
            "en_text": "A winter coat is 54 yuan, and a pair of gloves is 6 yuan. Mom used 100 yuan to buy a winter coat and a pair of gloves for Lingling. How much is left?",
            "equation": "100-(54+6)",
            "ans": "40.0"
        },
        {
            "id": 147,
            "uid": "da437601ef6311ea927c3413e8a4c977",
            "zh_text": "动物园里的一头大象每天吃180千克食物，一只熊猫2天吃72千克食物.大象每天吃的食物是熊猫的几倍?",
            "en_text": "An elephant in the zoo eats 180 kilograms of food a day, and a panda eats 72 kilograms of food for two days. How many times does the elephant eat as much food as a panda?",
            "equation": "180/(72/2)",
            "ans": "5.0"
        },
        {
            "id": 148,
            "uid": "da439ce2ef6311ea92863413e8a4c977",
            "zh_text": "小林身高124厘米，小林是表妹身高的2倍，而舅舅身高是表妹的3倍.舅舅身高是多少厘米?",
            "en_text": "Kobayashi is 124 centimeters tall. Kobayashi is twice the height of his cousin, and his uncle is three times the height of his cousin. How many centimeters is his uncle's height?",
            "equation": "124/2*3",
            "ans": "186.0"
        },
        {
            "id": 149,
            "uid": "da439ce3ef6311ea92863413e8a4c977",
            "zh_text": "同学们植树.一共有25个小组，每个组里4人负责挖坑种树，2人负责抬水浇树.小组中负责挖坑种树的一共有多少人?",
            "en_text": "The classmates planted trees. There are 25 groups in total. In each group, 4 people are responsible for digging holes and planting trees, and 2 people are responsible for carrying water and watering trees. How many people are responsible for digging holes and planting trees in the group?",
            "equation": "(4+2)*25",
            "ans": "150.0"
        },
        {
            "id": 150,
            "uid": "da439ce4ef6311ea92863413e8a4c977",
            "zh_text": "一箱矿泉水24瓶，每瓶2元.买这些矿泉水一共要花多少元钱?",
            "en_text": "A box of 24 bottles of mineral water, 2 yuan per bottle. How much does it cost to buy these mineral water?",
            "equation": "2*24",
            "ans": "48.0"
        },
        {
            "id": 151,
            "uid": "da439ce5ef6311ea92863413e8a4c977",
            "zh_text": "学校新教学楼有4层，每层有7间教室，每间教室要配25套双人课桌椅.学校一共需要购进多少套课桌椅?",
            "en_text": "The school's new teaching building has 4 floors, each with 7 classrooms, and each classroom needs 25 sets of double desks and chairs. How many sets of desks and chairs does the school need to purchase?",
            "equation": "25*7*4",
            "ans": "700.0"
        },
        {
            "id": 152,
            "uid": "da439ce6ef6311ea92863413e8a4c977",
            "zh_text": "一套儿童故事书共5本，每本4元，小亮要买这套书需要多少元钱?",
            "en_text": "A set of children's story books totals 5, each is 4 yuan, how much does Xiao Liang need to buy this set of books?",
            "equation": "5*4",
            "ans": "20.0"
        },
        {
            "id": 153,
            "uid": "da439ce7ef6311ea92863413e8a4c977",
            "zh_text": "学校篮球队5名队员的身高分别是156厘米158厘米160厘米162厘米164厘米.这5名队员的平均身高是多少厘米?",
            "en_text": "The height of the 5 members of the school basketball team is 156 cm, 158 cm, 160 cm, 162 cm, 164 cm. What is the average height of the 5 members?",
            "equation": "(156+158+160+162+164)/5",
            "ans": "160.0"
        },
        {
            "id": 154,
            "uid": "da439ce8ef6311ea92863413e8a4c977",
            "zh_text": "一共有25个小组，每个小组种了5棵树苗.小组购买树苗花了1250元，每棵树苗多少元钱?",
            "en_text": "There are 25 groups in total, and each group planted 5 saplings. The group spent 1,250 yuan on the saplings. How much is each sapling?",
            "equation": "1250/(5*25)",
            "ans": "10.0"
        },
        {
            "id": 155,
            "uid": "da43a576ef6311ea92893413e8a4c977",
            "zh_text": "一本习字本能写420个毛笔字，小明用了21天把这本习字本写完，他平均每天写多少个毛笔字?",
            "en_text": "A calligraphy book can write 420 calligraphy characters instinctively. It took Xiao Ming 21 days to finish this calligraphy book. How many calligraphy characters does he write on average every day?",
            "equation": "420/21",
            "ans": "20.0"
        },
        {
            "id": 156,
            "uid": "da43a577ef6311ea92893413e8a4c977",
            "zh_text": "王老师买了5副羽毛球拍花了330元.还买了25筒羽毛球，每筒32元，每筒羽毛球12个，王老师一共买了多少个羽毛球?",
            "en_text": "Teacher Wang bought 5 sets of badminton rackets for 330 yuan. He also bought 25 tubes of badminton at 32 yuan per tube and 12 badminton balls per tube. How many badminton shuttlecocks did Mr. Wang buy in total?",
            "equation": "330+25*32",
            "ans": "1130.0"
        },
        {
            "id": 157,
            "uid": "da43a578ef6311ea92893413e8a4c977",
            "zh_text": "每本相册都是32页，每页可以插6张照片，我家大约有5本相册可以插多少张照片?",
            "en_text": "Each album is 32 pages, and each page can insert 6 photos. How many photos can be inserted in about 5 albums in my family?",
            "equation": "32*6*5",
            "ans": "960.0"
        },
        {
            "id": 158,
            "uid": "da43a579ef6311ea92893413e8a4c977",
            "zh_text": "希望小学共收到捐赠图书350册.希望小学共有14个班，平均每个班可以分到多少册?",
            "en_text": "Hope Primary School received a total of 350 donated books. Hope Primary School has 14 classes. How many books can each class be allocated on average?",
            "equation": "350/14",
            "ans": "25.0"
        },
        {
            "id": 159,
            "uid": "da43a57aef6311ea92893413e8a4c977",
            "zh_text": "一盒牛奶2元，一袋豆浆1元.玲玲家每天要买一盒牛奶和一袋豆浆.7天要花多少元钱?",
            "en_text": "A box of milk is 2 yuan, a bag of soy milk is 1 yuan. Lingling's family buys a box of milk and a bag of soy milk every day. How much does it cost for 7 days?",
            "equation": "(2+1)*7",
            "ans": "21.0"
        },
        {
            "id": 160,
            "uid": "da43a57bef6311ea92893413e8a4c977",
            "zh_text": "每本相册都是32页，每页可以插6张照片.我家大约有5本相册可以插多少张照片?",
            "en_text": "Each album is 32 pages, and each page can insert 6 photos. There are about 5 albums in my family. How many photos can be inserted?",
            "equation": "32*6*5",
            "ans": "960.0"
        },
        {
            "id": 161,
            "uid": "da43a57cef6311ea92893413e8a4c977",
            "zh_text": "刘叔叔为奥运会准备了25个胶卷，每个胶卷能拍36张，他所有胶卷能拍多少张照片?",
            "en_text": "Uncle Liu prepared 25 films for the Olympics. Each film can take 36. How many photos can he take on all his films?",
            "equation": "36*25",
            "ans": "900.0"
        },
        {
            "id": 162,
            "uid": "da43a57def6311ea92893413e8a4c977",
            "zh_text": "张英李强和肖红参加跳高比赛，张英跳了1米，张英比李强低了1米.肖红比李强跳得低1米，肖红跳了多少米高?",
            "en_text": "Zhang Ying Li Qiang and Xiao Hong participated in the high jump competition. Zhang Ying jumped 1 meter, Zhang Ying was 1 meter lower than Li Qiang. Xiao Hong jumped 1 meter lower than Li Qiang, how many meters did Xiao Hong jump?",
            "equation": "1+1",
            "ans": "2.0"
        },
        {
            "id": 163,
            "uid": "da43a57eef6311ea92893413e8a4c977",
            "zh_text": "王叔叔一天卖白菜收入30元，卖土豆收入20元，卖萝卜收19元.白菜比萝卜多卖多少元钱?",
            "en_text": "Uncle Wang sells cabbage for 30 yuan a day, sells potatoes for 20 yuan, and sells radish for 19 yuan. How much more cabbage is sold than radish?",
            "equation": "30-19",
            "ans": "11.0"
        },
        {
            "id": 164,
            "uid": "da43a57fef6311ea92893413e8a4c977",
            "zh_text": "同学们在全长100米的小路一边植树，每隔1米栽一棵，小路有两边要栽.小路一共需要多少棵树苗?",
            "en_text": "The students planted trees on one side of the 100-meter-long trail, one every 1 meter, and the two sides of the trail. How many saplings are needed in the trail?",
            "equation": "100/1+1",
            "ans": "101.0"
        },
        {
            "id": 165,
            "uid": "da43a580ef6311ea92893413e8a4c977",
            "zh_text": "在全长2000米的街道一端安装路灯，街道2端也要安装，每隔1米一座.街道一共要安装多少座路灯?",
            "en_text": "Install street lights at one end of a street with a total length of 2000 meters, and install street lights at the second end of the street, one every 1 meter. How many street lights should be installed in the street?",
            "equation": "2000/1+1",
            "ans": "2001.0"
        },
        {
            "id": 166,
            "uid": "da43a581ef6311ea92893413e8a4c977",
            "zh_text": "一根木头长10米，要把1根平均分成5段.每锯下一段需要8分钟，锯完一根共要花多少分钟?",
            "en_text": "A piece of wood is 10 meters long, and one piece needs to be divided into 5 evenly. It takes 8 minutes for each piece to be sawed. How many minutes does it take to saw a piece?",
            "equation": "8*(5-1)",
            "ans": "32.0"
        },
        {
            "id": 167,
            "uid": "da43a582ef6311ea92893413e8a4c977",
            "zh_text": "每一边都有4盆花，要在5边形的水池边上摆上花盆最少需要多少盆花?",
            "en_text": "There are 4 potted flowers on each side. How many potted flowers are required to put a flower pot on the side of a 5-sided pool?",
            "equation": "(4-1)*5",
            "ans": "15.0"
        },
        {
            "id": 168,
            "uid": "da43a583ef6311ea92893413e8a4c977",
            "zh_text": "园林工人沿公路一侧植树，每隔6米种一棵，一共种了36棵距离有多少米?",
            "en_text": "The garden workers planted trees along the side of the road, planting one tree every 6 meters. How many meters are the total distance of 36 trees planted?",
            "equation": "6*(36-1)",
            "ans": "210.0"
        },
        {
            "id": 169,
            "uid": "da43a584ef6311ea92893413e8a4c977",
            "zh_text": "啄木鸟7天能吃4515只害虫，山雀7天能吃1155只害虫.啄木鸟平均每天比山雀多吃害虫多少只?",
            "en_text": "Woodpeckers can eat 4,515 pests in 7 days, and tits can eat 1,155 pests in 7 days. On average, how many more pests do woodpeckers eat per day than tits?",
            "equation": "4515/7-1155/7",
            "ans": "480.0"
        },
        {
            "id": 170,
            "uid": "da43a585ef6311ea92893413e8a4c977",
            "zh_text": "广场上的大钟5时敲响10秒钟敲完.10时敲响需要多少秒?",
            "en_text": "The big clock in the square rings at 5 o'clock in 10 seconds. How many seconds does it take to ring at 10 o'clock?",
            "equation": "5*10/(5+1)",
            "ans": "8.333333333333334"
        },
        {
            "id": 171,
            "uid": "da43a586ef6311ea92893413e8a4c977",
            "zh_text": "相邻1个车站的距离是1千米.公共汽车行驶路线全长12千米一共有多少个车站?",
            "en_text": "The distance between an adjacent station is 1 km. How many stations are there in the total length of the bus route is 12 km?",
            "equation": "12/1+1",
            "ans": "13.0"
        },
        {
            "id": 172,
            "uid": "da43a587ef6311ea92893413e8a4c977",
            "zh_text": "圆形滑冰场的一周全长是150米.如果沿着圆形滑冰场每隔1米安装一盏灯，圆形滑冰场的一周全长共需要多少盏灯?",
            "en_text": "The total length of a round skating rink is 150 meters. If lights are installed every 1 meter along the round skating rink, how many lights are needed for the total length of the round skating rink?",
            "equation": "150/1",
            "ans": "150.0"
        },
        {
            "id": 173,
            "uid": "da43a588ef6311ea92893413e8a4c977",
            "zh_text": "笔直的跑道一旁插着51面小旗的间隔是2米.现在跑道要改为只插26面小旗间隔应改为多少米?",
            "en_text": "The interval between the 51 small flags on the side of the straight runway is 2 meters. Now how many meters should the interval be changed to only 26 small flags on the runway?",
            "equation": "(51-1)*2/(26-1)",
            "ans": "4.0"
        },
        {
            "id": 174,
            "uid": "da43a589ef6311ea92893413e8a4c977",
            "zh_text": "小强每天早上跑步15分钟，他的速度大约每分钟是120米.小强每天大约跑步多少米?",
            "en_text": "Xiaoqiang runs for 15 minutes every morning, and his speed is about 120 meters per minute. How many meters does Xiaoqiang run every day?",
            "equation": "120*15",
            "ans": "1800.0"
        },
        {
            "id": 175,
            "uid": "da43a58aef6311ea92893413e8a4c977",
            "zh_text": "公共汽车在普通公路上以每小时40千米的速度行驶，4小时可以行多少千米?",
            "en_text": "A bus travels at a speed of 40 kilometers per hour on ordinary roads. How many kilometers can it travel in 4 hours?",
            "equation": "40*4",
            "ans": "160.0"
        },
        {
            "id": 176,
            "uid": "da43a58bef6311ea92893413e8a4c977",
            "zh_text": "一列火车从南京到上海运行305千米用了3小时，平均每小时行多少千米?",
            "en_text": "It took 3 hours for a train to travel 305 kilometers from Nanjing to Shanghai. How many kilometers does it travel per hour on average?",
            "equation": "305/3",
            "ans": "101.66666666666669"
        },
        {
            "id": 177,
            "uid": "da43a58cef6311ea92893413e8a4c977",
            "zh_text": "地球赤道周长约40076千米，一架飞机以每小时990千米的速度沿着赤道飞行，它绕地球飞行一周需要多少小时?",
            "en_text": "The circumference of the earth's equator is about 40,076 kilometers. An airplane flies along the equator at a speed of 990 kilometers per hour. How many hours does it take to orbit the earth?",
            "equation": "40076/990",
            "ans": "40.480808080808075"
        },
        {
            "id": 178,
            "uid": "da43a58def6311ea92893413e8a4c977",
            "zh_text": "为迎接五一劳动节，工人叔叔要在俱乐部的四周装上彩灯.已知俱乐部的长90米，宽55米，高20米，工人叔叔至少需要多少米长的彩灯线?",
            "en_text": "In order to welcome the May 1st Labor Day, the uncle workers must install colored lights around the club. It is known that the club is 90 meters long, 55 meters wide and 20 meters high. How many meters long does the uncle worker need at least?",
            "equation": "(90+55)*2+20*4",
            "ans": "370.0"
        },
        {
            "id": 179,
            "uid": "da43c3caef6311ea92903413e8a4c977",
            "zh_text": "小卖部要做一个长22厘米，宽4厘米，高8厘米的玻璃柜台，现要在柜台各边都安上角铁，这个柜台需要多少厘米角铁?",
            "en_text": "The commissary will make a glass counter with a length of 22 cm, a width of 4 cm, and a height of 8 cm. Now you need to install angle irons on each side of the counter. How many cm of angle iron does this counter need?",
            "equation": "(22+4+8)*4",
            "ans": "136.0"
        },
        {
            "id": 180,
            "uid": "da43c3cbef6311ea92903413e8a4c977",
            "zh_text": "光华街口装了一个新的铁皮邮箱，长50厘米，宽40厘米，高78厘米.做这个邮箱至少需要多少平方厘米的铁皮?",
            "en_text": "A new metal mailbox is installed at the entrance of Guanghua Street, 50 cm long, 40 cm wide, and 78 cm high. How many square centimeters of iron is required to make this mailbox?",
            "equation": "(50*40+50*78+40*78)*2",
            "ans": "18040.0"
        },
        {
            "id": 181,
            "uid": "da43c3ccef6311ea92903413e8a4c977",
            "zh_text": "长方体的饼干盒，长10厘米，宽6厘米，高12厘米.如果围着它贴一圈商标纸，这张商标纸的面积至少要多少平方厘米?",
            "en_text": "A rectangular biscuit box with a length of 10 cm, a width of 6 cm and a height of 12 cm. If a circle of label paper is pasted around it, how many square centimeters should the label paper be?",
            "equation": "(10*12+6*12)*2",
            "ans": "384.0"
        },
        {
            "id": 182,
            "uid": "da43c3cdef6311ea92903413e8a4c977",
            "zh_text": "加工厂要加工一批洗衣机的机套，每台洗衣机的长59厘米，宽42厘米，高80厘米，做1000个面积相同的机套至少用布多少平方米?",
            "en_text": "The processing plant needs to process a batch of washing machine covers. Each washing machine is 59 cm long, 42 cm wide, and 80 cm high. How many square meters of cloth should be used to make 1000 covers of the same area?",
            "equation": "((59*80+42*80)*2+59*42)*1000/10000",
            "ans": "1863.8"
        },
        {
            "id": 183,
            "uid": "da43c3ceef6311ea92903413e8a4c977",
            "zh_text": "健身中心新建一个游泳池，该游泳池的长50米，长是宽的2倍，深2米.现要在池的四周和底面都贴上瓷砖，共需要贴多少平方米的瓷砖?",
            "en_text": "A new swimming pool is built in the fitness center. The swimming pool is 50 meters long, twice as long as the width, and 2 meters deep. Now we are going to put tiles on the surrounding and bottom of the pool. How many square meters of tiles are needed?",
            "equation": "50*50/2+50*2*2+50/2*2*2",
            "ans": "1550.0"
        },
        {
            "id": 184,
            "uid": "da43c3cfef6311ea92903413e8a4c977",
            "zh_text": "学校要粉刷新教室.已知教室的长是8米，宽是6米，高是3米，如果每平方米需要花4元涂料费，粉刷教室的面积需要花费多少元?",
            "en_text": "Schools need to refresh the classrooms. Knowing that the length of the classroom is 8 meters, the width is 6 meters, and the height is 3 meters. If you need to spend 4 yuan for paint per square meter, how much does it cost to paint the area of ​​the classroom?",
            "equation": "(8*6+(8*3+6*3)*2)*4",
            "ans": "528.0"
        },
        {
            "id": 185,
            "uid": "da43c3d0ef6311ea92903413e8a4c977",
            "zh_text": "颁奖台是由3个长方体合并而成的，它的前后两面涂上黄色油漆，其他露出来的面涂红色油漆.涂黄油漆和红油漆的面积各是多少?",
            "en_text": "The podium is made up of three cuboids. Its front and back sides are painted with yellow paint, and the other exposed surfaces are painted with red paint. What is the area covered with yellow paint and red paint?",
            "equation": "2*3+1*3",
            "ans": "9.0"
        },
        {
            "id": 186,
            "uid": "da43c3d1ef6311ea92903413e8a4c977",
            "zh_text": "建筑工地要挖一个长50米，宽30米，深50米的长方体土坑，挖出多少立方米的土?",
            "en_text": "To dig a rectangular pit with a length of 50 meters, a width of 30 meters, and a depth of 50 meters on a construction site, how many cubic meters of soil should be dug?",
            "equation": "50*30*50",
            "ans": "75000.0"
        },
        {
            "id": 187,
            "uid": "da43c3d2ef6311ea92903413e8a4c977",
            "zh_text": "妈妈送给奶奶的生日蛋糕长20分米，宽10分米，高6分米，奶奶把它的体积平均分成4块长方体形状的小蛋糕，想一想怎样分，每块有多少立方分米一块蛋糕?",
            "en_text": "The birthday cake that my mother gave to grandma is 20 decimetres long, 10 decimetres wide, and 6 decimetres high. Grandma divides its volume into 4 cuboid-shaped small cakes. Think about how to divide it and how many cubic decimeters each piece has. a piece of cake?",
            "equation": "20*10*6/4",
            "ans": "300.0"
        },
        {
            "id": 188,
            "uid": "da43c3d3ef6311ea92903413e8a4c977",
            "zh_text": "家具厂订购500根方木，每根方木的体积，横截面的面积是24米，长是3米.这些方木一共是多少立方米?",
            "en_text": "The furniture factory ordered 500 square timbers. The volume of each square timber, the cross-sectional area is 24 meters, and the length is 3 meters. How many cubic meters of these square timbers are in total?",
            "equation": "0.24*3*500",
            "ans": "360.0"
        },
        {
            "id": 189,
            "uid": "da43c3d4ef6311ea92903413e8a4c977",
            "zh_text": "六一儿童节，全市的小学生用棱长3厘米的正方体塑料拼插积木在广场中央搭起了一面长6米，高2米，厚6厘米的奥运心愿墙，算一算这面墙共用了多少块积木?",
            "en_text": "On Children's Day, the city's primary school students used 3cm-long cube plastic building blocks to build a 6-meter-long, 2-meter-high, and 6-cm-thick Olympic Wish Wall in the center of the square. How many blocks?",
            "equation": "6*100*2*100*6/(3*3*3)",
            "ans": "26666.66666666667"
        },
        {
            "id": 190,
            "uid": "da43c3d5ef6311ea92903413e8a4c977",
            "zh_text": "花园小区为居民新安装了50个休息的凳子，凳面的长宽高分别是104厘米，44厘米，4厘米.凳腿的长宽高分别是44厘米，46厘米，35厘米，这些凳子共用混凝土多少立方米?",
            "en_text": "The garden community installed 50 new resting stools for residents. The length, width and height of the stool surface are 104 cm, 44 cm, and 4 cm. The length, width and height of the stool legs are 44 cm, 46 cm, and 35 cm. These stools are shared. How many cubic meters of concrete?",
            "equation": "(104*44+44*4+46*35)/10000*50",
            "ans": "31.81"
        },
        {
            "id": 191,
            "uid": "da43c3d6ef6311ea92903413e8a4c977",
            "zh_text": "公园南面要修一道长15米，厚24厘米，高3米的围墙.如果每立方米用砖525块，这道围墙的所有体积一共用砖多少块?",
            "en_text": "To the south of the park, a 15-meter-long, 24-centimetre-thick, and 3-meter-high enclosure wall must be built. If 525 bricks are used per cubic meter, how many bricks does the total volume of this enclosure share?",
            "equation": "15*24/100*3*525",
            "ans": "5670.0"
        },
        {
            "id": 192,
            "uid": "da43c3d7ef6311ea92903413e8a4c977",
            "zh_text": "一个长方体和一个正方体的棱长总和相等，已知长方体的长宽高分别是6分米，5分米，4分米，那么正方体的棱长是多少分米?它们的体积相等吗?",
            "en_text": "The sum of the edge lengths of a cuboid and a cube is equal. It is known that the length, width and height of the cuboid are 6 decimeters, 5 decimeters, and 4 decimeters respectively. So what is the edge length of the cube? Are they equal in volume?",
            "equation": "(6+5+4)*4/12",
            "ans": "5.0"
        },
        {
            "id": 193,
            "uid": "da43c3d8ef6311ea92903413e8a4c977",
            "zh_text": "某邮政运货车，车厢是长方体.从里面量长3米，宽2米，高2米.它的容积是多少立方米?",
            "en_text": "A certain postal freight truck has a cuboid. From the inside, it measures 3 meters long, 2 meters wide, and 2 meters high. What is its volume?",
            "equation": "3*2*2",
            "ans": "12.0"
        },
        {
            "id": 194,
            "uid": "da43c3d9ef6311ea92903413e8a4c977",
            "zh_text": "一个长方体冰柜，从里面量长87厘米，宽50厘米，深56厘米，它的容积是多少立方分米?",
            "en_text": "A cuboid freezer measures 87 cm long, 50 cm wide, and 56 cm deep from the inside. What is its volume in cubic decimeters?",
            "equation": "87*50*56/1000",
            "ans": "243.6"
        },
        {
            "id": 195,
            "uid": "da43c3daef6311ea92903413e8a4c977",
            "zh_text": "一个长方体玻璃容器，从里面量长宽均为2分米，向容器中倒入5升水，再把一个土豆放入水中.这时量得容器内的水深是13分米.这个土豆的体积是多少?",
            "en_text": "A rectangular glass container, measuring 2 decimeters in length and width, pour 5 liters of water into the container, and then put a potato into the water. At this time, the water depth in the container is measured to be 13 decimeters. The volume of this potato is How many?",
            "equation": "2*2*(13-5)",
            "ans": "32.0"
        },
        {
            "id": 196,
            "uid": "da43c3dbef6311ea92903413e8a4c977",
            "zh_text": "一种微波炉，产品说明书上标明:炉腔内部尺寸400×225×300(单位:毫米)这个微波炉的容积是多少升?",
            "en_text": "A kind of microwave oven, the product manual indicates: The internal size of the cavity is 400 × 225 × 300 (unit: mm) What is the volume of this microwave oven?",
            "equation": "400/100*225/100*300/100",
            "ans": "27.0"
        },
        {
            "id": 197,
            "uid": "da43c3dcef6311ea92903413e8a4c977",
            "zh_text": "哈尔滨冰雪大世界每年用的冰大约能融化成80000立方米的水，它们相当于多少个长50米，宽25米，深2米的游泳池的储水量?",
            "en_text": "The ice used in Harbin Ice and Snow World can melt into 80,000 cubic meters of water every year. How many swimming pools are 50 meters long, 25 meters wide, and 2 meters deep?",
            "equation": "80000/(50*25*2)",
            "ans": "32.0"
        },
        {
            "id": 198,
            "uid": "da43c3ddef6311ea92903413e8a4c977",
            "zh_text": "新疆吐鲁番晾制葡萄干的土坯房，其中一间的底面积是18平方米，高是2米.它的容积是多少?",
            "en_text": "One of the adobe houses where raisins are dried in Turpan, Xinjiang, has a floor area of ​​18 square meters and a height of 2 meters. What is its volume?",
            "equation": "18*2",
            "ans": "36.0"
        },
        {
            "id": 199,
            "uid": "da43c3deef6311ea92903413e8a4c977",
            "zh_text": "一节火车厢，从里面量，长13米，宽2米，装的煤高1米，平均每立方米煤重2吨，这节车厢煤的体积重多少吨?",
            "en_text": "A train carriage, measured from the inside, is 13 meters long, 2 meters wide, and the loaded coal is 1 meter high, and the average coal weight per cubic meter is 2 tons. How many tons of coal does this carriage weigh?",
            "equation": "13*2*1*2",
            "ans": "52.0"
        },
        {
            "id": 200,
            "uid": "da43c3dfef6311ea92903413e8a4c977",
            "zh_text": "某海岛战士为解决岛上淡水缺乏问题，和当地居民共同修建一个长22米，宽10米，深2米的淡水蓄水池，这个蓄水池最多可蓄水多少立方米?",
            "en_text": "In order to solve the problem of the lack of fresh water on the island, a fighter on the island and the local residents built a 22-meter-long, 10-meter-wide, and 2-meter-deep freshwater reservoir. How many cubic meters of water can this reservoir hold?",
            "equation": "22*10*2",
            "ans": "440.0"
        },
        {
            "id": 201,
            "uid": "da43c3e0ef6311ea92903413e8a4c977",
            "zh_text": "乒乓球台的长度为2740毫米，宽度为1525毫米，台面厚度为25毫米，它的表面喷上了漆，喷漆的面积是多少平方米?",
            "en_text": "The length of the ping pong table is 2740 mm, the width is 1525 mm, and the thickness of the table is 25 mm. Its surface is sprayed with paint. What is the area of ​​spray paint?",
            "equation": "(2740*1525+25*25)*2/10000",
            "ans": "835.825"
        },
        {
            "id": 202,
            "uid": "da43c3e1ef6311ea92903413e8a4c977",
            "zh_text": "一个长方体鱼塘长8米，宽4米，深2米.这个鱼塘的容积大约是多少立方米?",
            "en_text": "A rectangular fish pond is 8 meters long, 4 meters wide, and 2 meters deep. What is the volume of this fish pond about cubic meters?",
            "equation": "8*4*2",
            "ans": "64.0"
        },
        {
            "id": 203,
            "uid": "da43c3e2ef6311ea92903413e8a4c977",
            "zh_text": "新建的篮球馆要铺设3厘米厚的木质地板，已知该馆的长36米，宽20米，铺设它至少要用多少立方米的木材?",
            "en_text": "The newly built basketball hall needs to be laid with a 3 cm thick wooden floor. It is known that the hall is 36 meters long and 20 meters wide. How many cubic meters of wood should be used to lay it?",
            "equation": "36*20*3/100",
            "ans": "21.6"
        },
        {
            "id": 204,
            "uid": "da43c3e3ef6311ea92903413e8a4c977",
            "zh_text": "一个20立方米的花坛种4种花，每种花平均占地多少平方米?",
            "en_text": "A 20 cubic meter flowerbed has 4 kinds of flowers, how many square meters does each flower occupy on average?",
            "equation": "20/4",
            "ans": "5.0"
        },
        {
            "id": 205,
            "uid": "da43c3e4ef6311ea92903413e8a4c977",
            "zh_text": "一只长方体的玻璃缸，长8分米、宽6分米，高4分米，水深2分米.如果投入一块棱长为4分米的正方体铁块，缸里的水溢出多少升?",
            "en_text": "A cuboid glass cylinder is 8 decimetres long, 6 decimetres wide, 4 decimetres high, and 2 decimetres deep. If a cube of iron with an edge length of 4 decimetres is put in, how many liters of water overflows in the cylinder?",
            "equation": "8*6*2+4*4*4-8*6*4",
            "ans": "-32.0"
        },
        {
            "id": 206,
            "uid": "da43ec0aef6311ea929b3413e8a4c977",
            "zh_text": "用120厘米的铁丝做一个长方体的框架.长，宽，高的比是3:2:1，这个长方体的长宽高分别是多少?",
            "en_text": "Use 120 cm of iron wire to make a cuboid frame. The ratio of length, width, and height is 3:2:1. What is the length, width and height of this cuboid?",
            "equation": "120/4*3/(3+2+1)",
            "ans": "15.0"
        },
        {
            "id": 207,
            "uid": "da43ec0bef6311ea929b3413e8a4c977",
            "zh_text": "学校会议室用方砖铺地.用8平方分米的方砖铺需要350块;如果改成10平方分米的方砖铺需要多少块?",
            "en_text": "The school meeting room uses square bricks to pave the floor. It takes 350 pieces to pave the square bricks of 8 square decimeters; how many square bricks do you need if you change it to 10 square decimeters?",
            "equation": "8*350/10",
            "ans": "280.0"
        },
        {
            "id": 208,
            "uid": "da43ec0cef6311ea929b3413e8a4c977",
            "zh_text": "用一根长24分米的铁丝做一个长方体框架，使它的长、宽、高的比是5:4:3.在这个长方体框架外面糊一层纸，至少需要多少平方米的纸?它的体积是多少立方分米?",
            "en_text": "Use a 24 decimeter long iron wire to make a rectangular parallelepiped frame so that the ratio of its length, width, and height is 5:4:3. To paste a layer of paper on the outside of the rectangular parallelepiped frame, how many square meters of paper is required? What is its volume in cubic decimeters?",
            "equation": "24/4*5/(5+4+3)*24/4*4/(5+4+3)*24/4*3/(5+4+3)/100",
            "ans": "0.075"
        },
        {
            "id": 209,
            "uid": "da43ec0def6311ea929b3413e8a4c977",
            "zh_text": "一块长方形草地，宽8米，长比宽多3米，这个草地的周长是多少米?",
            "en_text": "A rectangular grass is 8 meters wide and 3 meters longer than its width. What is the perimeter of the grass?",
            "equation": "(8+3+8)*2",
            "ans": "38.0"
        },
        {
            "id": 210,
            "uid": "da43ec0eef6311ea929b3413e8a4c977",
            "zh_text": "一块长方形菜地，长6米，宽3米.四周围上篱笆，篱笆的周长是多少米?",
            "en_text": "A rectangular vegetable plot is 6 meters long and 3 meters wide. There is a fence around it. What is the circumference of the fence?",
            "equation": "(6+3)*2",
            "ans": "18.0"
        },
        {
            "id": 211,
            "uid": "da43ec0fef6311ea929b3413e8a4c977",
            "zh_text": "王大妈家有一块靠墙的长方形菜地，长15米，宽8米，给这块菜地围上篱笆至少需要多少米长的篱笆?",
            "en_text": "Aunt Wang's house has a rectangular vegetable plot against the wall, 15 meters long and 8 meters wide. How many meters long does it take to fence this vegetable plot?",
            "equation": "8*2+15",
            "ans": "31.0"
        },
        {
            "id": 212,
            "uid": "da43ec10ef6311ea929b3413e8a4c977",
            "zh_text": "一张长方形的餐桌，桌面长14分米，宽9分米.要配上同样大小的玻璃，这块玻璃的面积应该是多少平方分米?",
            "en_text": "A rectangular dining table, the table top is 14 decimeters long and 9 decimeters wide. To be equipped with the same size glass, how many square decimeters should the glass area be?",
            "equation": "14*9",
            "ans": "126.0"
        },
        {
            "id": 213,
            "uid": "da43ec11ef6311ea929b3413e8a4c977",
            "zh_text": "长方形的篮球场的长是28米，宽是15米.它的面积是多少平方米?",
            "en_text": "The rectangular basketball court is 28 meters long and 15 meters wide. What is its area?",
            "equation": "28*15",
            "ans": "420.0"
        },
        {
            "id": 214,
            "uid": "da43ec12ef6311ea929b3413e8a4c977",
            "zh_text": "一面长方形的镜子长12分米、宽5分米.它的面积是多少平方分米?",
            "en_text": "A rectangular mirror is 12 decimetres long and 5 decimetres wide. What is its area?",
            "equation": "12*5",
            "ans": "60.0"
        },
        {
            "id": 215,
            "uid": "da43ec13ef6311ea929b3413e8a4c977",
            "zh_text": "一个长方形花坛，长50米、宽25米.求这个花坛的占地面积是多少平方米?",
            "en_text": "A rectangular flowerbed is 50 meters long and 25 meters wide. What is the area of ​​this flowerbed?",
            "equation": "50*25",
            "ans": "1250.0"
        },
        {
            "id": 216,
            "uid": "da43ec14ef6311ea929b3413e8a4c977",
            "zh_text": "同学们出的长方形墙报，长18分米、宽12分米.墙报的面积是多少平方分米?",
            "en_text": "The rectangular wall newspaper produced by the students is 18 dm long and 12 dm wide. What is the area of ​​the wall paper?",
            "equation": "18*12",
            "ans": "216.0"
        },
        {
            "id": 217,
            "uid": "da43ec15ef6311ea929b3413e8a4c977",
            "zh_text": "教室前面的长方形墙壁长6米，宽3米.现在要粉刷这面墙壁，要粉刷的面积是多少平方米?",
            "en_text": "The rectangular wall in front of the classroom is 6 meters long and 3 meters wide. Now we are going to paint this wall. What is the area to be painted?",
            "equation": "6*3",
            "ans": "18.0"
        },
        {
            "id": 218,
            "uid": "da43ec16ef6311ea929b3413e8a4c977",
            "zh_text": "小云家有一块长方形的菜地，面积是68平方米，它的宽是4米，长是多少米?",
            "en_text": "Xiaoyun's family has a rectangular vegetable plot with an area of ​​68 square meters. Its width is 4 meters and how long is it?",
            "equation": "68/4",
            "ans": "17.0"
        },
        {
            "id": 219,
            "uid": "da43ec17ef6311ea929b3413e8a4c977",
            "zh_text": "长方形的周长是194米.长比宽的2倍少8米，这个长方形的长是多少米?",
            "en_text": "The circumference of the rectangle is 194 meters. The length is 8 meters less than twice the width. How long is the rectangle in meters?",
            "equation": "(194/2+8)/3*2-8",
            "ans": "62.0"
        },
        {
            "id": 220,
            "uid": "da43ec18ef6311ea929b3413e8a4c977",
            "zh_text": "一个长方形花坛，长100米、宽40米.求这个花坛的占地面积多少平方米?",
            "en_text": "A rectangular flowerbed is 100 meters long and 40 meters wide. How many square meters does this flowerbed occupy?",
            "equation": "100*40",
            "ans": "4000.0"
        },
        {
            "id": 221,
            "uid": "da43ec19ef6311ea929b3413e8a4c977",
            "zh_text": "一个长方形花坛的长是5米，宽是3米.这个花坛的周长是多少米?",
            "en_text": "The length of a rectangular flowerbed is 5 meters and the width is 3 meters. What is the circumference of this flowerbed?",
            "equation": "(5+3)*2",
            "ans": "16.0"
        },
        {
            "id": 222,
            "uid": "da43ec1aef6311ea929b3413e8a4c977",
            "zh_text": "甲乙两车从两地同时出发相向而行，乙车每小时行60千米，乙车每小时行的是甲车每小时行的2倍，经过3小时相遇.两地相距多少千米?",
            "en_text": "Cars A and B depart from the two places at the same time and travel towards each other. Car B travels 60 kilometers per hour, and car B travels twice as much as car A travels per hour. After 3 hours, they meet. How many kilometers are the two places apart?",
            "equation": "(60+60/2)*3",
            "ans": "270.0"
        },
        {
            "id": 223,
            "uid": "da43ec1bef6311ea929b3413e8a4c977",
            "zh_text": "甲乙两车从两地同时出发相向而行，甲车每小时行40千米，乙车每小时比甲车多行20千米，经过3小时相遇.两地相距多少千米?",
            "en_text": "Cars A and B depart from the two places at the same time and go toward each other. Car A travels 40 kilometers per hour, and Car B travels 20 kilometers more than car A per hour. After 3 hours, they meet. How many kilometers are the two places apart?",
            "equation": "(40+20+40)*3",
            "ans": "300.0"
        },
        {
            "id": 224,
            "uid": "da43ec1cef6311ea929b3413e8a4c977",
            "zh_text": "甲乙两车从两地同时出发相向而行，甲车每小时行40千米，乙车每小时行60千米，4小时后还相距20千米，两地相距多少千米?",
            "en_text": "The two cars A and B set off from the two places at the same time and go towards each other. Car A travels 40 kilometers per hour, and Car B travels 60 kilometers per hour. After 4 hours, they are still 20 kilometers apart. How many kilometers are the two places apart?",
            "equation": "(40+60)*4+20",
            "ans": "420.0"
        },
        {
            "id": 225,
            "uid": "da43ec1def6311ea929b3413e8a4c977",
            "zh_text": "甲乙两车从两地同时出发相向而行，甲车每小时行40千米，乙车每小时行60千米，经过30小时相遇.两地相距多少千米?",
            "en_text": "Cars A and B set off at the same time from the two places and traveled towards each other. Car A travels 40 kilometers per hour, and Vehicle B travels 60 kilometers per hour. After 30 hours, they meet. How many kilometers are the two places apart?",
            "equation": "(40+60)*30",
            "ans": "3000.0"
        },
        {
            "id": 226,
            "uid": "da43ec1eef6311ea929b3413e8a4c977",
            "zh_text": "汽车和自行车从相距172千米的两地同时出发，相向而行，3小时后两车相遇.已知汽车每小时比自行车多行31千米，求汽车的速度是多少千米?",
            "en_text": "The car and the bicycle set off at the same time from two places 172 kilometers apart, and they will meet each other after 3 hours. It is known that the car travels 31 kilometers more than the bicycle per hour. What is the speed of the car?",
            "equation": "(172/3+31)/2",
            "ans": "44.16666666666667"
        },
        {
            "id": 227,
            "uid": "da43ec1fef6311ea929b3413e8a4c977",
            "zh_text": "聪聪和明明同时从各自的家相对出发，明明每分钟走20米，聪聪骑着脚踏车每分钟比明明快42米，经过20分钟后两人相遇，你知道聪聪家和明明家的距离是多少米吗?",
            "en_text": "Congcong and Mingming set off from their respective homes at the same time. Mingming walks 20 meters per minute. Congcong rides a bicycle 42 meters per minute faster than Mingming. After 20 minutes, the two meet. Do you know the distance between Congcong's house and Mingming's house. How many meters is it?",
            "equation": "(20+42)*20",
            "ans": "1240.0"
        },
        {
            "id": 228,
            "uid": "da43ec20ef6311ea929b3413e8a4c977",
            "zh_text": "孙悟空在花果山，猪八戒在高老庄，花果山和高老庄中间有条流沙河，一天，他们约好在流沙河见面，孙悟空的速度是200千米每小时.猪八戒的速度是150千米每小时，他们同时出发2小时后还相距500千米，则花果山和高老庄之间的距离是多少千米?",
            "en_text": "Monkey King is in Huaguo Mountain, Zhu Bajie is in Gaolaozhuang, and there is a Liusha River between Huaguo Mountain and Gaolaozhuang. One day, they arranged to meet at Liusha River. Monkey King's speed is 200 kilometers per hour. Zhu Bajie's speed is 150. Kilometers per hour, they are still 500 kilometers apart after 2 hours of departure at the same time, so what is the distance between Huaguoshan and Gaolaozhuang?",
            "equation": "(200+150)*2+500",
            "ans": "1200.0"
        },
        {
            "id": 229,
            "uid": "da4411caef6311ea92a43413e8a4c977",
            "zh_text": "光明号渔船顺水而下行200千米要10小时，逆水而上行120千米也要10小时.那么，在静水中航行320千米需要多少小时?",
            "en_text": "It takes 10 hours for the Guangming fishing boat to go down 200 kilometers down the water and 10 hours to go up 120 kilometers against the water. So how many hours does it take to sail 320 kilometers in still water?",
            "equation": "320/((200/10+120/10)/2)",
            "ans": "20.0"
        },
        {
            "id": 230,
            "uid": "da4411cbef6311ea92a43413e8a4c977",
            "zh_text": "一个圆形喷水池的半径是5米，它的周长是多少米?",
            "en_text": "The radius of a circular fountain is 5 meters, how many meters is its circumference?",
            "equation": "3.14*2*5",
            "ans": "31.4"
        },
        {
            "id": 231,
            "uid": "da4411ccef6311ea92a43413e8a4c977",
            "zh_text": "在一个圆形亭子里，小丽走完它的直径需用12步，每1步大约是55厘米.这个圆形亭子的周长大约是多少厘米?",
            "en_text": "In a circular pavilion, Xiaoli needs 12 steps to complete its diameter, and each step is about 55 cm. What is the circumference of this circular pavilion?",
            "equation": "3.14*35*12/100",
            "ans": "13.188000000000002"
        },
        {
            "id": 232,
            "uid": "da4411cdef6311ea92a43413e8a4c977",
            "zh_text": "小红量的一个古代建筑中的大红圆柱的周长是18米，这个圆柱的直径是多少米?",
            "en_text": "The circumference of the big red column in an ancient building in Xiaohongliang is 18 meters. What is the diameter of this column?",
            "equation": "18/3.14",
            "ans": "5.732484076433121"
        },
        {
            "id": 233,
            "uid": "da4411ceef6311ea92a43413e8a4c977",
            "zh_text": "小东有一辆自行车，车轮的直径大约是66厘米，如果平均每分钟转100周，从家到学校的路程是2000米，大约需要多少分钟?",
            "en_text": "Xiaodong has a bicycle, the diameter of the wheel is about 66 cm, if the average rotation is 100 weeks per minute, the distance from home to school is 2000 meters, how many minutes will it take?",
            "equation": "2000/(3.14*0.66*100)",
            "ans": "9.650646593321753"
        },
        {
            "id": 234,
            "uid": "da4411cfef6311ea92a43413e8a4c977",
            "zh_text": "一只挂钟的分针长20厘米，经过30分钟后，分针的尖端所走的路程是是多少厘米?经过45分钟吗?",
            "en_text": "The minute hand of a wall clock is 20 centimeters long. After 30 minutes, how many centimeters does the tip of the minute hand travel? Will it take 45 minutes?",
            "equation": "45",
            "ans": "45.0"
        },
        {
            "id": 235,
            "uid": "da4411d0ef6311ea92a43413e8a4c977",
            "zh_text": "一个圆形牛栏的半径是15米，要用多长的粗铁丝才能把牛栏围上三圈?如果每隔2米装上一根木桩，大约要多少根木桩?",
            "en_text": "The radius of a circular bullpen is 15 meters. How long does it take to enclose the bullpen in three circles? If a wooden stake is installed every 2 meters, how many stakes are required?",
            "equation": "3.14*15*2*3/2",
            "ans": "141.3"
        },
        {
            "id": 236,
            "uid": "da4411d1ef6311ea92a43413e8a4c977",
            "zh_text": "在一个周长为100厘米的正方形纸片内，要剪一个最大的圆，这个圆的半径是多少厘米?",
            "en_text": "In a square piece of paper with a circumference of 100 cm, to cut a largest circle, what is the radius of the circle?",
            "equation": "100/4/2",
            "ans": "12.5"
        },
        {
            "id": 237,
            "uid": "da4411d2ef6311ea92a43413e8a4c977",
            "zh_text": "杂技演员表演独轮车走钢丝，车轮的直径为40厘米，要骑过50米长的钢丝，车轮大约转动多少周?",
            "en_text": "The acrobat performs a tightrope walk on a unicycle. The diameter of the wheel is 40 cm. It has to ride a 50-meter-long steel wire.",
            "equation": "50/(3.14*40/100)",
            "ans": "39.808917197452224"
        },
        {
            "id": 238,
            "uid": "da4411d3ef6311ea92a43413e8a4c977",
            "zh_text": "一个圆形茶几桌面的直径是4厘米，它的面积是多少平方厘米?",
            "en_text": "The diameter of the table top of a round coffee table is 4 cm. What is its area?",
            "equation": "3.14*(4/2)**2",
            "ans": "12.56"
        },
        {
            "id": 239,
            "uid": "da4411d4ef6311ea92a43413e8a4c977",
            "zh_text": "一个圆形环岛的直径是50米，中间是一个直径为10米的圆形花坛，其他地方时草坪，草坪的占地面积是多少?",
            "en_text": "The diameter of a circular island is 50 meters, and in the middle is a circular flower bed with a diameter of 10 meters. In other places, what is the area of ​​lawn and lawn?",
            "equation": "3.14*((50/2)**2-(10/2)**2)",
            "ans": "1884.0"
        },
        {
            "id": 240,
            "uid": "da4411d5ef6311ea92a43413e8a4c977",
            "zh_text": "公园草地上一个自动旋转喷灌装置的射程是10米，它能喷灌的面积是多少?",
            "en_text": "The range of an automatic rotating sprinkler irrigation device on the grass in the park is 10 meters. What is the area that it can sprinkle?",
            "equation": "3.14*10**2",
            "ans": "314.0"
        },
        {
            "id": 241,
            "uid": "da4411d6ef6311ea92a43413e8a4c977",
            "zh_text": "小刚量的一棵树干的周长是126厘米，这棵树的横截面的面积是多少?",
            "en_text": "The circumference of a small tree trunk is 126 cm. What is the cross-sectional area of ​​this tree?",
            "equation": "3.14*(126/3.14/2)**2",
            "ans": "1264.0127388535036"
        },
        {
            "id": 242,
            "uid": "da4411d7ef6311ea92a43413e8a4c977",
            "zh_text": "右面圆的半径是5厘米，把它平均分成4份，其中一份的面积是多少?3份的面积是多少?",
            "en_text": "The radius of the circle on the right is 5 cm. Divide it into 4 equal parts. What is the area of ​​one part? What is the area of ​​3 parts?",
            "equation": "3.14*5**2",
            "ans": "78.5"
        },
        {
            "id": 243,
            "uid": "da4411d8ef6311ea92a43413e8a4c977",
            "zh_text": "有一根绳子长30米，小东和小林分别想用这根绳子在操场上围出一块地，怎样面积最大?",
            "en_text": "There is a rope that is 30 meters long. Xiaodong and Xiaolin each want to use this rope to enclose a piece of land on the playground. How is the largest area?",
            "equation": "3.14*(30/2)**2",
            "ans": "706.5"
        },
        {
            "id": 244,
            "uid": "da4411d9ef6311ea92a43413e8a4c977",
            "zh_text": "一个圆形餐桌面的直径是2米，它的周长是多少米?它的面积是多少?如果一个人需要0.5米宽的位置就餐，这桌餐桌大约能坐多少人?",
            "en_text": "The diameter of a round dining table is 2 meters. What is its circumference in meters? What is its area? If a person needs a 0.5-meter-wide position to eat, how many people can sit on this table?",
            "equation": "3.14*(2/2)**2/0.5",
            "ans": "6.28"
        },
        {
            "id": 245,
            "uid": "da4411daef6311ea92a43413e8a4c977",
            "zh_text": "一种汽车的方向盘的直径是40厘米，它的周长是多少厘米?",
            "en_text": "The diameter of a steering wheel of a car is 40 cm. What is its circumference?",
            "equation": "3.14*40",
            "ans": "125.6"
        },
        {
            "id": 246,
            "uid": "da4411dbef6311ea92a43413e8a4c977",
            "zh_text": "用一根长126厘米的铁条焊接成一个圆形铁环，它的半径大约是多少厘米?",
            "en_text": "A 126 cm long iron bar is welded to form a circular iron ring. What is its radius?",
            "equation": "126/3.14/2",
            "ans": "20.063694267515928"
        },
        {
            "id": 247,
            "uid": "da4411dcef6311ea92a43413e8a4c977",
            "zh_text": "一个底面是圆形的铁炉，地面圆的周长是150米.底面积是多少平方米?",
            "en_text": "An iron furnace with a circular bottom surface, the circumference of the ground circle is 150 meters. What is the area of ​​the bottom square?",
            "equation": "3.14*(150/3.14/2)**2",
            "ans": "1791.4012738853498"
        },
        {
            "id": 248,
            "uid": "da4411ddef6311ea92a43413e8a4c977",
            "zh_text": "一个长方形和正方形的面积是1225平方厘米，一个圆的面积是1256平方厘米，这三个图形的周长哪个最大?哪个最小?如果这三个图形的面积相等，你能发现它们的周长之间的大小关系吗?",
            "en_text": "The area of ​​a rectangle and a square is 1225 square centimeters, and the area of ​​a circle is 1256 square centimeters. Which of the three figures has the largest perimeter? Which is the smallest? If the areas of the three figures are equal, you can find the difference between their perimeters Does size matter?",
            "equation": "(2*5+11+13)*3-(2*5+11+13)",
            "ans": "68.0"
        },
        {
            "id": 249,
            "uid": "da4411deef6311ea92a43413e8a4c977",
            "zh_text": "农家小院用传统的石磨作为粮食加工工具吸引游客.一位游客沿着半径是1米的圆周推磨，走了300圈，大约走了多少米?",
            "en_text": "The farmyard uses a traditional stone mill as a grain processing tool to attract tourists. A tourist walks along a circle with a radius of 1 meter and walks 300 times. How many meters does it travel?",
            "equation": "2*3.14*1*300",
            "ans": "1884.0"
        },
        {
            "id": 250,
            "uid": "da4411dfef6311ea92a43413e8a4c977",
            "zh_text": "广告公司制作了，底面的直径是2米，高4米的圆柱形灯箱.可以张贴多少平方米面积的海报?",
            "en_text": "The advertising company produced a cylindrical light box with a diameter of 2 meters and a height of 4 meters. How many square meters of posters can be posted?",
            "equation": "3.14*2*4",
            "ans": "25.12"
        },
        {
            "id": 251,
            "uid": "da4411e0ef6311ea92a43413e8a4c977",
            "zh_text": "中队委员把棱长46厘米的正方体纸箱的各面都贴上红纸，将它做为给希望小学募捐的“爱心箱”，他们至少需要多少平方厘米的红纸?",
            "en_text": "The squadron members put red paper on each side of the 46 cm cube carton box and used it as a donation box for Hope Primary School. How many square centimeters of red paper do they need at least?",
            "equation": "46*46*6",
            "ans": "12696.0"
        },
        {
            "id": 252,
            "uid": "da4411e1ef6311ea92a43413e8a4c977",
            "zh_text": "棱长30厘米的正方体冰块，它的体积是多少立方厘米?",
            "en_text": "What is the volume of a cube ice cube with a side length of 30 cm?",
            "equation": "30*30*30",
            "ans": "27000.0"
        },
        {
            "id": 253,
            "uid": "da4411e2ef6311ea92a43413e8a4c977",
            "zh_text": "一块正方形手帕的边长是2分米，周长是多少分米?",
            "en_text": "The side length of a square handkerchief is 2 decimeters, how many decimeters is the circumference?",
            "equation": "2*4",
            "ans": "8.0"
        },
        {
            "id": 254,
            "uid": "da4411e3ef6311ea92a43413e8a4c977",
            "zh_text": "一块正方形手帕的边长是2分米，面积是多少平方分米?",
            "en_text": "The side length of a square handkerchief is 2 decimeters, and how many square decimeters is the area?",
            "equation": "2*2",
            "ans": "4.0"
        },
        {
            "id": 255,
            "uid": "da4411e4ef6311ea92a43413e8a4c977",
            "zh_text": "花园里有一个正方形的荷花池.它的周长是64米，面积是多少平方米?",
            "en_text": "There is a square lotus pond in the garden. Its circumference is 64 meters, and how many square meters is its area?",
            "equation": "64/4*64/4",
            "ans": "256.0"
        },
        {
            "id": 256,
            "uid": "da4411e5ef6311ea92a43413e8a4c977",
            "zh_text": "正方形围棋盘的最外层每边能放19个棋子.最外层一共可以放多少个棋子?",
            "en_text": "The outermost layer of a square Go board can hold 19 pieces on each side. How many pieces can be placed in the outermost layer?",
            "equation": "19*4-4",
            "ans": "72.0"
        },
        {
            "id": 257,
            "uid": "da4411e6ef6311ea92a43413e8a4c977",
            "zh_text": "48名学生在操场上做游戏围成一个正方形，每边人数相等.四个顶点都有人，每边各有多少名学生?",
            "en_text": "48 students play games on the playground to form a square with equal numbers on each side. There are people on the four vertices, how many students are on each side?",
            "equation": "48/4+1",
            "ans": "13.0"
        },
        {
            "id": 258,
            "uid": "da4439dcef6311ea92af3413e8a4c977",
            "zh_text": "学校楼前摆放了一个正方形花坛.这个花坛的最外层每边各摆放8盆花，最外层共摆了多少盆花?",
            "en_text": "A square flowerbed is placed in front of the school building. There are 8 potted flowers on each side of the outermost layer of the flowerbed. How many potted flowers are placed on the outermost layer?",
            "equation": "8*4-4",
            "ans": "28.0"
        },
        {
            "id": 259,
            "uid": "da4439ddef6311ea92af3413e8a4c977",
            "zh_text": "为迎接六一儿童节，学校举行团体操表演.四年级学生排成正方形，最外层每边站了15个人，最外层一共有多少个学生?",
            "en_text": "In order to welcome the Children's Day, the school held a group gymnastics performance. The fourth grade students lined up in a square, and there were 15 people on each side of the outermost layer. How many students are there in the outermost layer?",
            "equation": "15*4-4",
            "ans": "56.0"
        },
        {
            "id": 260,
            "uid": "da4439deef6311ea92af3413e8a4c977",
            "zh_text": "为迎接六一儿童节，学校举行团体操表演.四年级学生排成正方形，最外层每边站了15个人，整个方阵一共有多少个学生?",
            "en_text": "In order to welcome the Children's Day, the school held a group gymnastics performance. The fourth grade students lined up in a square, and there were 15 people on each side of the outermost layer. How many students are there in the entire square?",
            "equation": "15*4-4",
            "ans": "56.0"
        },
        {
            "id": 261,
            "uid": "da4439dfef6311ea92af3413e8a4c977",
            "zh_text": "妈妈带小明坐长途汽车去看奶奶，途中要走308千米.他们早上8时出发，汽车平均每小时行80千米，中午12时能到达吗?",
            "en_text": "My mother took Xiao Ming to see his grandmother in a long-distance bus. They had to walk 308 kilometers on the way. They set off at 8 a.m. and the car traveled an average of 80 kilometers per hour. Can they arrive at 12 noon?",
            "equation": "12",
            "ans": "12.0"
        },
        {
            "id": 262,
            "uid": "da4439e0ef6311ea92af3413e8a4c977",
            "zh_text": "小明家、小红家和学校在同一条路上.小红家到学校有312米.小明家到学校只有155米.小明家到小红家有多远?(他们两家和学校的位置可能有几种情况?)",
            "en_text": "Xiaoming's house, Xiaohong's house and school are on the same road. Xiaohong's house is 312 meters from school. Xiaoming's house is only 155 meters from school. How far is Xiaoming's house to Xiaohong's house? (The location of their two and the school may be different In several situations?)",
            "equation": "2",
            "ans": "2.0"
        },
        {
            "id": 263,
            "uid": "da4439e1ef6311ea92af3413e8a4c977",
            "zh_text": "一列火车本应11:20到达，现在要晚点25分钟.它什么时候到达?",
            "en_text": "A train was supposed to arrive at 11:20, but now it is 25 minutes late. When will it arrive?",
            "equation": "11",
            "ans": "11.0"
        },
        {
            "id": 264,
            "uid": "da4439e2ef6311ea92af3413e8a4c977",
            "zh_text": "小强每天早上跑步15分钟，他的速度大约是120米∕分.小强每天大约跑步多少米?",
            "en_text": "Xiaoqiang runs for 15 minutes every morning, and his speed is about 120 meters per minute. How many meters does Xiaoqiang run every day?",
            "equation": "120*15",
            "ans": "1800.0"
        },
        {
            "id": 265,
            "uid": "da4439e3ef6311ea92af3413e8a4c977",
            "zh_text": "王叔叔从县城出发去王庄乡送化肥.去的时候用了3小时，每小时行驶40千米，返回用了2小时.(1)、从县城到王庄乡有多远?(2)、返回时平均每小时行多少千米?",
            "en_text": "Uncle Wang departed from the county seat to Wangzhuang Township to deliver fertilizers. It took 3 hours to go there, 40 kilometers per hour, and 2 hours to return. (1) How far is it from the county town to Wangzhuang Township? (2) 、How many kilometers per hour on average when returning?",
            "equation": "3*40/2",
            "ans": "60.0"
        },
        {
            "id": 266,
            "uid": "da4439e4ef6311ea92af3413e8a4c977",
            "zh_text": "一辆旅游车在平原和山区各行了2小时，最后到达山顶.在平原的速度是50千米∕时，在山区的速度是30千米∕时.这段路程有多长?",
            "en_text": "A tourist car traveled on the plain and the mountain for 2 hours each, and finally reached the top of the mountain. When the speed in the plain is 50 kilometers/hour, the speed in the mountains is 30 kilometers/hour. How long is the journey?",
            "equation": "2*(50+30)",
            "ans": "160.0"
        },
        {
            "id": 267,
            "uid": "da4439e5ef6311ea92af3413e8a4c977",
            "zh_text": "公共汽车在普通公路上以40千米∕时的速度行驶，4小时可以行多少千米?小轿车在高速公路上行驶的速度是公共汽车的2倍，小轿车用同样的时间可行多少千米?",
            "en_text": "A bus travels at a speed of 40 kilometers per hour on an ordinary road. How many kilometers can it travel in 4 hours? A car traveling on a highway is twice as fast as a bus. How many kilometers can a car travel in the same time ?",
            "equation": "40*2*4",
            "ans": "320.0"
        },
        {
            "id": 268,
            "uid": "da4439e6ef6311ea92af3413e8a4c977",
            "zh_text": "爸爸带小明去滑雪，乘缆车上山用了4分钟，缆车每分钟行200米.滑雪下山用了20分钟，每分钟行70米.他们滑雪行了多少米?滑雪比乘缆车多行多少米?",
            "en_text": "Dad took Xiao Ming to ski. The cable car took 4 minutes to go up the mountain, and the cable car traveled 200 meters per minute. It took 20 minutes to ski down the mountain, and the line traveled 70 meters per minute. How many meters did they go skiing? How many meters more did they go skiing?",
            "equation": "20*70-4*200",
            "ans": "600.0"
        },
        {
            "id": 269,
            "uid": "da4439e7ef6311ea92af3413e8a4c977",
            "zh_text": "某县城到省城的高速公路长160千米，普通公路长200千米.一辆汽车走高速路的速度是80千米/时，走普通公路的速度是40千米/时.从县城去省城走高速路比普通公路节省多少时间?",
            "en_text": "The expressway from a county to the provincial capital is 160 kilometers long, and the ordinary road is 200 kilometers long. The speed of a car on the expressway is 80 kilometers/hour, and the speed of the ordinary road is 40 kilometers/hour. From the county seat How much time does the provincial city save on highways than ordinary highways?",
            "equation": "200/40-160/80",
            "ans": "3.0"
        },
        {
            "id": 270,
            "uid": "da4439e8ef6311ea92af3413e8a4c977",
            "zh_text": "从王村到李村一共设有16根高压电线杆，相邻两根间的平均距离是200米.王村到李村大约有多远?",
            "en_text": "There are a total of 16 high-voltage utility poles from Wangcun to Licun. The average distance between two adjacent ones is 200 meters. How far is Wangcun to Licun?",
            "equation": "(16-1)*200",
            "ans": "3000.0"
        },
        {
            "id": 271,
            "uid": "da4439e9ef6311ea92af3413e8a4c977",
            "zh_text": "哥哥上大学，要坐6.4小时的火车，火车的平均速度是70.5千米/时.他坐火车走了多少千米?",
            "en_text": "When my brother goes to university, he has to take a 6.4-hour train. The average speed of the train is 70.5 kilometers per hour. How many kilometers did he travel by train?",
            "equation": "70.5*6.4",
            "ans": "451.2000000000001"
        },
        {
            "id": 272,
            "uid": "da4439eaef6311ea92af3413e8a4c977",
            "zh_text": "要下雨了，小莉看见远处有闪电，4秒后听到了雷声，闪电的地方离小莉有多远?",
            "en_text": "It's going to rain. Xiaoli saw lightning in the distance. After 4 seconds, he heard thunder. How far is the lightning from Xiaoli?",
            "equation": "3*4",
            "ans": "12.0"
        },
        {
            "id": 273,
            "uid": "da4439ebef6311ea92af3413e8a4c977",
            "zh_text": "一次从地球上向月球发射激光信号，约经过2.56秒收到从月球反射回来的信号.已知光速是30万千米/秒，算一算这时月球到地球的距离是多少?",
            "en_text": "Once a laser signal was launched from the earth to the moon, it took about 2.56 seconds to receive the signal reflected from the moon. It is known that the speed of light is 300,000 kilometers per second. What is the distance between the moon and the earth at this time?",
            "equation": "30*2.56/2",
            "ans": "38.4"
        },
        {
            "id": 274,
            "uid": "da4439ecef6311ea92af3413e8a4c977",
            "zh_text": "双体日爸爸带小勇去登山.从山底到山顶全程有7.2千米，他们上山用了3小时，下山用了2小时.上山、下山的速度各是多少?",
            "en_text": "Catamaran's father took Xiaoyong to climb the mountain. It took 7.2 kilometers from the bottom to the top of the mountain. They took 3 hours to go up the mountain and 2 hours to go down the mountain. What was the speed of the uphill and downhill?",
            "equation": "7.2*2/(3+2)",
            "ans": "2.88"
        },
        {
            "id": 275,
            "uid": "da4439edef6311ea92af3413e8a4c977",
            "zh_text": "一支铺路队正在铺一段公路.上午工作3.5小时，铺了164.9米;下午工作4.5小时，铺了206.7米.上午铺路速度快还是下午铺路速度快?",
            "en_text": "A paving team is paving a section of road. It worked 3.5 hours in the morning and paved 164.9 meters; it worked 4.5 hours in the afternoon and paved 206.7 meters. Is the paving speed fast in the morning or the road in the afternoon?",
            "equation": "164.9/3.5-206.7/4.5",
            "ans": "1.180952380952384"
        },
        {
            "id": 276,
            "uid": "da4439eeef6311ea92af3413e8a4c977",
            "zh_text": "一列火车从南京到上海运行305千米，用了3.6小时，平均每小时行多少千米?(保留两位小数)",
            "en_text": "A train travels 305 kilometers from Nanjing to Shanghai. It takes 3.6 hours. How many kilometers does it travel per hour on average? (Keep two decimal places)",
            "equation": "305/3.6",
            "ans": "84.7222222222222"
        },
        {
            "id": 277,
            "uid": "da4439efef6311ea92af3413e8a4c977",
            "zh_text": "地球赤道周长约40076千米，一架飞机以990千米/时的速度沿着赤道飞行，它绕地球飞行一周需要多少小时?(用计算器计算，得数保留两位小数)",
            "en_text": "The circumference of the earth's equator is about 40,076 kilometers. An airplane flies along the equator at a speed of 990 kilometers per hour. How many hours does it take to orbit the earth? (Calculate with a calculator and keep the number to two decimal places)",
            "equation": "40076/990",
            "ans": "40.480808080808075"
        },
        {
            "id": 278,
            "uid": "da4439f0ef6311ea92af3413e8a4c977",
            "zh_text": "一条高速路长336千米.一辆客车3.2小时行完全程，一辆货车用3.8小时行完全程.客车的速度比货车的速度快多少?",
            "en_text": "A highway is 336 kilometers long. A passenger car takes 3.2 hours to complete the journey, and a truck takes 3.8 hours to complete the journey. How much faster is the speed of a passenger car than a truck?",
            "equation": "(1/3.2-1/3.8)/(1/3.8)",
            "ans": "0.18750000000000008"
        },
        {
            "id": 279,
            "uid": "da4439f1ef6311ea92af3413e8a4c977",
            "zh_text": "一条公路长360m，甲乙两支施工队同时从公路的两端往中间铺柏油.甲队的施工速度是乙队的1.25倍，4天后这条公路全部铺完.甲已两队每天分别铺柏油多少米?",
            "en_text": "A road is 360m long, and two construction teams from both ends of the road to the middle of the road at the same time. The construction speed of team A is 1.25 times that of team B. After 4 days, the road is completely paved. The two teams are paved every day. How many meters? Implied one",
            "equation": "360/4/(1+1.25)*1",
            "ans": "40.0"
        },
        {
            "id": 280,
            "uid": "da4439f2ef6311ea92af3413e8a4c977",
            "zh_text": "一个长方形花坛的长是5米，宽是3米.这个花坛的周长是多少米?",
            "en_text": "The length of a rectangular flowerbed is 5 meters and the width is 3 meters. What is the circumference of this flowerbed?",
            "equation": "(5+3)*2",
            "ans": "16.0"
        },
        {
            "id": 281,
            "uid": "da4439f3ef6311ea92af3413e8a4c977",
            "zh_text": "一块长方形菜地，长6米，宽3米.四周围上篱笆，篱笆的周长是多少米?如果一面靠墙，篱笆至少多少米?",
            "en_text": "A rectangular vegetable plot is 6 meters long and 3 meters wide. There are fences all around. What is the circumference of the fence? If one side is against the wall, how many meters is the fence at least?",
            "equation": "6+3*2",
            "ans": "12.0"
        },
        {
            "id": 282,
            "uid": "da4460b8ef6311ea92b93413e8a4c977",
            "zh_text": "用两个边长是6厘米，宽是3厘米的长方形分别拼成一个正方形和一个长方形.它们的周长分别是多少?",
            "en_text": "Use two rectangles with a side length of 6 cm and a width of 3 cm to form a square and a rectangle. What are their perimeters?",
            "equation": "(6+6+3)*2",
            "ans": "30.0"
        },
        {
            "id": 283,
            "uid": "da4460b9ef6311ea92b93413e8a4c977",
            "zh_text": "一根长60厘米的铁丝，做成了一个长16厘米，宽9厘米的长方形框架后，还剩多少厘米?",
            "en_text": "How many centimeters are left after a 60 cm long iron wire is made into a rectangular frame with a length of 16 cm and a width of 9 cm?",
            "equation": "60-(16+9)*2",
            "ans": "10.0"
        },
        {
            "id": 284,
            "uid": "da4460baef6311ea92b93413e8a4c977",
            "zh_text": "一块草地，宽8米，长比宽长3米，这个草地的周长是多少米?",
            "en_text": "A piece of grass is 8 meters wide and 3 meters longer than its width. What is the perimeter of the grass?",
            "equation": "(8+3+8)*2",
            "ans": "38.0"
        },
        {
            "id": 285,
            "uid": "da4460bbef6311ea92b93413e8a4c977",
            "zh_text": "一张长方形纸，长是24厘米，宽8厘米，在它上面剪去一个最大的正方形，这个正方形的周长是多少?剩下来图形的周长是多少厘米?",
            "en_text": "A piece of rectangular paper with a length of 24 cm and a width of 8 cm. Cut out the largest square on it. What is the circumference of this square? What is the circumference of the remaining figure?",
            "equation": "8*4",
            "ans": "32.0"
        },
        {
            "id": 286,
            "uid": "da4460bcef6311ea92b93413e8a4c977",
            "zh_text": "用一根长18厘米的铁丝围成一个长方形，围成的长方形的长和宽各是多少厘米?",
            "en_text": "Use an 18 cm long iron wire to form a rectangle. What are the length and width of the rectangle?",
            "equation": "18/2",
            "ans": "9.0"
        },
        {
            "id": 287,
            "uid": "da4460bdef6311ea92b93413e8a4c977",
            "zh_text": "用两个长6厘米，宽4厘米的长方形拼成一个大长方形，你有几种方法?大长方形的周长是多少?",
            "en_text": "Use two rectangles 6 cm long and 4 cm wide to form a large rectangle. How many ways do you have? What is the perimeter of the large rectangle?",
            "equation": "(6+6+4)*2",
            "ans": "32.0"
        },
        {
            "id": 288,
            "uid": "da4460beef6311ea92b93413e8a4c977",
            "zh_text": "王大妈家有一块靠墙的长方形菜地，长15米，宽8米，给这块菜地围上篱笆，至少需要多少长的篱笆?",
            "en_text": "Aunt Wang's house has a rectangular vegetable plot against the wall, 15 meters long and 8 meters wide. How long is the fence required to fence this vegetable plot?",
            "equation": "8*2+15",
            "ans": "31.0"
        },
        {
            "id": 289,
            "uid": "da4460bfef6311ea92b93413e8a4c977",
            "zh_text": "一张长方形的餐桌，桌面长14分米，宽9分米.要配上同样大小的玻璃，这块玻璃的面积应该是多少平方分米?玻璃四周镶上花边，花边长多少?",
            "en_text": "A rectangular dining table, the table top is 14 decimeters long and 9 decimeters wide. To be equipped with glass of the same size, what is the area of ​​this glass square decimeter? The glass is inlaid with lace and how long is the lace?",
            "equation": "(14+9)*2",
            "ans": "46.0"
        },
        {
            "id": 290,
            "uid": "da4460c0ef6311ea92b93413e8a4c977",
            "zh_text": "篮球场的长是28米，宽是15米.它的面积是多少平方米?半场是多少平方米?",
            "en_text": "The basketball court is 28 meters long and 15 meters wide. How many square meters is its area? How many square meters is the half court?",
            "equation": "28*15",
            "ans": "420.0"
        },
        {
            "id": 291,
            "uid": "da4460c1ef6311ea92b93413e8a4c977",
            "zh_text": "一面镜子长12分米、宽5分米.它的面积是多少平方分米?这种镜子的价格是每平方分米2元，买这面镜子需要多少元?",
            "en_text": "A mirror is 12 decimeters long and 5 decimeters wide. What is its area? The price of this mirror is 2 yuan per square decimeter. How much does it cost to buy this mirror?",
            "equation": "12*5*2",
            "ans": "120.0"
        },
        {
            "id": 292,
            "uid": "da4460c2ef6311ea92b93413e8a4c977",
            "zh_text": "一个长方形花坛，长50米、宽25米.求这个花坛的占地面积?(2)在花坛的四周围一圈栏杆，求围栏的长度?",
            "en_text": "A rectangular flowerbed is 50 meters long and 25 meters wide. What is the area of ​​the flowerbed? (2) A circle of railings around the flowerbed, what is the length of the fence?",
            "equation": "(50+25)*2",
            "ans": "150.0"
        },
        {
            "id": 293,
            "uid": "da4460c3ef6311ea92b93413e8a4c977",
            "zh_text": "在方格纸上，画出面积是16平方厘米的长方形，你能画出几个?算出它们的面积和周长?并说一说你发现的规律?",
            "en_text": "On graph paper, draw a rectangle with an area of ​​16 square centimeters. How many can you draw? Calculate their area and perimeter? Tell me about the law you found?",
            "equation": "4*3",
            "ans": "12.0"
        },
        {
            "id": 294,
            "uid": "da4460c4ef6311ea92b93413e8a4c977",
            "zh_text": "同学们出的墙报，长18分米、宽12分米.墙报的面积是多少平方分米?在墙报四周贴一条花边，花边的总长是多少分米?",
            "en_text": "The posters that the students produced are 18 decimetres long and 12 decimetres wide. What is the area of ​​the poster? Put a lace around the poster. What is the total length of the lace?",
            "equation": "(18+12)*2",
            "ans": "60.0"
        },
        {
            "id": 295,
            "uid": "da4460c5ef6311ea92b93413e8a4c977",
            "zh_text": "教室前面的墙壁长6米，宽3米.墙上有一块黑板，面积是3平方米.现在要粉刷这面墙壁，要粉刷的面积是多少平方米?",
            "en_text": "The wall in front of the classroom is 6 meters long and 3 meters wide. There is a blackboard on the wall with an area of ​​3 square meters. Now I want to paint this wall, what is the area to be painted?",
            "equation": "6*3-3",
            "ans": "15.0"
        },
        {
            "id": 296,
            "uid": "da4460c6ef6311ea92b93413e8a4c977",
            "zh_text": "一辆洒水车，每分钟行驶200米，洒水的宽度是8米.洒水车行驶6分钟，能给多大的地面洒上水?",
            "en_text": "A sprinkler can travel 200 meters per minute and the width of the sprinkler is 8 meters. How much ground can the sprinkler travel for 6 minutes?",
            "equation": "200*6*8",
            "ans": "9600.0"
        },
        {
            "id": 297,
            "uid": "da4460c7ef6311ea92b93413e8a4c977",
            "zh_text": "有两个一样大小的长方形，长都是36厘米，宽都是18厘米，(1)拼成一个正方形，它的周长是多少?(2)拼成一个长方形，它的周长是多少?拼成的两个图形，面积相等吗?是多少?",
            "en_text": "There are two rectangles of the same size, each 36 cm long and 18 cm wide.",
            "equation": "(36+18)*2",
            "ans": "108.0"
        },
        {
            "id": 299,
            "uid": "da4460c9ef6311ea92b93413e8a4c977",
            "zh_text": "一块长方形绿地的面积是560平方米，宽是8米，如果宽要增加到24米，长不变.扩大后的绿地面积是多少?",
            "en_text": "The area of ​​a rectangular green space is 560 square meters and the width is 8 meters. If the width is to be increased to 24 meters, the length remains unchanged. What is the area of ​​the expanded green space?",
            "equation": "560/8*24",
            "ans": "1680.0"
        },
        {
            "id": 300,
            "uid": "da4460caef6311ea92b93413e8a4c977",
            "zh_text": "小云家有一块长方形的菜地，面积是68.4平方米，它的宽是7.2，长是多少米?",
            "en_text": "Xiaoyun's family has a rectangular vegetable plot with an area of ​​68.4 square meters. Its width is 7.2 meters and its length is 7.2 meters.",
            "equation": "68.4/7.2",
            "ans": "9.5"
        },
        {
            "id": 301,
            "uid": "da4460cbef6311ea92b93413e8a4c977",
            "zh_text": "有一张长方形纸，长70厘米，宽50厘米.如果要剪成若干同样大小的正方形而没有剩余，的小正方形的边长最大是几厘米?",
            "en_text": "There is a rectangular piece of paper with a length of 70 cm and a width of 50 cm. If you want to cut into several squares of the same size without remaining, what is the maximum side length of the small square?",
            "equation": "2*5",
            "ans": "10.0"
        },
        {
            "id": 302,
            "uid": "da4460ccef6311ea92b93413e8a4c977",
            "zh_text": "一台压路机的前轴宽2m，直径1.2m，该压路机压路的面积是多少?",
            "en_text": "The front axle of a roller is 2m wide and 1.2m in diameter. What is the area of ​​the roller?",
            "equation": "3.14*1.2*2",
            "ans": "7.5360000000000005"
        },
        {
            "id": 303,
            "uid": "da4460cdef6311ea92b93413e8a4c977",
            "zh_text": "一块正方形手帕的边长是2分米，用90厘米长的绸带能围一圈吗?隐含正方形周长公式.",
            "en_text": "The side length of a square handkerchief is 2 decimeters. Can a 90 cm long ribbon make a circle? Implied square circumference formula",
            "equation": "2*4",
            "ans": "8.0"
        },
        {
            "id": 304,
            "uid": "da4460ceef6311ea92b93413e8a4c977",
            "zh_text": "用2个边长为1厘米的正方形拼成一个长方形.这个长方形的周长是多少?隐含周长公式.",
            "en_text": "Use 2 squares with sides of 1 cm to form a rectangle. What is the perimeter of this rectangle? Implied perimeter formula",
            "equation": "(1+1+1)*2",
            "ans": "6.0"
        },
        {
            "id": 305,
            "uid": "da4460cfef6311ea92b93413e8a4c977",
            "zh_text": "把一个边长12厘米的正方形剪成三个完全一样的小长方形，每个小长方形的周长是多少?",
            "en_text": "Cut a square with a side length of 12 cm into three identical small rectangles. What is the perimeter of each small rectangle?",
            "equation": "(12+12/3)*2",
            "ans": "32.0"
        },
        {
            "id": 306,
            "uid": "da4460d0ef6311ea92b93413e8a4c977",
            "zh_text": "用一根铁丝围了一个边长12厘米的正方形，如果把这根铁丝改围一个长方形，长是15厘米，宽是多少厘米?",
            "en_text": "Use an iron wire to enclose a square with a side length of 12 cm. If the iron wire is changed to a rectangle, the length is 15 cm and how many cm is the width?",
            "equation": "12*4/2-15",
            "ans": "9.0"
        },
        {
            "id": 307,
            "uid": "da4460d1ef6311ea92b93413e8a4c977",
            "zh_text": "李小林要从一个长10厘米，宽6厘米的长方形纸上剪下一个最大的正方形.剩下部分是什么图形?它的面积是多少平方厘米?",
            "en_text": "Li Xiaolin wants to cut out the largest square from a rectangular piece of paper 10 cm long and 6 cm wide. What is the rest of the figure? What is its area in square centimeters?",
            "equation": "6*(10-6)",
            "ans": "24.0"
        },
        {
            "id": 308,
            "uid": "da4460d2ef6311ea92b93413e8a4c977",
            "zh_text": "花园里有一个正方形的荷花池.它的周长是64米，面积是多少平方米?",
            "en_text": "There is a square lotus pond in the garden. Its circumference is 64 meters, and how many square meters is its area?",
            "equation": "64/4*64/4",
            "ans": "256.0"
        },
        {
            "id": 309,
            "uid": "da4460d3ef6311ea92b93413e8a4c977",
            "zh_text": "围棋盘的最外层每边能放19个棋子.最外层一共可以放多少棋子?",
            "en_text": "The outermost layer of the Go board can hold 19 pieces on each side. How many pieces can be placed on the outermost layer?",
            "equation": "19*4-4",
            "ans": "72.0"
        },
        {
            "id": 310,
            "uid": "da4487a8ef6311ea92c23413e8a4c977",
            "zh_text": "48名学生在操场上做游戏.大家围成一个正方形，每边人数相等.四个顶点都有人，每边各有几名学生?",
            "en_text": "48 students are playing games in the playground. Everyone forms a square with equal numbers on each side. There are people on the four vertices, and how many students are on each side?",
            "equation": "48/4+1",
            "ans": "13.0"
        },
        {
            "id": 311,
            "uid": "da4487a9ef6311ea92c23413e8a4c977",
            "zh_text": "为迎接六一儿童节，学校举行团体操表演.四年级学生排成方阵，最外层每边站了15个人，最外层一共有多少名学生?整个方阵一共有多少名学生?",
            "en_text": "In order to welcome the Children's Day, the school held a group gymnastics performance. The fourth grade students lined up in a square array. There were 15 people on each side of the outermost layer. How many students are there in the outermost layer? How many students are there in the entire square?",
            "equation": "15*4-4",
            "ans": "56.0"
        },
        {
            "id": 312,
            "uid": "da4487aaef6311ea92c23413e8a4c977",
            "zh_text": "学校楼前摆放了一个方阵花坛.这个花坛的最外层每边各摆放8盆花，最外层共摆了多少盆花?",
            "en_text": "A phalanx flowerbed is placed in front of the school building. The outermost layer of this flowerbed has 8 potted flowers on each side. How many potted flowers are placed on the outermost layer?",
            "equation": "8*4-4",
            "ans": "28.0"
        },
        {
            "id": 313,
            "uid": "da4487abef6311ea92c23413e8a4c977",
            "zh_text": "一块长方形铁皮，长30CM，宽25CM，从四个角各切掉一个边长为5CM的正方形，然后做成盒子，这个盒子用了多少铁皮?它的容积有多少?",
            "en_text": "A piece of rectangular iron sheet, 30cm long and 25cm wide, cut a square with a side length of 5cm from each of the four corners, and then make it into a box. How much iron sheet does this box use? What is its volume?",
            "equation": "(30-5-5)*(25-5-5)*5",
            "ans": "1500.0"
        },
        {
            "id": 314,
            "uid": "da4487acef6311ea92c23413e8a4c977",
            "zh_text": "副食店运来410千克鸡蛋，上午卖出152千克，下午卖出174千克，还剩多少千克?",
            "en_text": "The grocery store shipped 410 kilograms of eggs, sold 152 kilograms in the morning and 174 kilograms in the afternoon. How many kilograms are left?",
            "equation": "410-(152+174)",
            "ans": "84.0"
        },
        {
            "id": 315,
            "uid": "da4487adef6311ea92c23413e8a4c977",
            "zh_text": "科技园上午有游客852人，中午有265人离去.下午又来了403位游客，这时园内有多少游客?全天园内来了多少游客?",
            "en_text": "There were 852 tourists in the science park in the morning and 265 left at noon. In the afternoon there were 403 tourists. How many tourists were there at this time? How many tourists were there in the whole park?",
            "equation": "852-265+403",
            "ans": "990.0"
        },
        {
            "id": 316,
            "uid": "da4487aeef6311ea92c23413e8a4c977",
            "zh_text": "客轮上原有205人，有79人下船，有128人上船，再开船时客轮上有多少人?",
            "en_text": "There were originally 205 people on the passenger ship, 79 of them were disembarked, and 128 people were on the ship. How many people were on the passenger ship when it sailed again?",
            "equation": "205-79+128",
            "ans": "254.0"
        },
        {
            "id": 317,
            "uid": "da4487afef6311ea92c23413e8a4c977",
            "zh_text": "用900个鸡蛋孵小鸡，上午孵出了337只小鸡，下午比上午多孵出118只，还剩下多少个鸡蛋?",
            "en_text": "The chicks were hatched with 900 eggs. In the morning, 337 chicks were hatched. In the afternoon, 118 more were hatched than in the morning. How many eggs are left?",
            "equation": "900-(337+118+337)",
            "ans": "108.0"
        },
        {
            "id": 318,
            "uid": "da4487b0ef6311ea92c23413e8a4c977",
            "zh_text": "一本《自助旅游》书一共有234页.李叔叔昨天看了66页，今天又看了34页，还剩多少页没看?",
            "en_text": "There are 234 pages in a book called \"Self-Travelling\". Uncle Li read 66 pages yesterday and 34 pages today. How many pages are left?",
            "equation": "234-(66+34)",
            "ans": "134.0"
        },
        {
            "id": 319,
            "uid": "da4487b1ef6311ea92c23413e8a4c977",
            "zh_text": "学校买了68只皮球，借出13只.把剩下的皮球平均借给5个班级，每个班级能借到多少只?",
            "en_text": "The school bought 68 balls and lent out 13. The remaining balls are lent to 5 classes on average. How many can each class borrow?",
            "equation": "(68-13)/5",
            "ans": "11.0"
        },
        {
            "id": 320,
            "uid": "da4487b2ef6311ea92c23413e8a4c977",
            "zh_text": "学校买了58本故事书，26本科技书，平均放在3层书架上.每层书架放了多少本书?",
            "en_text": "The school bought 58 story books and 26 technology books, which are placed on an average of 3 shelves. How many books are there on each shelf?",
            "equation": "(58+26)/3",
            "ans": "28.0"
        },
        {
            "id": 321,
            "uid": "da4487b3ef6311ea92c23413e8a4c977",
            "zh_text": "学校准备发练习本给15个班，每班144本，全校还需要留40本作为备用.学校应该买多少本练习本?",
            "en_text": "The school is going to distribute exercise books to 15 classes, each with 144 books, and the school needs to keep 40 as spares. How many exercise books should the school buy?",
            "equation": "144*15+40",
            "ans": "2200.0"
        },
        {
            "id": 322,
            "uid": "da4487b4ef6311ea92c23413e8a4c977",
            "zh_text": "滑冰场上午有72人，中午有44人离去，又有85人到来.现在有多少人在滑冰?",
            "en_text": "There were 72 people at the skating rink in the morning, 44 people left at noon, and 85 people arrived. How many people are skating now?",
            "equation": "72-44+85",
            "ans": "113.0"
        },
        {
            "id": 323,
            "uid": "da4487b5ef6311ea92c23413e8a4c977",
            "zh_text": "图书室有故事书98本，今天借出46本，换回25本.现在图书室有故事书多少本?",
            "en_text": "There are 98 story books in the library, 46 of them were borrowed today, and 25 were returned. How many story books are there now in the library?",
            "equation": "98-46+25",
            "ans": "77.0"
        },
        {
            "id": 324,
            "uid": "da4487b6ef6311ea92c23413e8a4c977",
            "zh_text": "王老师要批改48篇作文，已经批改了12篇.如果每小时批改9篇，剩下的还要几小时能批改完?",
            "en_text": "Teacher Wang wants to correct 48 essays, and 12 of them have already been corrected. If 9 articles are corrected every hour, how many hours can I finish marking the rest?",
            "equation": "(48-12)/9",
            "ans": "4.0"
        },
        {
            "id": 325,
            "uid": "da4487b7ef6311ea92c23413e8a4c977",
            "zh_text": "王鹏家今年第一季度共交了水费138元.三月份交水费48元.前两月交了多少钱?王鹏家平均每月交了多少钱?",
            "en_text": "In the first quarter of this year, Wang Peng's family paid a total of 138 yuan in water bills. In March, they paid 48 yuan in water bills. How much did they pay in the first two months? How much did Wang Peng's family pay each month?",
            "equation": "138-48/3",
            "ans": "122.0"
        },
        {
            "id": 326,
            "uid": "da4487b8ef6311ea92c23413e8a4c977",
            "zh_text": "向阳乡人大选举，共计有效票325张.其中，赞成276票，反对24票，弃权多少票?",
            "en_text": "In the Xiangyang Township People's Congress election, there were a total of 325 valid votes. Among them, there were 276 votes in favor, 24 votes against, and how many abstentions?",
            "equation": "325-276-24",
            "ans": "25.0"
        },
        {
            "id": 327,
            "uid": "da4487b9ef6311ea92c23413e8a4c977",
            "zh_text": "地球表面积是5.1亿平方千米，其中陆地面积是1.49亿平方千米.海洋面积比陆地面积多多少亿平方千米?",
            "en_text": "The surface area of ​​the earth is 510 million square kilometers, of which the land area is 149 million square kilometers. How many billion square kilometers is the ocean area than the land area?",
            "equation": "5.1-1.49-1.49",
            "ans": "2.119999999999999"
        },
        {
            "id": 328,
            "uid": "da4487baef6311ea92c23413e8a4c977",
            "zh_text": "春天到了，农民伯伯给果树浇水.第一天上午浇了所有果树的1/4，下午浇了3/8，第二天上午浇了3/10，一共浇了多少?还有多少没浇?",
            "en_text": "When spring came, the farmer uncle watered the fruit trees. The first morning I watered 0.25 times of all the fruit trees, 0.375 times in the afternoon, and 0.3 times the next morning. How much was watered in total? How much was left?",
            "equation": "1-(10/40+15/40)",
            "ans": "0.375"
        },
        {
            "id": 329,
            "uid": "da4487bbef6311ea92c23413e8a4c977",
            "zh_text": "妈妈买了一些毛线，给爸爸织毛衣用了7/10，给红红织手套用了1/20，还剩多少毛线?",
            "en_text": "Mom bought some wool, used 0.7 times for dad knitting sweaters, and 0.05 times for red knitting gloves. How much wool is left?",
            "equation": "1-7/10-1/20",
            "ans": "0.2500000000000001"
        },
        {
            "id": 330,
            "uid": "da4487bcef6311ea92c23413e8a4c977",
            "zh_text": "(2)班学生去参观，共用去10小时.路上用去的时间占1/5，吃午饭与休息时间共占3/10，剩下的是游览的时间，游览时间占几分之几?",
            "en_text": "(2) The students in the class go to visit and share 10 hours. The time spent on the road accounts for 0.2 times, and the lunch and break time account for 0.3 times. The rest is the time for the tour. What percentage of the tour time?",
            "equation": "1-1/5-3/10",
            "ans": "0.5"
        },
        {
            "id": 331,
            "uid": "da4487bdef6311ea92c23413e8a4c977",
            "zh_text": "五(3)班有25人，许多同学参加了课外小组.参加音乐组的有12人，参加美术组的有10人，两个组都没参加的有6人.既参加音乐又参加美术的有多少人?",
            "en_text": "There are 25 students in class 5 (3) and many students participated in extracurricular groups. 12 people participated in the music group, 10 people participated in the art group, and 6 people did not participate in either group. Both music and art how many people?",
            "equation": "12+10-(25-6)",
            "ans": "3.0"
        },
        {
            "id": 332,
            "uid": "da4487beef6311ea92c23413e8a4c977",
            "zh_text": "中国煤炭资源的种类较多，其中烟煤占3/4，无烟煤占3/25，还有一种是褐煤，褐煤占煤炭总量的多少?",
            "en_text": "There are many types of coal resources in China, among which bituminous coal accounts for 0.75 times, anthracite accounts for 0.12 times, and the other is lignite. How much does lignite account for the total coal?",
            "equation": "1-3/4-3/25",
            "ans": "0.13"
        },
        {
            "id": 333,
            "uid": "da4487bfef6311ea92c23413e8a4c977",
            "zh_text": "噪音对人的健康有害，绿化造林可降低噪音，噪音现在是80分贝，绿化造林可降低噪音的1/8，人现在听到的声音是多少分贝?",
            "en_text": "Noise is harmful to human health. Greening afforestation can reduce noise. The noise is now 80 decibels. Greening afforestation can reduce the noise by 0.125 times. How many decibels do people hear now?",
            "equation": "80*1/8",
            "ans": "10.0"
        },
        {
            "id": 334,
            "uid": "da4487c0ef6311ea92c23413e8a4c977",
            "zh_text": "为举行校庆，六二班要做180面小旗，已经做了5/6，还有多少面没做?",
            "en_text": "In order to hold the school celebration, there are 180 small flags to be made in the sixth class, which has been 0.8333333333333334 times, and how many sides have not been done?",
            "equation": "180*(1-5/6)",
            "ans": "29.999999999999996"
        },
        {
            "id": 335,
            "uid": "da4487c1ef6311ea92c23413e8a4c977",
            "zh_text": "1999年世界人口达60亿，预计2013年将增加1/6.2013年世界人口将达多少亿?",
            "en_text": "The world population reached 6 billion in 1999 and is expected to increase by 0.16125651073162078 times in 2013. How many billions will the world population reach?",
            "equation": "60*(1+1/6)",
            "ans": "70.0"
        },
        {
            "id": 336,
            "uid": "da4487c2ef6311ea92c23413e8a4c977",
            "zh_text": "严重的水土流失致使每年大约有16亿吨的泥沙流入黄河，其中1/4的泥沙沉积在河道中，其余被带到入海口.有多少亿吨泥沙被带到入海口?",
            "en_text": "Severe soil erosion has caused about 1.6 billion tons of sediment to flow into the Yellow River every year, of which 0.25 times the sediment is deposited in the river, and the rest is brought to the sea. How many billion tons of sediment are brought to the sea?",
            "equation": "16-16*1/4",
            "ans": "12.0"
        },
        {
            "id": 337,
            "uid": "da44ae98ef6311ea92cc3413e8a4c977",
            "zh_text": "小红用长8m的彩带做了一些花，每朵花用2/3m的彩带.她把其中的4朵送给了同学，小红还剩几朵花?",
            "en_text": "Xiao Hong made some flowers with ribbons that were 8 meters long. Each flower used a ribbon that was 0.6666666666666666 times the m. She gave 4 of them to classmates. How many flowers are there for Xiao Hong?",
            "equation": "8/(2/3)-4",
            "ans": "8.0"
        },
        {
            "id": 338,
            "uid": "da44ae99ef6311ea92cc3413e8a4c977",
            "zh_text": "根据测定，成人体内的水分约占体重的2/3，而儿童体内的水分约占体重的4/5.小明体内有28kg的水分，可是小明的体重才是爸爸的7/15.小明的体重是多少千克?小明的爸爸体重是多少千克?",
            "en_text": "According to the measurement, the water in adults accounts for about 0.6666666666666666 times of body weight, while the water in children accounts for about 0.8 times of body weight. Xiao Ming has 28 kg of water in his body, but Xiao Ming's weight is 0.4666666666666667 times his father's. How many kilograms is Xiao Ming's weight? How many kilograms does his father weigh?",
            "equation": "28/(7/15)",
            "ans": "60.0"
        },
        {
            "id": 339,
            "uid": "da44ae9aef6311ea92cc3413e8a4c977",
            "zh_text": "一杯约250ml的鲜牛奶大约含有3/10g的钙质，占一个成年人一天所需钙质的3/8.成年人一天大约需要多少钙质?",
            "en_text": "A cup of about 250ml of fresh milk contains about 0.3 times g of calcium, which accounts for 0.375 times the calcium required by an adult in a day. How much calcium does an adult need in a day?",
            "equation": "3/10/(3/8)",
            "ans": "0.7999999999999999"
        },
        {
            "id": 340,
            "uid": "da44ae9bef6311ea92cc3413e8a4c977",
            "zh_text": "某电视机厂去年上半年生产电视机48万台，是下半年产量的4/5.这个电视机厂去年全年的产量是多少万台?",
            "en_text": "A certain TV factory produced 480,000 TV sets in the first half of last year, which was 0.8 times the output of the second half of the year.",
            "equation": "48/(4/(4+5))",
            "ans": "108.0"
        },
        {
            "id": 341,
            "uid": "da44ae9cef6311ea92cc3413e8a4c977",
            "zh_text": "这批大米是运往灾区的，运了4车才运走2/5，平均每车运走这批大米的几分之几?剩下的大米还要几车才能运完?",
            "en_text": "This batch of rice was transported to the disaster area. It took 4 vehicles to transport 0.4 times. On average, what fraction of this batch of rice was transported by each vehicle? How many vehicles are needed to transport the remaining rice?",
            "equation": "(1-2/5)/(2/5/4)",
            "ans": "5.999999999999999"
        },
        {
            "id": 342,
            "uid": "da44ae9def6311ea92cc3413e8a4c977",
            "zh_text": "某妇产医院上月新生婴儿303名，男女婴儿人数之比是52:50.上月新生男女婴儿各有多少人?",
            "en_text": "A maternity hospital had 303 newborn babies last month, and the ratio of male to female babies was 52:50. How many male and female babies were born in the last month?",
            "equation": "303*50/(50+52)",
            "ans": "148.52941176470586"
        },
        {
            "id": 343,
            "uid": "da44ae9eef6311ea92cc3413e8a4c977",
            "zh_text": "学校把栽70棵树的任务，按照六年级三个班的人数分配给各班，一班有46个人，二班有44个人，三班有50人.三个班应各栽多少棵?",
            "en_text": "The school assigns the task of planting 70 trees to each class in accordance with the number of people in the three classes in the sixth grade. Class 1 has 46 people, Class 2 has 44 people, and Class 3 has 50 people. How many trees should be planted in each of the three classes?",
            "equation": "70/(46+44+50)",
            "ans": "0.5"
        },
        {
            "id": 344,
            "uid": "da44ae9fef6311ea92cc3413e8a4c977",
            "zh_text": "空气中氧气和氮气的体积比是21:78，660立方米空气中有氧气和氮气各多少立方米?",
            "en_text": "The volume ratio of oxygen and nitrogen in the air is 21:78,660 cubic meters. How many cubic meters of oxygen and nitrogen are in the air?",
            "equation": "660*78/(21+78)",
            "ans": "520.0"
        },
        {
            "id": 345,
            "uid": "da44aea0ef6311ea92cc3413e8a4c977",
            "zh_text": "可以用1份蜂蜜和9份水来冲兑蜂蜜水.这个杯子的容积正好是200毫升，要冲兑一满杯这样的蜂蜜水，需要峰蜜和水各多少毫升?",
            "en_text": "You can use 1 part of honey and 9 parts of water to make honey water. The volume of this cup is exactly 200 milliliters. To make a full cup of such honey water, how many milliliters of peak honey and water are needed?",
            "equation": "200/(1+9)",
            "ans": "20.0"
        },
        {
            "id": 346,
            "uid": "da44aea1ef6311ea92cc3413e8a4c977",
            "zh_text": "每个橡皮艇上有1名救生员和7名游客.加上救生员，我们一共有56人，一共有多少名游客?多少名救生员?",
            "en_text": "There are 1 lifeguard and 7 tourists on each inflatable boat. With lifeguards, we have 56 people in total, how many tourists are there in total? How many lifeguards?",
            "equation": "56-(1+7)",
            "ans": "48.0"
        },
        {
            "id": 347,
            "uid": "da44aea2ef6311ea92cc3413e8a4c977",
            "zh_text": "水泥，沙子和石子的比是2:3:5，要搅拌20吨这样的混凝土，需要水泥，沙子和石子各是多少吨?",
            "en_text": "The ratio of cement, sand and stone is 2:3:5. To mix 20 tons of such concrete, how many tons of cement, sand and stone are needed?",
            "equation": "20/(2+3)*5",
            "ans": "20.0"
        },
        {
            "id": 348,
            "uid": "da44aea3ef6311ea92cc3413e8a4c977",
            "zh_text": "家里的菜地共800m2，我准备用2/5种西红柿，剩下的按2:1的面积比种黄瓜和茄子.三种蔬菜的面积分别是多少m2?",
            "en_text": "The vegetable plot at home is 800 square meters. I plan to use 0.4 times the tomatoes to grow the cucumbers and eggplants at a 2:1 area ratio. What is the area of ​​the three vegetables?",
            "equation": "(800-800*2/5)/(2+1)*2",
            "ans": "320.0"
        },
        {
            "id": 349,
            "uid": "da44aea4ef6311ea92cc3413e8a4c977",
            "zh_text": "我已经打了1600个字，正好打了全文的40%，(1)全文共有多少个字?(2)还有多少字没有打?",
            "en_text": "I have typed 1,600 words, which is exactly 0.4 times the full text. (1) How many words are there in the full text? (2) How many words are left?",
            "equation": "1600/(40/100)",
            "ans": "4000.0"
        },
        {
            "id": 350,
            "uid": "da44aea5ef6311ea92cc3413e8a4c977",
            "zh_text": "百花胡同小学有480人，只有5%的学生没有参加意外事故保险，参加保险的学生有多少人?",
            "en_text": "There are 480 people in Baihua Hutong Primary School, and only 0.05 times the students are not covered by accident insurance. How many students are covered?",
            "equation": "480*(1-5/100)",
            "ans": "456.0"
        },
        {
            "id": 351,
            "uid": "da44aea6ef6311ea92cc3413e8a4c977",
            "zh_text": "2002年，中国科学院，中国工程院共有院士1263人，其中男院士有1185人.女院士占院士人数的百分之几?",
            "en_text": "In 2002, the Chinese Academy of Sciences and the Chinese Academy of Engineering had a total of 1,263 academicians, including 1,185 male academicians. What percentage of the number of female academicians accounted for?",
            "equation": "(1263-1185)/1263",
            "ans": "0.061757719714964375"
        },
        {
            "id": 352,
            "uid": "da44aea7ef6311ea92cc3413e8a4c977",
            "zh_text": "小明统计了自己的储蓄罐里有125个硬币，其中一元的硬币占44%，五角的硬币占20%，一角的硬币占36%.储蓄罐里共有多少钱?",
            "en_text": "Xiao Ming calculated that there are 125 coins in his piggy bank, of which one yuan coins account for 0.44 times, five-cent coins account for 0.2 times, and one-cent coins account for 0.36 times. How much money is in the piggy bank?",
            "equation": "125*44/100*1+125*20/100*0.5+125*36/100*0.1",
            "ans": "72.0"
        },
        {
            "id": 353,
            "uid": "da44aea8ef6311ea92cc3413e8a4c977",
            "zh_text": "新星小学环保卫士小分队12人参加植树活动.男同学每人栽了3棵树，女同学每人栽了2棵树，一共栽了32棵树，男女同学各有几人?",
            "en_text": "Twelve members of the environmental protection guard team of Xinxing Primary School participated in the tree planting activity. The male students planted 3 trees each, and the female students planted 2 trees each. A total of 32 trees were planted. How many male and female students are there?",
            "equation": "12-(12*3-32/(3-2))",
            "ans": "8.0"
        },
        {
            "id": 354,
            "uid": "da44aea9ef6311ea92cc3413e8a4c977",
            "zh_text": "学校举行团体操表演，如果每列25人，要排24列.如果每列20人，要排多少列?",
            "en_text": "The school holds group gymnastics performances. If there are 25 people in each column, 24 columns are required. If there are 20 people in each column, how many columns are required?",
            "equation": "25*24/20",
            "ans": "30.0"
        },
        {
            "id": 355,
            "uid": "da44aeaaef6311ea92cc3413e8a4c977",
            "zh_text": "六年级办公室买进一包白纸，计划每天用20张，可以用28天.由于注意了节约用纸，实际每天只用了16张，实际比计划多用了多少天?",
            "en_text": "The sixth grade office bought a pack of white paper, and planned to use 20 sheets a day, which can be used for 28 days. Because of the attention to saving paper, only 16 sheets were actually used every day. How many days more than planned?",
            "equation": "20*28/16-28",
            "ans": "7.0"
        },
        {
            "id": 356,
            "uid": "da44aeabef6311ea92cc3413e8a4c977",
            "zh_text": "一个旅游风景点去年全年接待游客约196万人，上半年接待游客数是全年的3/7.第三季度接待游客数是上半年的3/4.第三季度接待游客多少人?",
            "en_text": "A tourist scenic spot received about 1.96 million tourists last year. The number of tourists in the first half of the year was 0.42857142857142855 times that of the whole year. The number of tourists in the third quarter was 0.75 times that of the first half of the year. How many tourists were received in the third quarter?",
            "equation": "196*3/7*3/4",
            "ans": "63.0"
        },
        {
            "id": 357,
            "uid": "da44aeacef6311ea92cc3413e8a4c977",
            "zh_text": "阳阳正在读一本科普书，第一周读了90页，还剩下这本书的1/3没读.这本科普书一共多少页?",
            "en_text": "Yang Yang is reading a general undergraduate book. In the first week, he read 90 pages, and 0.3333333333333333 times the book is left. How many pages are there in this general undergraduate book?",
            "equation": "90/(1-1/3)",
            "ans": "134.99999999999997"
        },
        {
            "id": 358,
            "uid": "da44aeadef6311ea92cc3413e8a4c977",
            "zh_text": "水是由氢和氧按1:8的质量比化合而成的.5.4kg的水含氢和氧各多少?",
            "en_text": "Water is formed by the combination of hydrogen and oxygen in a mass ratio of 1:8. How much hydrogen and oxygen does 5.4kg of water contain?",
            "equation": "1/8*4",
            "ans": "0.5"
        },
        {
            "id": 359,
            "uid": "da44aeaeef6311ea92cc3413e8a4c977",
            "zh_text": "一套运动服135元，一双运动鞋48元，妈妈给了售货员200元，应找回多少元?",
            "en_text": "A set of sportswear is 135 yuan, and a pair of sports shoes is 48 yuan. Mom gave the salesperson 200 yuan. How much should I get back?",
            "equation": "200-(135+48)",
            "ans": "17.0"
        },
        {
            "id": 360,
            "uid": "da44aeafef6311ea92cc3413e8a4c977",
            "zh_text": "王老师买了4只小皮球，付出100元，营业员找回16元.每只小皮球多少元?",
            "en_text": "Teacher Wang bought 4 small balls, paid 100 yuan, and the salesperson got back 16 yuan. How much is each small ball?",
            "equation": "(100-16)/4",
            "ans": "21.0"
        },
        {
            "id": 361,
            "uid": "da44aeb0ef6311ea92cc3413e8a4c977",
            "zh_text": "4棵杨树苗48元，3棵松树苗63元.哪种树苗每棵的价钱贵一些?",
            "en_text": "4 poplar saplings are 48 yuan, and 3 pine saplings are 63 yuan. Which kind of sapling is more expensive?",
            "equation": "63/3-48/4",
            "ans": "9.0"
        },
        {
            "id": 362,
            "uid": "da44aeb1ef6311ea92cc3413e8a4c977",
            "zh_text": "黄老师买3个小足球，付了100元.营业员找回7元.每个小足球多少元?",
            "en_text": "Teacher Huang bought 3 small footballs and paid 100 yuan. The salesperson retrieved 7 yuan. How much is each small football?",
            "equation": "(100-7)/3",
            "ans": "31.0"
        },
        {
            "id": 363,
            "uid": "da44aeb2ef6311ea92cc3413e8a4c977",
            "zh_text": "一副乒乓球拍26元，一个乒乓球2元.用50元钱买一副乒乓球拍，剩下的钱还能买几个乒乓球?",
            "en_text": "A pair of table tennis rackets is 26 yuan, a table tennis racket is 2 yuan. Use 50 yuan to buy a pair of table tennis rackets, how many table tennis balls can I buy with the remaining money?",
            "equation": "(50-26)/2",
            "ans": "12.0"
        },
        {
            "id": 364,
            "uid": "da44d59cef6311ea92cc3413e8a4c977",
            "zh_text": "儿童百科:每套125元数学猜想:每套18元学校要为图书馆增添两种新书，每种3套.一共要花多少钱?",
            "en_text": "Children's Encyclopedia: 125 yuan per set. Mathematical conjecture: 18 yuan per set. The school needs to add two new books to the library, three sets of each. How much does it cost?",
            "equation": "125*3+18*3",
            "ans": "429.0"
        },
        {
            "id": 365,
            "uid": "da44d59def6311ea92d63413e8a4c977",
            "zh_text": "苹果5元:3千克香蕉10元:2千克妈妈打算买6千克苹果和4千克香蕉，应付多少钱?",
            "en_text": "Apple 5 yuan: 3 kilograms of bananas 10 yuan: 2 kilograms. Mom plans to buy 6 kilograms of apples and 4 kilograms of bananas.",
            "equation": "6/3*5+4/2*10",
            "ans": "30.0"
        },
        {
            "id": 366,
            "uid": "da44d59eef6311ea92d63413e8a4c977",
            "zh_text": "T恤29元∕件49元∕两件我有185元，最多可以买多少件?还剩多少件?",
            "en_text": "T-shirt 29 yuan / 49 yuan / two pieces I have 185 yuan, how many pieces can I buy at most? How many pieces are left?",
            "equation": "185/(49/2)",
            "ans": "7.551020408163265"
        },
        {
            "id": 367,
            "uid": "da44d59fef6311ea92d63413e8a4c977",
            "zh_text": "刘叔叔带700元买化肥.买了16袋化肥，剩下60元.每袋化肥的价钱是多少元?",
            "en_text": "Uncle Liu brought 700 yuan to buy fertilizer. He bought 16 bags of fertilizer, and the remaining 60 yuan. What is the price of each bag of fertilizer?",
            "equation": "(700-60)/16",
            "ans": "40.0"
        },
        {
            "id": 368,
            "uid": "da44d5a0ef6311ea92d63413e8a4c977",
            "zh_text": "星期天，爸爸妈妈带着玲玲去“冰雪天地游玩.成人票24元，儿童价半票，购买门票需要花多少钱?买3张成人票，付100元，应找回多少钱?",
            "en_text": "On Sunday, Mom and Dad took Lingling to the ice and snow world. Adult tickets are 24 yuan, and children are half-price tickets. How much does it cost to buy tickets? Buy 3 adult tickets and pay 100 yuan. How much should I get back?",
            "equation": "100-(24*2+24/2)*3",
            "ans": "-80.0"
        },
        {
            "id": 369,
            "uid": "da44d5a1ef6311ea92d63413e8a4c977",
            "zh_text": "星期天，6名学生去参观卡通画展览，共付门票费30元，每人乘车用2元.平均每人花了多少钱?",
            "en_text": "On Sunday, 6 students went to visit the cartoon exhibition, and paid a total of 30 yuan for the entrance fee, and 2 yuan per person for the car. How much did it cost per person on average?",
            "equation": "(2*6+30)/6",
            "ans": "7.0"
        },
        {
            "id": 370,
            "uid": "da44d5a2ef6311ea92d63413e8a4c977",
            "zh_text": "芳芳原来有11.42元，昨天用了7.5元买了一枝钢笔，今天妈妈又给我0.35元.现在有多少钱?",
            "en_text": "Fangfang originally had 11.42 yuan. Yesterday he bought a pen with 7.5 yuan. Today my mother gave me another 0.35 yuan. How much money do I have now?",
            "equation": "11.42-7.5+0.35",
            "ans": "4.27"
        },
        {
            "id": 371,
            "uid": "da44d5a3ef6311ea92d63413e8a4c977",
            "zh_text": "孙老师要用80元买一些文具作为年级运动会的奖品.他先花45.6元买了8本相册，并准备用剩下的钱买一些钢笔，每枝钢笔2.5元.孙老师还可以买几枝钢笔?",
            "en_text": "Teacher Sun wants to spend 80 yuan to buy some stationery as prizes for the grade sports meeting. He first bought 8 photo albums for 45.6 yuan, and plans to use the remaining money to buy some pens, 2.5 yuan per pen. Teacher Sun can also buy a few pen?",
            "equation": "(80-45.6)/2.5",
            "ans": "13.76"
        },
        {
            "id": 372,
            "uid": "da44d5a4ef6311ea92d63413e8a4c977",
            "zh_text": "林华的妈妈去市场买水果.她先花3.5元买了2.5kg苹果，还准备买3kg橙子，橙子的单价是苹果的1.6倍.买橙子应付多少钱呢?",
            "en_text": "Lin Hua's mother went to the market to buy fruit. She first bought 2.5kg of apples for 3.5 yuan, and then planned to buy 3kg of oranges. The unit price of oranges is 1.6 times that of apples. How much does it cost to buy oranges?",
            "equation": "3.5/2.5*1.6*3",
            "ans": "6.719999999999999"
        },
        {
            "id": 373,
            "uid": "da44d5a5ef6311ea92d63413e8a4c977",
            "zh_text": "一个玩具厂做一个毛绒兔原来需要3.8元的材料.后来改进了制作方法，每个只需3.6元的材料.原来准备做180个毛绒兔的材料，现在可以做多少个?",
            "en_text": "A toy factory originally needed 3.8 yuan of materials to make a plush rabbit. Later, the production method was improved, and each only costs 3.6 yuan. The original plan was to make 180 stuffed rabbits. How many materials can you make now?",
            "equation": "3.8*180/3.6",
            "ans": "190.0"
        },
        {
            "id": 374,
            "uid": "da44d5a6ef6311ea92d63413e8a4c977",
            "zh_text": "李阿姨去超市买洗洁精.小瓶的4元/瓶，大瓶的6元/瓶.如果都买小瓶的，还剩2元;如果都买大瓶的，也剩2元.李阿姨至少带了多少钱?",
            "en_text": "Aunt Li went to the supermarket to buy detergent. The small bottle was 4 yuan/bottle, the large bottle was 6 yuan/bottle. If you bought both small bottles, there was 2 yuan left; if you bought both large bottles, there was 2 yuan left. Aunt Li brought at least how much is it?",
            "equation": "2*2*3+2",
            "ans": "14.0"
        },
        {
            "id": 375,
            "uid": "da44d5a7ef6311ea92d63413e8a4c977",
            "zh_text": "六年级举行拔河比赛，每班各派6名男生和6名女生参加.一班和二班的学生总数分别是42人，40人.(1)一班和二班参加拔河比赛的人数分别占本班学生总数的百分之几?(2)参加拔河比赛的人数占六年级一二班学生总素的百分之几?",
            "en_text": "A tug-of-war competition is held in the sixth grade, and each class sends 6 boys and 6 girls to participate. The total number of students in Class 1 and Class 2 is 42 and 40 respectively. (1) The number of students in Class 1 and Class 2 who participated in the tug-of-war competition respectively accounted for What percentage of the total number of students in this class? (2) What percentage of the total number of students participating in the tug-of-war competition in the first and second grades of the sixth grade?",
            "equation": "(42+40)/(42+40)",
            "ans": "1.0"
        },
        {
            "id": 376,
            "uid": "da44d5a8ef6311ea92d63413e8a4c977",
            "zh_text": "六年级有学生100人，达到国家体育锻炼标准的有96人，达标率为(%)，未达标的人数占六年级总人数的(%).",
            "en_text": "There are 100 students in the sixth grade, and 96 people meet the national physical exercise standards.The compliance rate is (%), and the number of students who do not meet the standard accounts for (%) of the total number of sixth graders.",
            "equation": "(100-96)/100*100/100",
            "ans": "0.04"
        },
        {
            "id": 377,
            "uid": "da44d5a9ef6311ea92d63413e8a4c977",
            "zh_text": "人体大约每天需要摄入2500毫升的水分，其中从食物中获得的约为1200毫升，饮水获得的约为1300毫升.(1)从食物中获得的水分占每日摄水量的百分之几?(2)饮水获得的占百分之几?",
            "en_text": "The human body needs to consume about 2500 ml of water per day, of which about 1200 ml is obtained from food and about 1300 ml is obtained from drinking water. (1) What percentage of the daily water intake is the water obtained from food? (2) What percentage do you get from drinking water?",
            "equation": "1300/2500",
            "ans": "0.52"
        },
        {
            "id": 378,
            "uid": "da44d5aaef6311ea92d63413e8a4c977",
            "zh_text": "小飞家原来每月用水约10吨，更换了节水龙头后每月用水约9吨，每月用水比原来节约了百分之几?",
            "en_text": "Xiaofei's house used to use about 10 tons of water per month. After replacing the water-saving faucet, it uses about 9 tons of water per month. What percentage of the monthly water consumption is saved than before?",
            "equation": "(10-9)/10",
            "ans": "0.1"
        },
        {
            "id": 379,
            "uid": "da44d5abef6311ea92d63413e8a4c977",
            "zh_text": "我国著名的淡水湖洞庭湖，因水土流失引起泥沙沉等原因，面积已由原来的大约4350平方千米缩小为2700平方千米，洞庭湖的面积减少了百分之几?",
            "en_text": "The area of ​​Dongting Lake, a famous freshwater lake in my country, has been reduced from about 4,350 square kilometers to 2,700 square kilometers due to soil erosion caused by sedimentation and other reasons. What percentage of the area of ​​Dongting Lake has been reduced?",
            "equation": "(4350-2700)/4350",
            "ans": "0.3793103448275862"
        },
        {
            "id": 380,
            "uid": "da44d5acef6311ea92d63413e8a4c977",
            "zh_text": "合唱团共有60人，分三个声部，高声部有30人，中声部18人，低声部12人.高声部的人数比中声部、低声部的人数分别多百分之几?",
            "en_text": "There are 60 people in the choir, divided into three parts, 30 people in the high part, 18 people in the middle part, and 12 people in the low part. The number of people in the high part is 100% more than the people in the middle part and the low part. How many?",
            "equation": "(30-12)/18",
            "ans": "1.0"
        },
        {
            "id": 382,
            "uid": "da44d5aeef6311ea92d63413e8a4c977",
            "zh_text": "为了缓解交通拥挤的状况，某市正在进行道路拓宽.团结路的路宽由原来的12米增加到25米，拓宽了百分之几?",
            "en_text": "In order to alleviate the traffic congestion, a city is expanding its roads. The road width of Tuanjie Road has been increased from the original 12 meters to 25 meters, by what percentage?",
            "equation": "(25-12)/12",
            "ans": "1.0833333333333333"
        },
        {
            "id": 383,
            "uid": "da44d5afef6311ea92d63413e8a4c977",
            "zh_text": "养鸡场用2400个鸡蛋孵小鸡，有5%没有孵出来，孵出来的小鸡有多少只?",
            "en_text": "(2) The chicken farm used 2400 eggs to incubate the chicks, and there were 0.05 times that did not hatch, and there were () chicks that were hatched.",
            "equation": "2400*(1-5/100)",
            "ans": "2280.0"
        },
        {
            "id": 384,
            "uid": "da44d5b0ef6311ea92d63413e8a4c977",
            "zh_text": "新城市中小学校开展回收废纸活动，共回收废纸87.5吨，用废纸生产再生纸的再生率为80%，这些回收的废纸能生产多少吨再生纸?",
            "en_text": "Primary and secondary schools in Xincheng carried out waste paper recycling activities. A total of 87.5 tons of waste paper were recycled. The recycling rate of using waste paper to produce recycled paper was 0.8 times. How many tons of recycled paper can be produced from this recycled waste paper?",
            "equation": "87.5*80/100",
            "ans": "70.0"
        },
        {
            "id": 385,
            "uid": "da44d5b1ef6311ea92d63413e8a4c977",
            "zh_text": "咱们给奶奶寄2000元，请交1%的汇率，汇率是多少元?",
            "en_text": "Let's send 2,000 yuan to grandma. Please pay 0.01 times the exchange rate. What is the exchange rate?",
            "equation": "2000*1/100",
            "ans": "20.0"
        },
        {
            "id": 386,
            "uid": "da44d5b2ef6311ea92d63413e8a4c977",
            "zh_text": "李老师为某杂志审稿，审稿费为200元，为此她需要按3%的税率缴纳个人所得税，她应缴个人所得税多少元?",
            "en_text": "Teacher Li is reviewing a manuscript for a magazine. The review fee is 200 yuan. For this reason, she needs to pay personal income tax at a tax rate of 0.03 times. How much personal income tax should she pay?",
            "equation": "200*3/100",
            "ans": "6.0"
        },
        {
            "id": 387,
            "uid": "da44d5b3ef6311ea92d63413e8a4c977",
            "zh_text": "爸爸妈妈给贝贝存了2万元教育存款，存期为三年，年利率为5.4%，到期一次支取，支取时凭非义务教育的学生身份证明，可以免征储蓄存款利息所得税.(1)贝贝到期可以拿到多少钱?(2)如果是普通三年期存款，应缴纳利息税多少元?",
            "en_text": "Mom and Dad deposited an education deposit of 20,000 yuan for Beibei. The deposit period is three years, and the annual interest rate is 0.054000000000000006 times.It is withdrawn once at maturity. When withdrawing, with the student's identity certificate for non-compulsory education, the savings deposit interest income tax can be exempted. 1) How much money can Beibei get at maturity? (2) If it is an ordinary three-year deposit, how much interest tax should be paid?",
            "equation": "20000*5.4/100*3",
            "ans": "3240.0"
        },
        {
            "id": 388,
            "uid": "da44d5b4ef6311ea92d63413e8a4c977",
            "zh_text": "李叔叔从自己的经营所得款中拿出1万元存入银行，每年把税后利息捐给希望工程支援贫困的失学儿童，如果请你为他设计储蓄方式，你怎样做?为什么?",
            "en_text": "Uncle Li took 10,000 yuan from his own business income and deposited it in the bank. Every year he donates the after-tax interest to the Hope Project to support poor children who are out of school. If you ask you to design a savings method for him, what do you do? Why?",
            "equation": "10000*1-10000*1*10000/1",
            "ans": "-99990000.0"
        },
        {
            "id": 389,
            "uid": "da44d5b5ef6311ea92d63413e8a4c977",
            "zh_text": "小兰家买了一套普通住房，房子的总价为8万元，如果一次付清房款，就有九六折的优惠价，(1)打完折后，房子的总价是多少?(2)买房还要缴纳实际房价1.5%的契税，契税多少钱?",
            "en_text": "Xiaolan's family bought an ordinary house. The total price of the house is 80,000 yuan. If the house payment is paid in one lump sum, there will be a 9-60% discount. (1) After the discount, what is the total price of the house? (2) Buying a house also pays a deed tax of 0.015 times the actual price. How much is the deed tax?",
            "equation": "8*10000*96/100*1.5/100",
            "ans": "1152.0"
        },
        {
            "id": 390,
            "uid": "da44fc86ef6311ea92e03413e8a4c977",
            "zh_text": "张奶奶把儿子寄来的1500元钱存入银行，存期为2年，年利率为4.68%.(1)到期支取时，张奶奶要缴纳多少元的利息税?(2)最后张奶奶能拿到多少钱?",
            "en_text": "Grandma Zhang deposited the 1,500 yuan sent by her son in the bank with a deposit period of 2 years and an annual interest rate of 0.046799999999999994 times. (1) How much interest tax should Grandma Zhang pay when the withdrawal is due? (2) Finally, Grandma Zhang How much can I get?",
            "equation": "1500+1500*4.68/100*2*(1-5/100)",
            "ans": "1633.38"
        },
        {
            "id": 391,
            "uid": "da44fc87ef6311ea92e03413e8a4c977",
            "zh_text": "王叔叔2007年买了3000元国债，定期三年，三年国债的年利率为5.74%(1)由于买国债可以免交5%的利息税，王叔叔可以免交利息税多少元?(2)到期时，王叔叔可以取回多少钱?",
            "en_text": "Uncle Wang bought 3,000 yuan of national debt in 2007, and it is fixed for three years. The annual interest rate of the three-year national debt is 0.0574 times (1) Since the purchase of national debt can be exempted from paying 0.05 times interest tax, how much is uncle Wang exempt from paying interest tax? (2) ) How much money can Uncle Wang get back when it expires?",
            "equation": "3000+3000*5.74/100*3*(1-5/100)",
            "ans": "3490.77"
        },
        {
            "id": 392,
            "uid": "da44fc88ef6311ea92e03413e8a4c977",
            "zh_text": "一种树苗实验成活率是98%，为了保证成活380棵，至少要种多少棵树苗?",
            "en_text": "The experimental survival rate of a kind of sapling is 0.98 times. In order to ensure the survival of 380 saplings, how many saplings must be planted at least?",
            "equation": "380/(98/100)",
            "ans": "387.7551020408163"
        },
        {
            "id": 393,
            "uid": "da44fc89ef6311ea92e03413e8a4c977",
            "zh_text": "为迎接“五一”劳动节，工人叔叔要在俱乐部的四周装上彩灯(地面的四边不装).已知俱乐部的长90米，宽55米，高20米，工人叔叔至少需要多长的彩灯线?",
            "en_text": "In order to welcome the May 1st Labor Day, the uncle workers must install colored lights around the club (the four sides of the ground are not installed). It is known that the club is 90 meters long, 55 meters wide, and 20 meters high. At least how long the uncle worker needs to be Light wire?",
            "equation": "(90+55)*2+20*4",
            "ans": "370.0"
        },
        {
            "id": 394,
            "uid": "da44fc8aef6311ea92e03413e8a4c977",
            "zh_text": "小卖部要做一个长2.2m，宽40cm，高80cm的玻璃柜台，现要在柜台各边都安上角铁，这个柜台需要多少米角铁?",
            "en_text": "The commissary will make a glass counter with a length of 2.2m, a width of 40cm, and a height of 80cm. Now you need to install angle irons on each side of the counter. How many meters of angle iron does this counter need?",
            "equation": "(2.2*100+40+80)*4/100",
            "ans": "13.6"
        },
        {
            "id": 395,
            "uid": "da44fc8bef6311ea92e03413e8a4c977",
            "zh_text": "光华街口装了一个新的铁皮邮箱，长50cm，宽40cm，高78cm.做这个邮箱至少需要多少平方厘米的铁皮?",
            "en_text": "A new metal mailbox is installed at the entrance of Guanghua Street, 50cm long, 40cm wide, and 78cm high. How many square centimeters of iron is required to make this mailbox?",
            "equation": "(50*40+50*78+40*78)*2",
            "ans": "18040.0"
        },
        {
            "id": 396,
            "uid": "da44fc8cef6311ea92e03413e8a4c977",
            "zh_text": "个长方体的饼干盒，长10cm，宽6cm，高12cm.如果围着它贴一圈商标纸(上下面不贴)，这张商标纸的面积至少要多少平方厘米?",
            "en_text": "A rectangular biscuit box with a length of 10cm, a width of 6cm, and a height of 12cm. If you stick a circle of label paper around it (not on the top and bottom), how many square centimeters should the label paper be?",
            "equation": "(10*12+6*12)*2",
            "ans": "384.0"
        },
        {
            "id": 397,
            "uid": "da44fc8def6311ea92e03413e8a4c977",
            "zh_text": "加工厂要加工一批洗衣机的机套(没有底面)，每台洗衣机的长59.5cm、宽42.5cm、高80cm，做1000个机套至少用布多少平方米?",
            "en_text": "The processing plant needs to process a batch of washing machine covers (without bottom surface). Each washing machine is 59.5cm in length, 42.5cm in width and 80cm in height. How many square meters of cloth is required to make 1000 covers?",
            "equation": "((59.5+42.5)*2*80/100+(59.5+42.5)*2*80/100)*1000",
            "ans": "326400.0"
        },
        {
            "id": 398,
            "uid": "da44fc8eef6311ea92e03413e8a4c977",
            "zh_text": "健身中心新建一个游泳池，该游泳池的长50m，是宽的2倍，深2.5m.现要在池的四周和底面都贴上瓷砖，共需要贴多少平方米的瓷砖?",
            "en_text": "A new swimming pool is built in the fitness center. The length of the swimming pool is 50m, which is twice the width and 2.5m deep. Now we are going to put tiles on the surrounding and bottom of the pool. How many square meters of tiles are needed?",
            "equation": "50*50/2+50*2.5*2+50/2*2.5*2",
            "ans": "1625.0"
        },
        {
            "id": 399,
            "uid": "da44fc8fef6311ea92e03413e8a4c977",
            "zh_text": "学校要粉刷新教室.已知教室的长是8m，宽是6m，高是3m，扣除门窗的面积是11.4m2.如果每平方米需要花4元涂料费，粉刷这个教室需要花费多少元?",
            "en_text": "The school wants to refresh the classroom. Knowing that the length of the classroom is 8m, the width is 6m, and the height is 3m, the area deducting the doors and windows is 11.4m2. If you need to spend 4 yuan for paint per square meter, how much does it cost to paint the classroom?",
            "equation": "(8*6+(8*3+6*3)*2-11.4)*4",
            "ans": "482.4"
        },
        {
            "id": 400,
            "uid": "da44fc90ef6311ea92e03413e8a4c977",
            "zh_text": "颁奖台是由3个长方体合并而成的，它的前后两面涂上黄色油漆，其他露出来的面涂红色油漆.涂黄油漆和红油漆的面积各是多少?",
            "en_text": "The podium is made up of three cuboids. Its front and back sides are painted with yellow paint, and the other exposed surfaces are painted with red paint. What is the area covered with yellow paint and red paint?",
            "equation": "2*3+1*3",
            "ans": "9.0"
        },
        {
            "id": 401,
            "uid": "da44fc91ef6311ea92e03413e8a4c977",
            "zh_text": "建筑工地要挖一个长50m，宽30m，深50cm的长方体土坑，挖出多少方的土?",
            "en_text": "To dig a rectangular pit with a length of 50m, a width of 30m, and a depth of 50cm on a construction site, how much soil should be dug?",
            "equation": "50*30*50",
            "ans": "75000.0"
        },
        {
            "id": 402,
            "uid": "da44fc92ef6311ea92e03413e8a4c977",
            "zh_text": "妈妈送给奶奶的生日蛋糕长2dm，宽2dm，高0.6dm，奶奶把它平均分成4块长方体形状的小蛋糕，想一想怎样分，每个人分到多大一块蛋糕?",
            "en_text": "The birthday cake that mom gave to grandma was 2dm long, 2dm wide, and 0.6dm high. Grandma divided it into 4 cuboid-shaped small cakes. Think about how to divide it. How big is the cake for each person?",
            "equation": "2*2*0.6/4",
            "ans": "0.6"
        },
        {
            "id": 403,
            "uid": "da44fc93ef6311ea92e03413e8a4c977",
            "zh_text": "家具厂订购500根方木，每根方木横截面的面积是24dm2，长是3m.这些木料一共是多少方?",
            "en_text": "The furniture factory ordered 500 square woods, each of which has a cross-sectional area of ​​24dm2 and a length of 3m. How many squares of these woods are in total?",
            "equation": "0.24*3*500",
            "ans": "360.0"
        },
        {
            "id": 404,
            "uid": "da44fc94ef6311ea92e03413e8a4c977",
            "zh_text": "“六一”儿童节，全市的小学生用棱长3cm的正方体塑料拼插积木在广场中央搭起了一面长6m，高2.7m，厚6cm的奥运心愿墙，算一算这面墙共用了多少块积木?",
            "en_text": "On Children's Day, the city's primary school students used 3cm-long cube plastic building blocks to build a 6m long, 2.7m high, and 6cm thick Olympic Wish Wall in the center of the square. Calculate how many building blocks the wall shared. ?",
            "equation": "6*100*2.7*100*6/(3*3*3)",
            "ans": "36000.0"
        },
        {
            "id": 405,
            "uid": "da44fc95ef6311ea92e03413e8a4c977",
            "zh_text": "花园小区为居民新安装了50个休息的凳子，凳面的长宽高分别是104cm，44cm，4.6cm.凳腿的长宽高分别是44cm，4.6cm，35cm，这些凳子共用混凝土多少方?",
            "en_text": "The garden community has installed 50 new resting stools for residents. The length, width and height of the stool surface are 104cm, 44cm, and 4.6cm. The length and width of the stool legs are 44cm, 4.6cm, and 35cm. How much concrete does these stools share?",
            "equation": "(104*44+44*4.6+4.6*35)/100/50",
            "ans": "0.98788"
        },
        {
            "id": 406,
            "uid": "da44fc96ef6311ea92e03413e8a4c977",
            "zh_text": "公园南面要修一道长15m，厚24cm，高3m的围墙.如果每立方米用砖525块，这道围墙一共用砖多少块?",
            "en_text": "To the south of the park, build a 15m long, 24cm thick, and 3m high wall. If 525 bricks are used per cubic meter, how many bricks does this wall share?",
            "equation": "15*24/100*3*525",
            "ans": "5670.0"
        },
        {
            "id": 407,
            "uid": "da44fc97ef6311ea92e03413e8a4c977",
            "zh_text": "一个长方体和一个正方体的棱长总和相等，已知长方体的长宽高分别是6dm，5dm，4dm，那么正方体的棱长是多少分米?它们的体积相等吗?",
            "en_text": "The sum of the edge lengths of a cuboid and a cube is equal. It is known that the length, width and height of the cuboid are 6dm, 5dm, and 4dm respectively. Then what is the edge length of the cube in decimeters? Are their volumes equal?",
            "equation": "(6+5+4)*4/12",
            "ans": "5.0"
        },
        {
            "id": 408,
            "uid": "da44fc98ef6311ea92e03413e8a4c977",
            "zh_text": "某邮政运货车，车厢是长方体.从里面量长3m，宽2.5m，高2m.它的容积是多少立方米?",
            "en_text": "A postal freight truck has a cuboid. From the inside, it measures 3m long, 2.5m wide, and 2m high. What is its volume?",
            "equation": "3*2.5*2",
            "ans": "15.0"
        },
        {
            "id": 409,
            "uid": "da44fc99ef6311ea92e03413e8a4c977",
            "zh_text": "一个长方体冰柜，从里面量长87.5cm，宽50cm，深56cm，它的容积是多少升?",
            "en_text": "A cuboid freezer measures 87.5cm long, 50cm wide, and 56cm deep from the inside. What is its volume in liters?",
            "equation": "87.5*50*56/1000",
            "ans": "245.0"
        },
        {
            "id": 410,
            "uid": "da44fc9aef6311ea92e03413e8a4c977",
            "zh_text": "一个长方体玻璃容器，从里面量长宽均为2dm，向容器中倒入5L水，再把一个土豆放入水中.这时量得容器内的水深是13cm.这个土豆的体积是多少?",
            "en_text": "A rectangular glass container, measuring 2dm in length and width from the inside, pour 5L of water into the container, and put a potato into the water. At this time, the water depth in the container is measured to be 13cm. What is the volume of this potato?",
            "equation": "2*2*13/10-5",
            "ans": "0.20000000000000015"
        },
        {
            "id": 411,
            "uid": "da44fc9bef6311ea92e03413e8a4c977",
            "zh_text": "一种微波炉，产品说明书上标明:炉腔内部尺寸400×225×300(单位:mm)这个微波炉的容积是多少升?",
            "en_text": "A kind of microwave oven, the product manual indicates: The internal size of the cavity is 400×225×300 (unit: mm) What is the volume of this microwave oven?",
            "equation": "400/100*225/100*300/100",
            "ans": "27.0"
        },
        {
            "id": 412,
            "uid": "da44fc9cef6311ea92e03413e8a4c977",
            "zh_text": "哈尔滨冰雪大世界每年用的冰大约能融化成8万立方米的水，它们相当于多少个长50m，宽25m，深1.2m的游泳池的储水量?",
            "en_text": "The ice used in Harbin Ice and Snow World can melt into about 80,000 cubic meters of water every year. How many swimming pools with a length of 50m, a width of 25m, and a depth of 1.2m are equivalent to the water storage?",
            "equation": "8*10000/(50*25*1.2)",
            "ans": "53.33333333333334"
        },
        {
            "id": 413,
            "uid": "da44fc9def6311ea92e03413e8a4c977",
            "zh_text": "新疆吐鲁番晾制葡萄干的土坯房，其中一间的底面积是18.6m2，高是2.1m.它的容积是多少?",
            "en_text": "The adobe houses where raisins are dried in Turpan, Xinjiang. One of them has a bottom area of ​​18.6m2 and a height of 2.1m. What is its volume?",
            "equation": "18.6*2.1",
            "ans": "39.06"
        },
        {
            "id": 414,
            "uid": "da44fc9eef6311ea92e03413e8a4c977",
            "zh_text": "一节火车厢，从里面量，长13m，宽2.7m，装的煤高1.5m，平均每立方米煤重1.33吨，这节车厢的煤重多少吨?",
            "en_text": "A train carriage, measured from the inside, is 13m long, 2.7m wide, and the loaded coal is 1.5m high. The average coal weight per cubic meter is 1.33 tons. How many tons of coal does this carriage weigh?",
            "equation": "13*2.7*1.5*1.33",
            "ans": "70.02450000000002"
        },
        {
            "id": 415,
            "uid": "da45238cef6311ea92e03413e8a4c977",
            "zh_text": "某海岛战士为解决岛上淡水缺乏问题，和当地居民共同修建一个长22m，宽10m，深1.8m的淡水蓄水池，这个蓄水池最多可蓄水多少立方米?",
            "en_text": "In order to solve the problem of the lack of fresh water on the island, a fighter on the island built a 22m long, 10m wide and 1.8m deep freshwater reservoir together with local residents. How many cubic meters of water can this reservoir hold?",
            "equation": "22*10*1.8",
            "ans": "396.0"
        },
        {
            "id": 416,
            "uid": "da45238def6311ea92ea3413e8a4c977",
            "zh_text": "乒乓球台的长度为2740mm，宽度为1525mm，台面厚度为25mm，它的表面喷上了漆，喷漆的面积是多少平方米?",
            "en_text": "The length of the ping pong table is 2740mm, the width is 1525mm, and the thickness of the table is 25mm. Its surface is sprayed with paint. What is the area of ​​spray paint?",
            "equation": "(2740*1525+2740*25*2+1525*25*2)/1000000",
            "ans": "4.39175"
        },
        {
            "id": 417,
            "uid": "da45238eef6311ea92ea3413e8a4c977",
            "zh_text": "一个长方体鱼塘长8m，宽4.5m，深2m.这个鱼塘的容积大约是多少立方米?",
            "en_text": "A rectangular fish pond is 8m long, 4.5m wide, and 2m deep. What is the approximate volume of this fish pond?",
            "equation": "8*4.5*2",
            "ans": "72.0"
        },
        {
            "id": 418,
            "uid": "da45238fef6311ea92ea3413e8a4c977",
            "zh_text": "新建的篮球馆要铺设3cm厚的木质地板，已知该馆的长36m，宽20m，铺设它至少要用多少方的木材?",
            "en_text": "The newly built basketball hall needs to be laid with a 3cm thick wooden floor. It is known that the hall is 36m long and 20m wide. At least how much wood should be used to lay it?",
            "equation": "36*20*3/100",
            "ans": "21.6"
        },
        {
            "id": 419,
            "uid": "da452390ef6311ea92ea3413e8a4c977",
            "zh_text": "一个3m3的花坛，种4种花，每种花平均占地多少平方米?5种呢?",
            "en_text": "A 3m3 flowerbed with 4 kinds of flowers, how many square meters does each kind of flower occupy on average? How about 5 kinds?",
            "equation": "3.3*4/5",
            "ans": "2.64"
        },
        {
            "id": 420,
            "uid": "da452391ef6311ea92ea3413e8a4c977",
            "zh_text": "一只长方体的玻璃缸，长8DM、宽6DM，高4DM，水深2.8DM.如果投入一块棱长为4DM的正方体铁块，缸里的水溢出多少升?",
            "en_text": "A cuboid glass cylinder is 8DM in length, 6DM in width, 4DM in height, and 2.8DM in water depth. If a cube iron block with edge length of 4DM is put in, how many liters of water overflows in the tank?",
            "equation": "4*4*4+8*6*2.8-8*6*4",
            "ans": "6.399999999999977"
        },
        {
            "id": 421,
            "uid": "da452392ef6311ea92ea3413e8a4c977",
            "zh_text": "用120厘米的铁丝做一个长方体的框架.长，宽，高的比是3:2:1，这个长方体的长宽高分别是多少?",
            "en_text": "Use 120 cm of iron wire to make a cuboid frame. The ratio of length, width, and height is 3:2:1. What is the length, width and height of this cuboid?",
            "equation": "120/4*3/(3+2+1)",
            "ans": "15.0"
        },
        {
            "id": 422,
            "uid": "da452393ef6311ea92ea3413e8a4c977",
            "zh_text": "学校会议室用方砖铺地.用8dm*的方砖铺，需要350块;如果改成10dm2的方砖铺，需要多少块?",
            "en_text": "The school meeting room uses square bricks to pave the floor. If you use 8dm* square bricks, you need 350 pieces; if you change to 10dm2 square bricks, how many pieces are needed?",
            "equation": "8*350/10",
            "ans": "280.0"
        },
        {
            "id": 423,
            "uid": "da452394ef6311ea92ea3413e8a4c977",
            "zh_text": "用一根长24dm的铁丝做一个长方体框架，使它的长、宽、高的比是5:4:3.在这个长方体框架外面糊一层纸，至少需要多少平方米的纸?它的体积是多少立方分米?",
            "en_text": "Use a 24dm iron wire to make a rectangular parallelepiped frame so that the ratio of its length, width, and height is 5:4:3. To paste a layer of paper on the outside of the rectangular parallelepiped frame, how many square meters of paper is required at least? Its volume How many cubic decimeters are it?",
            "equation": "24/4*5/(5+4+3)*24/4*4/(5+4+3)*24/4*3/(5+4+3)/100",
            "ans": "0.075"
        },
        {
            "id": 424,
            "uid": "da452395ef6311ea92ea3413e8a4c977",
            "zh_text": "中队委员把一个棱长46cm的正方体纸箱的各面都贴上红纸，将它做为给希望小学募捐的“爱心箱”，他们至少需要多少平方厘米的红纸?",
            "en_text": "Squadron members put red paper on each side of a 46cm cube carton box, and used it as a donation box for Hope Primary School. How many square centimeters of red paper do they need at least?",
            "equation": "46*46*6",
            "ans": "12696.0"
        },
        {
            "id": 425,
            "uid": "da452396ef6311ea92ea3413e8a4c977",
            "zh_text": "一块棱长30cm的正方体冰块，它的体积是多少立方厘米?",
            "en_text": "What is the volume of a cube of ice with a side of 30cm?",
            "equation": "30*30*30",
            "ans": "27000.0"
        },
        {
            "id": 426,
            "uid": "da452397ef6311ea92ea3413e8a4c977",
            "zh_text": "有块正方体的木料，它的棱长是4dm.把这块木料加工成一个最大的圆柱.这个圆柱的体积是多少?",
            "en_text": "There is a cube of wood, and its edge length is 4dm. Process this wood into the largest cylinder. What is the volume of this cylinder?",
            "equation": "3.14*(4/2)**2*4",
            "ans": "50.24"
        },
        {
            "id": 427,
            "uid": "da452398ef6311ea92ea3413e8a4c977",
            "zh_text": "用体积是1cm*的小正方体木块，堆成一个体积是1m3的大正方体，需要多少个正方体木块?如果把这些小正方体木块一个挨一个的排成一行，长多少千米?",
            "en_text": "Using small cubes with a volume of 1cm*, pile up a large cube with a volume of 1m3, how many cubes are needed? If these small cubes are lined up one by one, how many kilometers are they long?",
            "equation": "1*1000000/1/1000",
            "ans": "1000.0"
        },
        {
            "id": 428,
            "uid": "da452399ef6311ea92ea3413e8a4c977",
            "zh_text": "把一个棱长6cm的正方体切成棱长2cm的小正方体.可以得到多少个小正方体?表面积增加了多少?",
            "en_text": "Cut a cube with a side length of 6cm into a small cube with a side length of 2cm. How many small cubes can be obtained? How much surface area has been increased?",
            "equation": "2*2*6*6*6/(2*2*2)-6*6*6/(2*2*2)",
            "ans": "81.0"
        },
        {
            "id": 429,
            "uid": "da45239aef6311ea92ea3413e8a4c977",
            "zh_text": "把一个棱长10cm的正方体铁块熔铸成一个底面直径是20cm的圆锥形铁块.这个圆锥形铁块的高约是多少?(得数保留整厘米)",
            "en_text": "A cube iron block with an edge length of 10cm is fused into a conical iron block with a bottom diameter of 20cm. What is the height of this conical iron block? (Reserve the whole centimeter.)",
            "equation": "10*10*10*3/(3.14*(20/2)**2)",
            "ans": "9.554140127388537"
        },
        {
            "id": 430,
            "uid": "da45239bef6311ea92ea3413e8a4c977",
            "zh_text": "一个圆形喷水池的半径是5米，它的周长是多少米?",
            "en_text": "The radius of a circular fountain is 5 meters, how many meters is its circumference?",
            "equation": "3.14*2*5",
            "ans": "31.4"
        },
        {
            "id": 431,
            "uid": "da45239cef6311ea92ea3413e8a4c977",
            "zh_text": "在一个圆形亭子里，小丽走完它的直径需用12步，每步长大约是55厘米.这个圆形亭子的周长大约是多少?",
            "en_text": "In a circular pavilion, Xiaoli needs 12 steps to complete its diameter, and each step is about 55 cm long. What is the circumference of this circular pavilion?",
            "equation": "3.14*35*12/100",
            "ans": "13.188000000000002"
        },
        {
            "id": 432,
            "uid": "da45239def6311ea92ea3413e8a4c977",
            "zh_text": "小红量的一个古代建筑中的大红圆柱的周长是3.77米，这个圆柱的直径是多少米?90、小东有一辆自行车，车轮的直径大约是66厘米，如果平均每分钟转100周，从家到学校的路程是2000米，大约需要多少分钟?",
            "en_text": "The circumference of the big red column in an ancient building in Xiaohongliang is 3.77 meters. What is the diameter of this column? 90. Xiaodong has a bicycle, and the diameter of the wheel is about 66 cm. If it turns 100 times per minute on average, The distance from home to school is 2000 meters. How many minutes does it take?",
            "equation": "2000/(3.77/3.14*100)",
            "ans": "16.657824933687007"
        },
        {
            "id": 433,
            "uid": "da45239eef6311ea92ea3413e8a4c977",
            "zh_text": "一只挂钟的分针长20厘米，经过30分钟后，分针的尖端所走的路程是是多少厘米?经过45分钟吗?",
            "en_text": "The minute hand of a wall clock is 20 centimeters long. After 30 minutes, how many centimeters does the tip of the minute hand travel? Will it take 45 minutes?",
            "equation": "45",
            "ans": "45.0"
        },
        {
            "id": 434,
            "uid": "da45239fef6311ea92ea3413e8a4c977",
            "zh_text": "一个圆形牛栏的半径是15米，要用多长的粗铁丝才能把牛栏围上三圈?如果每隔2米装上一根木桩，大约要多少根木桩?",
            "en_text": "The radius of a circular bullpen is 15 meters. How long does it take to enclose the bullpen in three circles? If a wooden stake is installed every 2 meters, how many stakes are required?",
            "equation": "3.14*15*2*3/2",
            "ans": "141.3"
        },
        {
            "id": 435,
            "uid": "da4523a0ef6311ea92ea3413e8a4c977",
            "zh_text": "在一个周长为100厘米的正方形纸片内，要剪一个最大的圆，这个圆的半径是多少厘米?",
            "en_text": "In a square piece of paper with a circumference of 100 cm, to cut a largest circle, what is the radius of the circle?",
            "equation": "100/4/2",
            "ans": "12.5"
        },
        {
            "id": 436,
            "uid": "da4523a1ef6311ea92ea3413e8a4c977",
            "zh_text": "杂技演员表演独轮车走钢丝，车轮的直径为40厘米，要骑过50米长的钢丝，车轮大约转动多少周?",
            "en_text": "The acrobat performs a tightrope walk on a unicycle. The diameter of the wheel is 40 cm. It has to ride a 50-meter-long steel wire.",
            "equation": "50/(3.14*40/100)",
            "ans": "39.808917197452224"
        },
        {
            "id": 437,
            "uid": "da4523a2ef6311ea92ea3413e8a4c977",
            "zh_text": "一个圆形茶几桌面的直径是1米，它的面积是多少平方厘米?",
            "en_text": "The diameter of the table top of a round coffee table is 1 meter. What is its area?",
            "equation": "3.14*1/2**2*10000",
            "ans": "7850.0"
        },
        {
            "id": 438,
            "uid": "da4523a3ef6311ea92ea3413e8a4c977",
            "zh_text": "一个圆形环岛的直径是50米，中间是一个直径为10米的圆形花坛，其他地方时草坪，草坪的占地面积是多少?",
            "en_text": "The diameter of a circular island is 50 meters, and in the middle is a circular flower bed with a diameter of 10 meters. In other places, what is the area of ​​lawn and lawn?",
            "equation": "3.14*((50/2)**2-(10/2)**2)",
            "ans": "1884.0"
        },
        {
            "id": 439,
            "uid": "da4523a4ef6311ea92ea3413e8a4c977",
            "zh_text": "公园草地上一个自动旋转喷灌装置的射程是10米，它能喷灌的面积是多少?",
            "en_text": "The range of an automatic rotating sprinkler irrigation device on the grass in the park is 10 meters. What is the area that it can sprinkle?",
            "equation": "3.14*10**2",
            "ans": "314.0"
        },
        {
            "id": 440,
            "uid": "da4523a5ef6311ea92ea3413e8a4c977",
            "zh_text": "小刚量的一棵树干的周长是125.6厘米，这棵树的横截面的面积是多少?",
            "en_text": "The circumference of a small tree trunk is 125.6 cm. What is the cross-sectional area of ​​this tree?",
            "equation": "3.14*(125.6/2/3.14)**2",
            "ans": "1256.0"
        },
        {
            "id": 441,
            "uid": "da4523a6ef6311ea92ea3413e8a4c977",
            "zh_text": "右面圆的半径是5厘米，把它平均分成4份，其中一份的面积是多少?3份的面积是多少?",
            "en_text": "The radius of the circle on the right is 5 cm. Divide it into 4 equal parts. What is the area of ​​one part? What is the area of ​​3 parts?",
            "equation": "3.14*5**2",
            "ans": "78.5"
        },
        {
            "id": 442,
            "uid": "da4523a7ef6311ea92ea3413e8a4c977",
            "zh_text": "有一根绳子长31.4米，小东和小林分别想用这根绳子在操场上围出一块地，怎样面积最大?",
            "en_text": "There is a rope that is 31.4 meters long. Xiaodong and Xiaolin each want to use this rope to enclose a piece of land on the playground. How is the largest area?",
            "equation": "3.14*(31.4/2/3.14)**2",
            "ans": "78.5"
        },
        {
            "id": 443,
            "uid": "da454a74ef6311ea92f43413e8a4c977",
            "zh_text": "一个圆形餐桌面的直径是2米，如果一个人需要0.5米宽的位置就餐，这桌餐桌大约能坐多少人?",
            "en_text": "The diameter of a round dining table is 2 meters. What is its circumference in meters? What is its area? If a person needs a 0.5-meter-wide position to eat, how many people can sit on this table?",
            "equation": "3.14*(2/2)**2/0.5",
            "ans": "6.28"
        },
        {
            "id": 444,
            "uid": "da454a75ef6311ea92f43413e8a4c977",
            "zh_text": "一种汽车的方向盘的直径是40厘米，它的周长是多少?隐含求圆周长公式常识.",
            "en_text": "The diameter of a steering wheel of a car is 40 cm. What is its circumference? Common sense of the formula for finding the circumference is implicit",
            "equation": "3.14*40",
            "ans": "125.6"
        },
        {
            "id": 445,
            "uid": "da454a76ef6311ea92f43413e8a4c977",
            "zh_text": "用一根长126厘米的铁条焊接成一个圆形铁环，它的半径大约是多少厘米?",
            "en_text": "A 126 cm long iron bar is welded to form a circular iron ring. What is its radius?",
            "equation": "126/3.14/2",
            "ans": "20.063694267515928"
        },
        {
            "id": 446,
            "uid": "da454a77ef6311ea92f43413e8a4c977",
            "zh_text": "一个底面是圆形的铁炉，地面圆的周长是1.57米.底面积是多少平方米?",
            "en_text": "An iron furnace with a circular bottom surface, the circumference of the ground circle is 1.57 meters. What is the area of ​​the bottom square?",
            "equation": "3.14*(1.57/3.14/2)**2",
            "ans": "0.19625"
        },
        {
            "id": 447,
            "uid": "da454a78ef6311ea92f43413e8a4c977",
            "zh_text": "一个长方形和正方形的面积是1225平方厘米，一个圆的面积是1256平方厘米，这三个图形的周长哪个最大?哪个最小?如果这三个图形的面积相等，你能发现它们的周长之间的大小关系吗?",
            "en_text": "The area of ​​a rectangle and a square is 1225 square centimeters, and the area of ​​a circle is 1256 square centimeters. Which of the three figures has the largest perimeter? Which is the smallest? If the areas of the three figures are equal, you can find the difference between their perimeters Does size matter?",
            "equation": "(2*5+11+13)*3-(2*5+11+13)",
            "ans": "68.0"
        },
        {
            "id": 448,
            "uid": "da454a79ef6311ea92f43413e8a4c977",
            "zh_text": "农家小院用传统的石磨作为粮食加工工具吸引游客.一位游客沿着半径是1米的圆周推磨，走了300圈，大约走了多少米?",
            "en_text": "The farmyard uses a traditional stone mill as a grain processing tool to attract tourists. A tourist walks along a circle with a radius of 1 meter and walks 300 times. How many meters does it travel?",
            "equation": "2*3.14*1*300",
            "ans": "1884.0"
        },
        {
            "id": 449,
            "uid": "da454a7aef6311ea92f43413e8a4c977",
            "zh_text": "广告公司制作了一个底面直径是1.5m，高2.5m的圆柱形灯箱.可以张贴多大面积的海报?",
            "en_text": "The advertising company has produced a cylindrical light box with a bottom diameter of 1.5m and a height of 2.5m. How large a poster can be posted?",
            "equation": "3.14*1.5*2.5",
            "ans": "11.775"
        },
        {
            "id": 450,
            "uid": "da454a7bef6311ea92f43413e8a4c977",
            "zh_text": "修建一个圆柱形的沼气池，底面直径是3m，深2m.在池的四壁与下底面上抹上水泥，抹水泥部分的面积是多少平方米?",
            "en_text": "Build a cylindrical biogas digester with a bottom diameter of 3m and a depth of 2m. Put cement on the four walls and bottom of the pool. What is the area of ​​the cement part?",
            "equation": "3.14*3*2+3.14*(3/2)**2",
            "ans": "25.905"
        },
        {
            "id": 451,
            "uid": "da454a7cef6311ea92f43413e8a4c977",
            "zh_text": "小亚做了一个圆柱形笔筒，高13cm，底面直径8cm她想给笔筒的侧面和底面贴上彩纸，至少需要多少彩纸?",
            "en_text": "Xiaoya made a cylindrical pen holder with a height of 13cm and a bottom diameter of 8cm. She wants to paste colored paper on the side and bottom of the pen holder. How much colored paper is required at least?",
            "equation": "3.14*8*13+3.14*(8/2)**2",
            "ans": "376.8"
        },
        {
            "id": 452,
            "uid": "da454a7def6311ea92f43413e8a4c977",
            "zh_text": "卫生纸的宽度是10cm，中间硬纸轴的直径是3.5cm.制作中间的轴需要多大的硬纸板?",
            "en_text": "The width of the toilet paper is 10cm, and the diameter of the middle hard paper shaft is 3.5cm. How much cardboard is needed to make the middle shaft?",
            "equation": "3.14*(3.5/2)**2",
            "ans": "9.61625"
        },
        {
            "id": 453,
            "uid": "da454a7eef6311ea92f43413e8a4c977",
            "zh_text": "林林做了一个圆柱形的灯笼，高30cm，灯笼底面直径为20cm，上下底面中间分别留出了78.5cm3的口，他用了多少彩纸?",
            "en_text": "Lin Lin made a cylindrical lantern with a height of 30cm and a diameter of 20cm on the bottom of the lantern. There were 78.5cm3 openings between the upper and lower bottoms. How much colored paper did he use?",
            "equation": "3.14*20*30+78.53",
            "ans": "1962.53"
        },
        {
            "id": 454,
            "uid": "da454a7fef6311ea92f43413e8a4c977",
            "zh_text": "一个圆柱形铁皮水桶(无盖)，高12dm，底面直径是高的3/4.做这个水桶大约要用多少铁皮?",
            "en_text": "A cylindrical iron bucket (without cover), 12dm high, and the bottom diameter is 0.75 times the height. How much iron does it take to make this bucket?",
            "equation": "3.14*(1.2*3/4/2)**2+3.14*1.2*3/4*1.2",
            "ans": "4.027049999999999"
        },
        {
            "id": 455,
            "uid": "da454a80ef6311ea92f43413e8a4c977",
            "zh_text": "(1)要将路灯座(如右图)漆上白色的油漆，要漆多少平方米?(2)街心花园有30个这样的灯座，如果油漆灯座每平方米人工费5元，一共需要人工费多少元?",
            "en_text": "(1) How many square meters do you need to paint the street lamp holder (as shown in the picture on the right) with white paint? (2) There are 30 such lamp holders in the street garden. If the paint lamp holder costs 5 yuan per square meter, a total of How much is the labor cost?",
            "equation": "5*30",
            "ans": "150.0"
        },
        {
            "id": 456,
            "uid": "da454a81ef6311ea92f43413e8a4c977",
            "zh_text": "一个圆柱的侧面积是188.4dm2，底面半径是2dm.它的高是多少?",
            "en_text": "The side area of ​​a cylinder is 188.4dm2, and the bottom radius is 2dm. What is its height?",
            "equation": "188.4/(2*3.14*2)",
            "ans": "15.0"
        },
        {
            "id": 457,
            "uid": "da454a82ef6311ea92f43413e8a4c977",
            "zh_text": "一个圆形水桶，高度为87dm，底部直径为66dm，可以装多少水?",
            "en_text": "A round bucket with a height of 87dm and a bottom diameter of 66dm. How much water can it hold?",
            "equation": "3.14*(66/2)**2*87",
            "ans": "297493.02"
        },
        {
            "id": 458,
            "uid": "da454a83ef6311ea92f43413e8a4c977",
            "zh_text": "学校建了两个同样大小的圆柱形花坛.花坛的地面内直径为3m，高为0.8m.如果里面填土的高度为0.5m，两个花坛中共需要填土多少方?",
            "en_text": "The school built two cylindrical flowerbeds of the same size. The inner diameter of the flowerbeds on the ground is 3m and the height is 0.8m. If the height of the filling inside is 0.5m, how much earth does the two flowerbeds need to fill?",
            "equation": "3.14*(3/2)**2*0.5*2",
            "ans": "7.065"
        },
        {
            "id": 459,
            "uid": "da454a84ef6311ea92f43413e8a4c977",
            "zh_text": "一个圆柱的体积是80cm3，底面积是16cm2.它的高是多少厘米?",
            "en_text": "The volume of a cylinder is 80cm3 and the bottom area is 16cm2. What is its height in cm?",
            "equation": "80/16",
            "ans": "5.0"
        },
        {
            "id": 460,
            "uid": "da454a85ef6311ea92f43413e8a4c977",
            "zh_text": "一个圆柱形粮囤，从里面量得底面半径是1.5m，高2m.如果每立方玉米约重750kg，这个粮囤能装多少吨玉米?",
            "en_text": "A cylindrical grain store, measured from the inside, has a bottom radius of 1.5m and a height of 2m. If a cubic corn weighs about 750kg, how many tons of corn can this grain store contain?",
            "equation": "750*3.14*1.5**2*2/1000",
            "ans": "10.5975"
        },
        {
            "id": 461,
            "uid": "da454a86ef6311ea92f43413e8a4c977",
            "zh_text": "学校要在教学区和操场之间建一道围墙，原计划用土石35m3.后来多开了一个月亮门，减少了土石的用量.现在用了多少立方米土石?",
            "en_text": "The school wanted to build a wall between the teaching area and the playground. The original plan was to use 35m3 of earth and rock. Later, an additional moon gate was opened to reduce the amount of earth and rock. How many cubic meters of earth and rock are now used?",
            "equation": "35-35",
            "ans": "0.0"
        },
        {
            "id": 462,
            "uid": "da454a87ef6311ea92f43413e8a4c977",
            "zh_text": "明明家里来了两位小客人，妈妈冲了800ml果汁.如果用三只高11cm，底面直径为6cm的玻璃杯喝果汁，明明和客人每人一杯够吗?",
            "en_text": "There were two young guests at Mingming's house, and my mother made 800ml of juice. If three glasses with a height of 11cm and a bottom diameter of 6cm were used to drink juice, would Mingming and the guests each have enough?",
            "equation": "800/(3.14*(6/2)**2*11*3/100)",
            "ans": "85.78352527397112"
        },
        {
            "id": 463,
            "uid": "da454a88ef6311ea92f43413e8a4c977",
            "zh_text": "两个底面积相等的圆柱，一个高4.5dm，体积为81dm3.另一个高为3dm，它的体积是多少?",
            "en_text": "Two cylinders with the same base area, one is 4.5dm high and the volume is 81dm3. The other is 3dm high, what is its volume?",
            "equation": "81/4.5*3",
            "ans": "54.0"
        },
        {
            "id": 464,
            "uid": "da454a89ef6311ea92f43413e8a4c977",
            "zh_text": "同学们用彩纸制作了20个圆柱形灯罩，每个灯罩高35cm，底面圆的周长是47.1cm.至少需要用多少彩纸?",
            "en_text": "The students made 20 cylindrical lampshades with colored paper, each lampshade is 35cm high, and the circumference of the bottom circle is 47.1cm. At least how much colored paper do I need?",
            "equation": "3.14*(47.1/3.14/2)**2*2*20",
            "ans": "7065.0"
        },
        {
            "id": 465,
            "uid": "da454a8aef6311ea92f43413e8a4c977",
            "zh_text": "一个圆柱形沙堆，底面积是28.26m2，高是2.5m.用这堆沙在10m宽的公路上铺2cm厚的路面，能铺多少米?",
            "en_text": "A cylindrical sand pile with a bottom area of ​​28.26m2 and a height of 2.5m. Use this pile of sand to spread a 2cm-thick pavement on a 10m wide road. How many meters can be paved?",
            "equation": "1/3*28.26*2.5/(10*2/100)",
            "ans": "117.75"
        },
        {
            "id": 466,
            "uid": "da454a8bef6311ea92f43413e8a4c977",
            "zh_text": "一台压路机，前轮直径1m，轮宽1.2m，工作时每分钟滚动15周.这台压路机工作一分钟前进了多少米?工作一分钟前轮压过的路面是多少平方米?",
            "en_text": "A road roller has a front wheel diameter of 1m and a wheel width of 1.2m. It rolls 15 weeks per minute when it is working. How many meters does this road roller move forward in one minute? How many square meters of road does the front wheel press on for one minute?",
            "equation": "3.14*1*15*1.2",
            "ans": "56.52"
        },
        {
            "id": 467,
            "uid": "da454a8cef6311ea92f43413e8a4c977",
            "zh_text": "一个正八边形的边长是3厘米，用一条彩带围一圈后，还多出来2厘米，这条彩带有多长?",
            "en_text": "The side length of a regular octagon is 3 cm. After using a ribbon to surround it, there is an extra 2 cm. How long is this ribbon?",
            "equation": "3*8+2",
            "ans": "26.0"
        },
        {
            "id": 468,
            "uid": "da454a8def6311ea92f43413e8a4c977",
            "zh_text": "大生用小棒摆了8个六边形.如果用这些小棒摆正方形，可以摆几个?",
            "en_text": "Dasheng used small sticks to put 8 hexagons. If you use these small sticks to put a square, how many can you put?",
            "equation": "6*8/4",
            "ans": "12.0"
        },
        {
            "id": 469,
            "uid": "da454a8eef6311ea92f43413e8a4c977",
            "zh_text": "300个同学乘4辆汽车去郊游.前3辆车各坐78个同学，第4辆车要坐多少个同学?",
            "en_text": "300 classmates took 4 cars to go on an outing. The first 3 cars each took 78 classmates, how many classmates should the fourth car take?",
            "equation": "300-78*3",
            "ans": "66.0"
        },
        {
            "id": 470,
            "uid": "da454a8fef6311ea92f43413e8a4c977",
            "zh_text": "小明一家乘火车去旅游，每张火车票215元，回来还乘火车，这次旅游买火车票一共花了多少钱?",
            "en_text": "Xiaoming's family traveled by train. Each train ticket was 215 yuan. When they came back, they took the train. How much did it cost to buy train tickets this time?",
            "equation": "215*3*2",
            "ans": "1290.0"
        },
        {
            "id": 471,
            "uid": "da45717aef6311ea92fe3413e8a4c977",
            "zh_text": "一共有240kg水果糖，每袋装1/4kg，现在已经装完了3/4.问已经装完了多少袋?",
            "en_text": "There are a total of 240 kg of fruit candy, each bag contains 0.25 times kg, and now it has been filled 0.75 times. How many bags have been filled?",
            "equation": "240/(1/4)*3/4",
            "ans": "720.0"
        },
        {
            "id": 472,
            "uid": "da45717bef6311ea92fe3413e8a4c977",
            "zh_text": "城关一小和城关二小的男生人数分别占全校学生总数的52%.城关一小有学生800人，城关二小有学生750人，哪个学校的男生多?多多少人?",
            "en_text": "The number of boys in Chengguan No. 1 Primary School and Chengguan No. 2 Primary School each accounted for 0.52 times the total number of students in the school. Chengguan No. 1 Primary School has 800 students, and Chengguan No. 2 Primary School has 750 students. Which school has more boys? How many?",
            "equation": "800*52/100-750*52/100",
            "ans": "26.0"
        },
        {
            "id": 473,
            "uid": "da45717cef6311ea92fe3413e8a4c977",
            "zh_text": "四月份有30天.(1)四月份有几个星期，还多几天?(2)如果四月份有5个星期六和星期日，那么4月1日是星期几?",
            "en_text": "There are 30 days in April. (1) How many weeks are there in April, and how many more days? (2) If there are 5 Saturdays and Sundays in April, then what day is April 1st?",
            "equation": "1",
            "ans": "1.0"
        },
        {
            "id": 474,
            "uid": "da45717def6311ea92fe3413e8a4c977",
            "zh_text": "张华今年5月份满10岁，他是哪年出生的?",
            "en_text": "Zhang Hua turned 10 in May this year. When was he born?",
            "equation": "2012-10",
            "ans": "2002.0"
        },
        {
            "id": 475,
            "uid": "da45717eef6311ea92fe3413e8a4c977",
            "zh_text": "一个邮筒，每天取信3次，早8:30第一次取信，以后每隔4小时取一次信.请你算出第二次和第三次取信时间.",
            "en_text": "A postbox, 3 times a day, the first time at 8:30 in the morning, and then every 4 hours. Please calculate the second and third time.",
            "equation": "16/(3-1)",
            "ans": "8.0"
        },
        {
            "id": 476,
            "uid": "da45717fef6311ea92fe3413e8a4c977",
            "zh_text": "画展每天开放的时间是8:00---17:00.这个画展每天展出多长时间?",
            "en_text": "The exhibition is open every day from 8:00 to 17:00. How long is the exhibition every day?",
            "equation": "8",
            "ans": "8.0"
        },
        {
            "id": 477,
            "uid": "da457180ef6311ea92fe3413e8a4c977",
            "zh_text": "春风饭店营业时间:午餐11:00---14:00晚餐17:00—20:30.一天工营业多长时间?(2)你还能提出哪些问题?",
            "en_text": "Spring Breeze Hotel business hours: lunch 11:00-14:00 dinner 17:00-20:30. How long is it open a day? (2) What other questions can you ask?",
            "equation": "30-10",
            "ans": "20.0"
        },
        {
            "id": 478,
            "uid": "da457181ef6311ea92fe3413e8a4c977",
            "zh_text": "(1)阳阳晚上9时睡觉，第二天早上6时起床，她一共睡了多少小时?",
            "en_text": "(1) Yang Yang went to bed at 9 p.m. and got up at 6 a.m. the next morning. How many hours did she sleep?",
            "equation": "12-9+6",
            "ans": "9.0"
        },
        {
            "id": 479,
            "uid": "da457182ef6311ea92fe3413e8a4c977",
            "zh_text": "课外小组14:30开始活动，经过1小时20分结束.结束时间是几时几分?",
            "en_text": "The extracurricular group starts at 14:30 and ends after 1 hour and 20 minutes. When is the end time?",
            "equation": "1+1/3",
            "ans": "1.3333333333333333"
        },
        {
            "id": 480,
            "uid": "da457183ef6311ea92fe3413e8a4c977",
            "zh_text": "火车T11次列车10:22从北京开出，当天19:29分到达沈阳.火车运行多长时间?",
            "en_text": "Train T11 leaves Beijing at 10:22 and arrives in Shenyang at 19:29 the same day. How long does the train run?",
            "equation": "30+31",
            "ans": "61.0"
        },
        {
            "id": 481,
            "uid": "da457184ef6311ea92fe3413e8a4c977",
            "zh_text": "火车T21次列车18:00从北京开出，第二天8:00分到达上海.火车运行多长时间?",
            "en_text": "Train T21 train leaves Beijing at 18:00 and arrives in Shanghai at 8:00 the next day. How long does the train run?",
            "equation": "6+8/10",
            "ans": "6.8"
        },
        {
            "id": 482,
            "uid": "da457185ef6311ea92fe3413e8a4c977",
            "zh_text": "火车T42次列车17:48从西安开出，第二天7:23分到达北京.火车运行多长时间?",
            "en_text": "Train T42 leaves Xi'an at 17:48 and arrives in Beijing at 7:23 the next day. How long does the train run?",
            "equation": "24-7.3+24",
            "ans": "40.7"
        },
        {
            "id": 483,
            "uid": "da457186ef6311ea92fe3413e8a4c977",
            "zh_text": "一场篮球赛从19:30分开始，进行了155分钟，比赛结束是什么时间?",
            "en_text": "A basketball game started at 19:30 and lasted for 155 minutes. When is the end of the game?",
            "equation": "155/30+15",
            "ans": "20.166666666666668"
        },
        {
            "id": 484,
            "uid": "da457187ef6311ea92fe3413e8a4c977",
            "zh_text": "小象体重平均每年增加200千克，它出生时只有100千克重，20年后这头大象重多少千克?",
            "en_text": "The baby elephant's weight increases by an average of 200 kilograms per year. It weighs only 100 kilograms at birth. How much kilograms will this elephant weigh in 20 years?",
            "equation": "200*20+100",
            "ans": "4100.0"
        },
        {
            "id": 485,
            "uid": "da457188ef6311ea92fe3413e8a4c977",
            "zh_text": "小明买20枚8角的邮票和30枚6角的邮票，一共要付多少钱?",
            "en_text": "How much does Xiao Ming have to pay for 20 octagonal stamps and 30 six-point stamps?",
            "equation": "(8*20+6*30)/10",
            "ans": "34.0"
        },
        {
            "id": 486,
            "uid": "da457189ef6311ea92fe3413e8a4c977",
            "zh_text": "参加语文课外小组的有8人，参加数学课外小组的有9人，两个小组都参加的有3人，参加语文数学课外小组的共有多少人?",
            "en_text": "8 people participated in the Chinese extracurricular group, 9 people participated in the math extracurricular group, and 3 people participated in both groups. How many people participated in the language math extracurricular group?",
            "equation": "8+9-3",
            "ans": "14.0"
        },
        {
            "id": 487,
            "uid": "da45718aef6311ea92fe3413e8a4c977",
            "zh_text": "汉堡加鸡翅每份18元，汉堡、鸡翅加薯条每份21元，有60元，买3份有几种买法?",
            "en_text": "Burgers and chicken wings are 18 yuan per serving, burgers, chicken wings and fries are 21 yuan each, there are 60 yuan, how many ways to buy 3 servings?",
            "equation": "3",
            "ans": "3.0"
        },
        {
            "id": 488,
            "uid": "da45718bef6311ea92fe3413e8a4c977",
            "zh_text": "一本杂志是月刊，每月发行一期.最新的一期是第72期.这本杂志创刊多少年了?",
            "en_text": "A magazine is a monthly issue and is issued every month. The latest issue is the 72nd issue. How many years has this magazine been published?",
            "equation": "72/12",
            "ans": "6.0"
        },
        {
            "id": 489,
            "uid": "da45718cef6311ea92fe3413e8a4c977",
            "zh_text": "学校有大米850千克，运了3车，还剩100千克.平均每车运多少千克?",
            "en_text": "The school has 850 kilograms of rice, 3 trucks have been transported, and 100 kilograms are left. How many kilograms per truck are transported on average?",
            "equation": "(850-100)/3",
            "ans": "250.0"
        },
        {
            "id": 490,
            "uid": "da45718def6311ea92fe3413e8a4c977",
            "zh_text": "科考队3月1日出发去野外考察.计划7月31日返回，实际7月26日返回，科考队这次考察一共花了多少时间?",
            "en_text": "The scientific expedition team set off on March 1 for a field study. It is planned to return on July 31, but the actual return on July 26. How much time did the scientific expedition team spend on this investigation?",
            "equation": "31*2+26",
            "ans": "88.0"
        },
        {
            "id": 491,
            "uid": "da45718eef6311ea92fe3413e8a4c977",
            "zh_text": "一座大楼高29.2m，一楼准备开商店，层高4米，上面9层是住宅.住宅每层高多少米?",
            "en_text": "A building is 29.2m high, with a store on the first floor, 4 meters high, and 9 floors above are residential buildings. How many meters are each storey?",
            "equation": "(29.2-4)/9",
            "ans": "2.8"
        },
        {
            "id": 492,
            "uid": "da45718fef6311ea92fe3413e8a4c977",
            "zh_text": "一幢楼共有15层，高42m，小萍家住6楼，那么她家的地板到地面有多高?",
            "en_text": "A building has 15 floors and a height of 42m. Xiaoping's family lives on the 6th floor. So how high is the floor of her house to the ground?",
            "equation": "42/15*(6-1)",
            "ans": "14.0"
        },
        {
            "id": 493,
            "uid": "da457190ef6311ea92fe3413e8a4c977",
            "zh_text": "在通常情况下，体积相等的冰的质量比水的质量少1/10.现有一块重9kg的冰，如果有一桶水的体积和这块冰的体积相等，这桶水有多重?",
            "en_text": "Under normal circumstances, the mass of an equal volume of ice is 0.1 times less than the mass of water. There is a piece of ice weighing 9kg. If the volume of a bucket of water is equal to the volume of this piece of ice, how heavy is this bucket of water?",
            "equation": "9/(1-1/10)",
            "ans": "10.0"
        },
        {
            "id": 494,
            "uid": "da457191ef6311ea92fe3413e8a4c977",
            "zh_text": "答对一题加10分，答错一题扣6分，(1)2号选手共抢答8道题，最后得分64分，她答对了几题?(2)一号选手共抢答10题，最后得36分，他答错了几题?(3)3号选手共抢答16题，最后得分16分，他答对了几题?",
            "en_text": "A correct answer will add 10 points, and a wrong answer will be deducted 6 points. (1) Contestant number 2 answers 8 questions, and finally scores 64 points. How many questions did she answer correctly? (2) Contestant number 1 answers 10 questions, and finally He scored 36 points. How many questions did he answer wrong? (3) Contestant number 3 answered 16 questions and finally scored 16 points. How many questions did he answer correctly?",
            "equation": "16-(10*(16-64)/(10+6)-16)/(6+10)",
            "ans": "18.875"
        },
        {
            "id": 495,
            "uid": "da457192ef6311ea92fe3413e8a4c977",
            "zh_text": "爸爸给小红买了一个等腰三角形的风筝.它的一个底角是70°，它的顶角是多少度?",
            "en_text": "Dad bought an isosceles triangle kite for Xiaohong. One of its base angles is 70°, what is its top angle?",
            "equation": "180-70*2",
            "ans": "40.0"
        },
        {
            "id": 496,
            "uid": "da457193ef6311ea92fe3413e8a4c977",
            "zh_text": "李明用一根1M长的铁丝围了一个三角形，量得三角形的一边是1/4M，另一边是3/8M，第三条边长是多少米?它是一个什么三角形?",
            "en_text": "Li Ming used a 1M iron wire to enclose a triangle, and measured that one side of the triangle is 0.25 times M and the other side is 0.375 times M. How long is the third side in meters? What kind of triangle is it?",
            "equation": "1-1/4-3/8",
            "ans": "0.375"
        },
        {
            "id": 497,
            "uid": "da457194ef6311ea92fe3413e8a4c977",
            "zh_text": "用84cm长的铁丝围成一个三角形，这个三角形三边长度的比是3:4:6，三条边长各是多少厘米?",
            "en_text": "Use 84cm long iron wire to form a triangle. The ratio of the length of the three sides of this triangle is 3:4:6. How many centimeters are each of the three sides?",
            "equation": "84*6/(3+4+6)",
            "ans": "38.769230769230774"
        },
        {
            "id": 498,
            "uid": "da457195ef6311ea92fe3413e8a4c977",
            "zh_text": "一个平行四边形和一个三角形等底等高.已知平行四边形的面积是30cm2，三角形的面积是多少?",
            "en_text": "A parallelogram and a triangle have the same base height. Knowing that the area of ​​the parallelogram is 30cm2, what is the area of ​​the triangle?",
            "equation": "302/2",
            "ans": "151.0"
        },
        {
            "id": 499,
            "uid": "da459858ef6311ea93083413e8a4c977",
            "zh_text": "一辆汽车的后车窗有一块梯形的遮阳布，上底是1m，下底是1.2m，高0.7m，它的面积是多少?",
            "en_text": "The rear window of a car has a trapezoidal shade cloth. The upper bottom is 1m, the lower bottom is 1.2m, and the height is 0.7m. What is its area?",
            "equation": "(1+1.2)*0.7/2",
            "ans": "0.77"
        },
        {
            "id": 500,
            "uid": "da459859ef6311ea93083413e8a4c977",
            "zh_text": "鸡和兔数量相同，两种动物的腿加起来共有48条，鸡和兔各有多少只?",
            "en_text": "There are the same number of chickens and rabbits. The total number of legs of the two animals is 48. How many chickens and rabbits each have?",
            "equation": "48/(2+4)",
            "ans": "8.0"
        },
        {
            "id": 501,
            "uid": "da45985aef6311ea93083413e8a4c977",
            "zh_text": "笼子里有若干只鸡和兔，从上面数，有8个头，从下面数，有26只脚.鸡和兔各有几只?",
            "en_text": "There are several chickens and rabbits in the cage, counting from the top, there are 8 heads, from the bottom, there are 26 feet. How many chickens and rabbits each?",
            "equation": "8-(26-2*8)/(4-2)",
            "ans": "3.0"
        },
        {
            "id": 502,
            "uid": "da45985bef6311ea93083413e8a4c977",
            "zh_text": "有龟和鹌共40只，龟的腿和鹌的腿共有112条，龟，鹌各有几只?",
            "en_text": "There are a total of 40 tortoises and quails, a total of 112 tortoise legs and quacks, how many turtles and quails each?",
            "equation": "40-(112-40*2)/(4-2)",
            "ans": "24.0"
        },
        {
            "id": 503,
            "uid": "da45985cef6311ea93083413e8a4c977",
            "zh_text": "自行车和三轮车共10辆，总共有26个轮子，自行车和三轮车各有多少辆?",
            "en_text": "There are 10 bicycles and tricycles, with a total of 26 wheels.How many bicycles and tricycles each?",
            "equation": "10-(26-10*2/(3-2))",
            "ans": "4.0"
        }
    ]
}